{
    "data": [
        {
            "id": 9749257,
            "companyId": 400,
            "name": "Analista de Planejamento Financeiro Sr. (Foco em Dados)",
            "description": "Quando você pensa em carreira, o que vem à sua mente? Propósito? Colaboração? Ser protagonista para fazer a diferença? No PagBank temos tudo isso e muito mais. 💛&nbsp;Estamos em busca de pessoas que vistam a camisa com orgulho. Gente com vontade de facilitar a vida financeira das pessoas e impulsionar negócios!&nbsp;Tá a fim de uma carreira que rende mais?&nbsp;Confira essa oportunidade e #VemProPags!Responsabilidades e atribuiçõesAtuar em projetos de budget, forecast e projeções financeiras, integrando análises de dados avançadas.Manipular e consolidar grandes bases de dados provenientes de diferentes sistemas.Utilizar SQL e bancos de dados para extração, tratamento e modelagem de informações financeiras.Desenvolver e manter dashboards e relatórios em Power BI, garantindo clareza e precisão.Apoiar o time de FP&amp;A na análise de P&amp;L, cash flow e KPIs.Automatizar processos e propor melhorias baseadas em data analytics.Atuar de forma consultiva junto às áreas de negócio, fornecendo insights estratégicos baseados em dados.Requisitos e qualificaçõesSuperior completo em Engenharia, Ciência de Dados, Economia, Administração ou áreas correlatas.Experiência sólida em análise de dados aplicada a finanças.Domínio de SQL e experiência em bancos de dados relacionais.Conhecimento em Excel avançado e manipulação de grandes volumes de informações.Experiência em Power BI (ou ferramentas similares de BI e Data Viz).Informações adicionaisPara se destacar nesta posição seria legal se você também tivesse:Experiência no setor financeiro, bancário, fintechs ou meios de pagamento.Conhecimentos em Python ou R para modelagem e automação de análises.Experiência em projetos de data pipeline e integração de dados.",
            "careerPageId": 376,
            "careerPageName": "PagBank",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/400/career/376/images/2020-07-22_18-13_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-25T13:35:25.886Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://pagseguro.gupy.io/job/eyJqb2JJZCI6OTc0OTI1Nywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://pagseguro.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9748351,
            "companyId": 23930,
            "name": "ANALISTA ADMINISTRATIVO JR",
            "description": "A hora de fazer parte de um time comprometido, acolhedor e que leva saúde para milhões de pessoas, é agora!Estamos na busca de profissionais para compor a nossa equipe!Se você é comprometido(a) e apaixonado(a) por novos desafios, aqui é o seu lugar!Faça seu cadastro e envie seu currículo!Responsabilidades e atribuiçõesAcompanhamentos de processos administrativos; Acolhimento a pacientes, realizar escuta ativa e comunicação assertiva;Auxiliar na orientação de uso do aplicativo e site da operadora;Auxiliar nos agendamentos de consultas e exames;Realizar cliente oculto;Possuir visão sensível para identificar problemas e auxiliar na construção de projetos internos;Requisitos e qualificaçõesObrigatório: Ensino Superior completo/cursando.Desejável:  Pacote Office intermediário.Informações adicionaisCarga horária: 200:00 10:00 12:00 13:00 19:00 SEG A SEX (5X2)﻿Unidade: Avenida presidente Kennedy, 1845, Vila Marinópolis- Rondonópolis MT﻿O que oferecemos?Vale Alimentação;Vale Transporte;Assistência Médica;Assistência Odontológica;Convênio com Farmácia;Seguro de Vida;Auxílio Creche;Totalpass;Universidade Corporativa;Interclube (programa de descontos);Programa Conte Comigo.",
            "careerPageId": 163712,
            "careerPageName": "Página de Carreira",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/23930/career/163712/images/2025-02-19_12-52_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-25T12:13:37.344Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Cuiabá",
            "state": "Mato Grosso",
            "country": "Brasil",
            "jobUrl": "https://hapvidandi.gupy.io/job/eyJqb2JJZCI6OTc0ODM1MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "on-site",
            "careerPageUrl": "https://hapvidandi.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9740850,
            "companyId": 487,
            "name": "Analista de Laboratório ",
            "description": "Você tem paixão pelas pessoas e gosta de cuidar de gente?&nbsp;Na Dasa, além de uma empresa reconhecida em gestão em cuidados, contamos com mais de 59 marcas entre medicina diagnóstica e hospitais, distribuídas em mais de 900 unidades no Brasil. Cuidamos e acolhemos mais de 20 milhões de pessoas por ano, acolhemos a vida, a saúde e as relações, de forma integral e apaixonada.Saúde é uma área complexa. No time assistencial, você encontra um ambiente ágil com pessoas que cuidam, acolhem e transformam o jeito de fazer saúde.Seja você a pessoa que transforma o futuro da saúde, #VemSerDasa. 🚀💙&nbsp;#VemPraDasa #DasaLovers #VemSerDasa&nbsp;📌 Importante: não efetuamos cobranças de taxas em nossos processos seletivos&nbsp;Responsabilidades e atribuições🔎 Sobre a posição:Responsável por realizar a análise de inconsistências em todas as metodologias utilizadas na rotina diagnóstica do setor, além de exercitar, durante o período de treinamento, a interpretação de resultados e resolução de problemas;Processamento e resolução de problemas provenientes aos setores técnicos operacionais de acordo com o setor técnico;Pós analítica - Análise de consistência, liberação de resultados, retificação, recoleta e outras funções associadas (quando aplicável ao setor).Requisitos e qualificaçõesSe você acredita no cuidado que acolhe e quer transformar a saúde no mundo, em nossa área assistenciais você encontra um lugar de cuidado e acolhimento.🎯 Para transformar a saúde é preciso:Formação: Ensino Superior Completo em Farmácia Bioquímica, Biologia ou Biomedicina;Registro profissional ativo;Desejável: Experiência na área;Conhecimento do pacote Office.Informações adicionaisÉ cuidando da nossa gente que vamos ser a saúde que as pessoas desejam e que o mundo precisa, confira os nossos benefícios:Cuidados com a alimentação: Vale Refeição/Vale Alimentação ou Refeitório no local de trabalho (de acordo com a localidade);Cuidados com a saúde: Plano de Saúde e Seguro de Vida;Cuidados com o seu desenvolvimento: Universidade Dasa, Ciclo de Desenvolvimento e Carreira, Academias de Tecnologia/PMAX e Programa Crescer dentro da Dasa;Outros: Vale Transporte e Bonificação por desempenho (PPR).💰 Só a Dasa tem – Programa&nbsp;de Saúde&nbsp;, pautado em 5 pilares:&nbsp;Espiritual: yoga, meditação e mindfulness;Físico: Totalpass, clínica de atenção primária, descontos em exames e vacinas;Intelectual: Universidade Dasa;Relacional: Clube de vantagens UAU e benefícios SESC;Emocional: Telepsicologia.*Os benefícios podem sofrer alteração de acordo com a região da vaga e da marca.📌 Importante: Você está se candidatando para o nosso banco de talentos para vagas em todo o Brasil, nas localidades em que a Dasa possui operações (regiões Nordeste, Centro Oeste, Sudeste e Sul do Brasil), portanto, ressaltamos que assim que surgir uma vaga que melhor se adeque ao seu perfil, entraremos em contato com você. Enquanto isso, mantenha as suas informações atualizadas e cumpra todas as etapas de testes online, assim, podemos conhecer mais sobre você.",
            "careerPageId": 82115,
            "careerPageName": "Dasa",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/487/career/82115/images/2024-10-24_13-50_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-22T19:41:22.516Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Serra",
            "state": "Espírito Santo",
            "country": "Brasil",
            "jobUrl": "https://dasaassistencial.gupy.io/job/eyJqb2JJZCI6OTc0MDg1MCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://dasaassistencial.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9738884,
            "companyId": 400,
            "name": "Analista de Planejamento Comercial Sr.",
            "description": "Quando você pensa em carreira, o que vem à sua mente? Propósito? Colaboração? Ser protagonista para fazer a diferença? No PagBank temos tudo isso e muito mais. 💛&nbsp;Estamos em busca de pessoas que vistam a camisa com orgulho. Gente com vontade de facilitar a vida financeira das pessoas e impulsionar negócios!&nbsp;Tá a fim de uma carreira que rende mais?&nbsp;Confira essa oportunidade e #VemProPags!Responsabilidades e atribuiçõesSer responsável pelo desenho das metas para a área Comercial.Planejar, gerenciar e executar projetos estratégicos para o time Comercial.Auxiliar no controle e reporte para a área Comercial.Executar análises diversas da área Comercial de performance e de topo.Desenvolver relatórios gerenciais de acompanhamento.Buscar oportunidades escaláveis de otimização com novas estratégias e processos com os times comerciais e de suporte.Propor melhoria nos processos existentes com intuito de minimizar os impactos na área Comercial.Acompanhar, gerenciar e reportar resultados de campanhas do time Comercial.Apoiar os demais analistas do time.Requisitos e qualificaçõesSuperior em Marketing, Administração, Economia, Engenharia, Estatística ou áreas correlatas.Experiência em análise de dados em SQL.Experiência desenvolvimento de Dashboard em PowerBi.Experiência com análises em Excel.Informações adicionaisPara se destacar nesta posição seria legal se você também tivesse:Experiência desenvolvimento de Dashboard em PowerBi.Experiência na área comercial.",
            "careerPageId": 376,
            "careerPageName": "PagBank",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/400/career/376/images/2020-07-22_18-13_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-22T16:58:22.412Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://pagseguro.gupy.io/job/eyJqb2JJZCI6OTczODg4NCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://pagseguro.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9738834,
            "companyId": 400,
            "name": "Analista de Planejamento Comercial Jr.",
            "description": "Quando você pensa em carreira, o que vem à sua mente? Propósito? Colaboração? Ser protagonista para fazer a diferença? No PagBank temos tudo isso e muito mais. 💛&nbsp;Estamos em busca de pessoas que vistam a camisa com orgulho. Gente com vontade de facilitar a vida financeira das pessoas e impulsionar negócios!&nbsp;Tá a fim de uma carreira que rende mais?&nbsp;Confira essa oportunidade e #VemProPags!Responsabilidades e atribuiçõesAnalisar possíveis problemas e propor melhoria.&nbsp;Desenvolver novos processos com intuito de reduzir tempo de execução.Analisar o processo de gerenciamentos de clientes.Realizar marcações e migrações de clientes gerenciados.Atualizar relatórios de acompanhamentos dos gerenciamentos de clientes.&nbsp;Desenvolver matérias para reciclagem da comercial junto ao time de treinamento.Requisitos e qualificaçõesSuperior em Marketing, Administração, Economia, Engenharia, Estatística ou áreas correlatas.Experiência com elaboração de apresentação em PowerPoint.Experiência com Excel intermediário a avançado (tabela dinâmica, fórmulas e gráficos).Experiência com Word e PowerPoint básico a avançado (Documentação e Apresentações).Informações adicionaisPara se destacar nesta posição seria legal se você também tivesse:Experiência em análise de dados no Excel.Experiência na área comercial.",
            "careerPageId": 376,
            "careerPageName": "PagBank",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/400/career/376/images/2020-07-22_18-13_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-22T16:53:55.696Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://pagseguro.gupy.io/job/eyJqb2JJZCI6OTczODgzNCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://pagseguro.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9617819,
            "companyId": 2276,
            "name": "Analista de Inteligência Comercial II | São Bernardo do Campo |SP",
            "description": "Atuação com processos e monitoramento do comportamento de mercado para a companhia na trilha de atuação visando transformar dados em informações para embasamento nas tomadas de decisões e ações táticas de vendas.&nbsp;Responsabilidades e atribuiçõesCriar relatórios, painéis e dashboard com indicadores e métricas de vendas, apoiando com visão analítica e entendendo como os ambientes internos e externos afetam a performance do time de vendas;Apoiar na construção de estudos estratégicos através de fontes externas, transformando informações em apresentações com insights e ações para a força de vendas e recomendar ações para a liderança e unidades de negócio;Criar e acompanhar planos de ação identificando oportunidades alinhadas aos processos conforme a diretriz estratégica e garantir que o modelo seja padronizado em toda a companhia e verticais de negócios, bem como implementar processos novos necessários e garantir melhoria contínua;Apoiar na projeção de cenários através da avaliação da correlação entre as variáveis macroeconômicas, específicas de demanda do mercado e internas dos produtos;&nbsp;Requisitos e qualificaçõesSuperior em Estatística, Administração de Empresas, Engenharia ou EconomiaDesejável – Inteligência de Mercado, Inteligência Comercial, Planejamento estratégico e FinançasAnálises com tabelas de fato e dimensão;Modelos e análises de dados;Informações adicionaisBenefícios e parcerias:&nbsp;PLRVale Refeição e/ou Vale AlimentaçãoCartão flexívelVale TransporteEmpréstimo consignado (após 6 meses de empresa)Seguro de VidaRede social corporativa (parceria com diversos estabelecimentos com descontos e benefícios exclusivos)Programa de treinamento e capacitação (Universidade Tecnogera)Estacionamento (por ordem de chegada)Café da manhãDay off no aniversário&nbsp;&nbsp;Programas de saúde e bem estar:&nbsp;Plano de saúdePlano odontológicoSaúde emocional: sessões de psicoterapia 100% custeadas pela empresa&nbsp;GympassGinástica laboral",
            "careerPageId": 3963,
            "careerPageName": "Tecnogera Geradores",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/2276/career/3963/images/2025-05-20_20-15_companyLogoUrl.jpg",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-08-21T17:00:24.714Z",
            "applicationDeadline": "2026-09-30T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "São Bernardo do Campo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://tecnogera.gupy.io/job/eyJqb2JJZCI6OTYxNzgxOSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://tecnogera.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9730528,
            "companyId": 62539,
            "name": "Analista Sênior de  FP&A ( Belo Horizonte )",
            "description": "A&nbsp;Onfly&nbsp;é uma startup focada em ajudar as empresas a viajarem melhor!Democratizar a gestão de viagens, reembolsos, descontos em passagens, hotéis e locação de carros em uma experiência completa e simples é foco do nosso negócio.Somos um dos melhores lugares para se trabalhar no Brasil (inclusive somos uma das empresas do&nbsp;Great Place to work)!Para que alcancemos a meta de crescer exponencialmente, buscamos pessoas que sejam apaixonadas por tecnologia, que desejam estar em um time de alta performance e que queiram crescer muuuuito.Para a vaga de&nbsp;ANALISTA SÊNIOR FP&amp;A &nbsp;Estamos buscando um Analista Sênior de FP&amp;A para atuar em uma empresa de tecnologia de rápido crescimento, apoiando decisões estratégicas por meio de análises financeiras robustas, modelagem e acompanhamento de performance. Esse profissional será peça-chave na consolidação, análise e comunicação dos resultados, bem como no planejamento e projeções de curto e longo prazo.&nbsp;Local : BH ou SP HíbridoResponsabilidades e atribuiçõesPlanejamento e Forecast: Apoiar no ciclo de orçamento anual (Budget), revisões de Forecast e projeções de longo prazo, garantindo consistência e alinhamento com as metas estratégicas.Análises de Performance: Acompanhar resultados mensais (real x orçamento x forecast), com análise de variações e identificação de riscos e oportunidades.Modelagem Financeira: Desenvolver e manter modelos financeiros dinâmicos e de alta complexidade para suportar decisões de investimento, pricing, expansão e novos produtos.Dashboards e Indicadores: Criar e atualizar relatórios gerenciais e dashboards para monitorar KPIs para SaaS e Marketplace, análises de cohorts, retenção, e métricas operacionais e financeiras.Parceria com Áreas de Negócio: Atuar como business partner para áreas de Produto, Vendas, Marketing e Operações, traduzindo impactos financeiros e orientando decisões.Análises Ad-hoc: Preparar análises econômicas específicas para fundraising, cenários de crescimento e eficiência operacional.Governança de Dados: Garantir a acurácia das informações financeiras e operacionais utilizadas nos relatórios e análises.Requisitos e qualificaçõesRequisitos:Formação em Administração, Economia, Engenharia, Ciências Contábeis ou áreas correlatas.Experiência prévia em FP&amp;A, controladoria ou consultoria financeira (mínimo 5 anos).Experiência prévia em empresa de alto crescimento, fundo de investimento e/ou boutique (desejável).Forte capacidade analítica e habilidade com modelagem financeira avançada&nbsp;Experiência com ferramentas de BI e Bancos de DadosConhecimento sólido em contabilidade gerencial e conceitos de performance financeira (DRE, Balanço, Fluxo de Caixa).Capacidade de comunicação clara e objetiva, inclusive para públicos não financeiros.Inglês avançado.- domínio em escrita&nbsp;.﻿DesejávelMentalidade de dono, com alta proatividade e curiosidade para entender o negócio.Conforto para trabalhar em ambientes dinâmicos, com mudanças rápidas e múltiplas prioridades.Capacidade de transformar dados complexos em insights acionáveis.Colaboração e habilidade para dialogar com diferentes áreasInformações adicionaisBenefícios de ser Onflyer:Escritório incrível! (regime presencial - 9h às 18h seg à sex);Vale refeição Belo Horizonte R$35,00 (sem desconto);Vale transporte: (sem desconto);Plano de Saúde em BH e SP sem coparticipação e sem mensalidade (por nossa conta :D);Plano Odontológico (desconto na mensalidade)Desconto Farmácia;No dress code;Descontos em sessões de terapia pela Plataforma Vittude;Gympass;Pagamos metade da sua academia (TotalPass);Bolsa de 90% para estudos de idiomas;Licença Maternidade/Paternidade estendida;Descontos em Graduações e Pós-graduações (UNA e UNIBH);Seguro de vidaAuxilio funeral + pacote Ducash para Onflyers;Quer impulsionar sua carreira? Vem para a&nbsp;#OnFly",
            "careerPageId": 141482,
            "careerPageName": "Novas oportunidades na Onfly!",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/62539/career/141482/images/2024-11-06_20-18_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-08-21T14:22:11.548Z",
            "applicationDeadline": "2026-10-31T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Belo Horizonte",
            "state": "Minas Gerais",
            "country": "Brasil",
            "jobUrl": "https://onfly.gupy.io/job/eyJqb2JJZCI6OTczMDUyOCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://onfly.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9667314,
            "companyId": 36964,
            "name": "Analista de Logística Sênior | Araçariguama",
            "description": "Será responsável pelo acompanhamento operacional com as transportadoras, planejar e manter as informações atualizadas em relação a produtividade da frota e atingimento de metas de faturamento,&nbsp;junto a demanda de cargas e alocação da oferta de demanda dos caminhões.Responsabilidades e atribuiçõesRealizar o planejamento junto as transportadoras no dia a dia;Ser responsável pela saída de produtos acabados;Realizar a cobrança de fornecedores;Negociar fretes;Captar parceiros (transportadoras e a agregados);Fazer a alocação de cargas para os veículos disponíveis;Consolidar informações para análise das metas;Garantir o atingimento de metas de faturamento;Manter o relacionamento direto com cliente interno;Trazer soluções e provocações para a melhorias de processos;Gerenciar contratos de fornecedores;Controlar e gerenciar os indicadores da operação;Prezar pelo atendimento com excelência ao cliente;Prestar rígida observância às normas e procedimentos de governança, segurança, sustentabilidade, saúde e meio ambiente da empresa, conforme compromisso com a Política de Gestão Integrada, e de acordo com o Código de Conduta da empresa, bem como seus Valores e Princípios.Requisitos e qualificaçõesCompetências Técnicas:Ensino Superior completo em Logística; Administração; Engenharias /ou áreas correlatas;Experiência na função (negociação de frete, atendimento ao cliente, excelência operacional e afins);Diferencial - Pós Graduação;Pacote Office intermediário/avançado;Diferencial - Conhecimento em Power BI;Disponibilidade para viagens eventuais;Residir de fácil acesso à região de Araçariguama/SP.Perfil Desejado:&nbsp;Segurança em Primeiro Lugar;Conectados(as) pelo cliente;Diversidade e Inclusão;Autorresponsabilidade;Mentalidade Empreendedora;Resultados Importam.Informações adicionaisAssistência Médica;Assistência Odontológica;Vale Refeição;Vale Alimentação;Seguro de Vida em Grupo;Vale Transporte, Fretado e/ou Vale Combustível (conforme sua opção);Licença maternidade e paternidade estendida;TotalPass;Programa +Cuidado: assistência profissional e confidencial para problemas pessoais – sem custo;Auxílio Farmácia;PPR.Se conectou a essa oportunidade?Então, vem com a gente!",
            "careerPageId": 77560,
            "careerPageName": "G2L Logística",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/36964/career/77560/images/2022-06-28_11-24_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-08-21T12:09:02.800Z",
            "applicationDeadline": "2026-04-09T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Araçariguama",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://vemprag2l.gupy.io/job/eyJqb2JJZCI6OTY2NzMxNCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://vemprag2l.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9725226,
            "companyId": 33235,
            "name": "BANCO DE CURRICULOS: ANALISTA RELACIONAMENTO CLIENTE",
            "description": "Olá,&nbsp;Nós acreditamos no poder de transformação de vidas pormeio da educação de qualidade e excelência!&nbsp;Aqui, nós buscamos conectardiferentes pessoas para que possam construir um mundo melhor a partir daeducação, com muito trabalho, respeito e dedicação, proporcionando a melhorexperiência e apoiando a jornada do conhecimento de mais de 390 mil alunos.&nbsp;&nbsp;Somos&nbsp;um dos maiores e mais representativos grupos de educação do país, tendo instituições de ensinoacademicamente relevantes e marcas reconhecidas em suas respectivas regiões,das suas escolas de ensino básico às instituições de ensino superior.&nbsp;&nbsp;Docentes e colaboradores de diversas áreas trabalham emsintonia para garantir essa construção diária. E estamos sempre em busca de novaspessoas para colaborar com esse objetivo, sejam profissionais que procuram poruma primeira oportunidade no mercado de trabalho, até os mais experientes.&nbsp;Você se identifica e acredita nesse propósito e quertrabalhar em uma de nossas marcas?&nbsp;Venha fazer parte donosso time!&nbsp;Estamos de braços abertos pararecebê-lo(a).&nbsp;Para se candidatar a uma de nossas vagas, é importantemanter todos os seus dados atualizados e completos. Fique à vontade para secadastrar em todas as vagas disponíveis do seu interesse, apenas recomendamosque você finalize um processo antes de iniciar um novo.&nbsp;Responsabilidades e atribuiçõesMISSÃO DO CARGO:Manter relacionamento com os clientes, credenciamentos e volume de vendas, atuando sob supervisão, visando atender as suas necessidades, prestando esclarecimentos e solucionando problemas, ou providenciando ações para solução de problemas, desenvolvendo relacionamento de forma ética, criativa, monitorando e orientando os clientes e/ou canais sobre a utilização do produto pelos clientes ou usuários, bem como realizar a prospecção de novos clientes ao produto ou apresentar e oferecer novos produtos para venda, efetuando coleta, tabulações, e análises técnicas parciais e preliminares de dados relacionados a área de atuação.PRINCIPAIS ATRIBUIÇÕES / RESPONSABILIDADES:Atender candidatos;Organizar materiais para atendimento;Preencher relatórios de resultados no Excel;Digitar fichas captadas;Realizar ativo de conversão;Atualizar carteira;Captar alunos através de ações internas e externas em todos os canais comerciais (empresas, escolas, door, ONGs, feiras, eventos, guerrilha, vestibular da concorrência, concursos, eventos corporativos, etc.);Realização de ações externas em empresa, escolas, comércios, ONGS, igreja e em locais com sinergia com nossos serviços;Organizar carteira de empresas conveniadas;Consultoria educacional, informações sobre ofertas de cursos, duração, mercado de trabalho e outros.Captação de leads e/ou direcionamento para os sites de inscrições;Follow-up da carteira de clientes, promessas de matriculas e carteiras comerciais (empresa e escola)Ativo para conversão de novos alunos;Atendimento presencial e via digital de candidatos;Dúvidas sobre cursos, prazo de pagamentos, negociações e outros;Tour acadêmico dentro dos campi;Realização e participação de feiras, eventos e palestras;&nbsp;Gestão de carteiras (coparticipação);Desenvolver outras atividades correlatas em seu campo de atuação.Requisitos e qualificaçõesEscolaridade: Ensino superior completo ou cursando: Administração, Marketing, Gestão comercial, Comunicação social, Publicidade e propaganda, Relações Públicas, Processos gerenciais e cursos da áreas de negócios;Informática: Pacote Office Básico;Requisitos: Conhecimento e Técnicas de Negociação;Possuir CNH B Ativa;Veiculo Próprio.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Informações adicionaisHorário de trabalho: Segunda a Sexta das 9h ás 19h - 1h 12 de almoço.Benefícios:&nbsp;Assistência Médica, Assistência Odontológica, Vale Refeição, Ajuda de Custo com Transporte, Convênio Farmácia, Total Pass, Bolsas de Estudos, seguro de vida e Total Pass.",
            "careerPageId": 78836,
            "careerPageName": "Confidencial",
            "careerPageLogo": "https://career-page-prod.gupy.io/default-creation-images/confidencial_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-20T20:15:18.492Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "João Pessoa",
            "state": "Paraíba",
            "country": "Brasil",
            "jobUrl": "https://atracaodetalentosconfidencial.gupy.io/job/eyJqb2JJZCI6OTcyNTIyNiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://atracaodetalentosconfidencial.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9725285,
            "companyId": 49900,
            "name": "ANALISTA COMERCIAL",
            "description": "A Central IT tem como propósito, “Inspirar&nbsp;Pessoas e Impactar Negócios”, e isso diz muito sobre quem somos.O que você acha de trabalhar em uma empresa focada em promover a inovação, atuando com um time dinâmico e dedicado, que valoriza o seu conhecimento para te ajudar a crescer?Se isso é o que faz os seus olhos brilharem, chegou o seu momento de se tornar um #citlover!Como descrever o nosso #citlover?Para ser um colaborador aqui na Central, você deve ser aquela pessoa sagaz, com perfil de Transformação Digital, com sede de conhecimento e inovação, que busca sempre dar o seu melhor para entregar resultados e compartilhar experiências.Responsabilidades e atribuiçõesResponsabilidadesAnalisar as oportunidades de novas licitações avaliando os insumos de cada edital e comparando com o cenário da empresa para verificar se é oportuno a participação;Participar de licitações, por meio de portais especializados ou presencialmente, para conquistar novos contratos de prestação de serviços para a empresa;Prospecção de clientes tanto PJ quanto PF;Visitas e prospecção aos contratos da CentralIT;Requisitos e qualificaçõesRequisitos e QualificaçõesHard Skills:Excel avançadoCRMAnálise de dadosConhecimento em TISoft skills:Comunicação eficazTrabalho em equipeProatividade para resolução de problemasCapacidade analíticaInformações adicionaisE quais são os benefícios?🏥 Qualidade de vida, com planos de saúde e odontológico;👩‍⚕️ Programas de saúde e bem-estar;🍛 Boa alimentação, com vale alimentação ou refeição;🚍 Mobilidade para ir e vir, com vale transporte ou auxílio combustível;💲 Reconhecimento com comissão de 10%;📚 E o incentivo à inovação, com o nosso programa de treinamentos;Na Central IT todas as pessoas são bem-vindas! Sem distinção de gênero, orientação sexual, etnia, cultura, religião, deficiência e etc. 💙E aí, o que acha do desafio? Está pronto para fazer parte da #empresadoabraco?Então chega mais, que estamos de braços abertos para te receber. Venha ser um #citlover!",
            "careerPageId": 117562,
            "careerPageName": "Central IT",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/49900/career/117562/images/2024-05-07_21-13_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-08-20T17:42:08.908Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "",
            "state": "Distrito Federal",
            "country": "Brasil",
            "jobUrl": "https://centralit.gupy.io/job/eyJqb2JJZCI6OTcyNTI4NSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://centralit.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 423
    }
}