{
    "data": [
        {
            "id": 9719706,
            "companyId": 26272,
            "name": "Banco de Talentos - Estágiario(a) Desenvolvedor Java",
            "description": "🚀 #VemPraWise: Sua jornada de tecnologia começa aqui!&nbsp;Procurando uma oportunidade para crescer em um ambiente que respira inovação e valoriza sua criatividade?Na Wise, a gente respira tecnologia e tá sempre buscando o próximo nível. Somos certificados CMMI nível 3, o que significa que levamos o desenvolvimento de software a sério, com as melhores práticas do mercado e reconhecimento internacional.Esse é um banco de talentos para Pessoas que querem iniciar sua carreira como Estagiário(a) Desenvolvedor(a) Java para embarcar com a gente em projetos desafiadores e com grande impacto.&nbsp;&nbsp;Por que a Wise é o lugar certo pra você?Sua voz tem poder: Valorizamos suas ideias e sua capacidade de trazer soluções inovadoras.Um time que joga junto: Companheirismo e bom humor são ingredientes essenciais no nosso dia a dia.Desenvolvimento constante: Acreditamos no seu potencial e investimos em treinamentos e certificações para você ir ainda mais longe.Se você curte autonomia, colaboração e um ambiente onde suas ideias são valorizadas, seu lugar é com a gente! 😉#vemprawise #sejawise #bewise #desenvolvedorjavaResponsabilidades e atribuiçõesSua missão, se você topar o desafio:Desenvolver e dar manutenção em aplicações back-end utilizando Java e/ou Spring Boot e/ouJSP e/ou Struts .Participar ativamente de todo o ciclo de vida do desenvolvimento de software, do design à implementação e testes.Colaborar com a equipe para encontrar as melhores soluções técnicas e arquitetônicas.Aprender, crescer e compartilhar conhecimento, porque aqui todo mundo ensina e aprende junto.Requisitos e qualificaçõesO que esperamos de você:Conhecimento em Java.Familiaridade com conceitos de Programação Orientada a Objetos (POO).Conhecimento em Git para controle de versão.Noções de bancos de dados relacionais (como MySQL ou PostgreSQL) e não relacionais.Disposição para trabalhar com metodologias ágeis como Scrum ou Kanban.Vontade de aprender e se desenvolver constantemente, enfrentando novos desafios sem medo!&nbsp;Requisitos desejáveis:Experiência profissional com Spring Boot e/ou JSP e/ou Struts.﻿Noções de programação para&nbsp;Java Android&nbsp;e familiaridade com&nbsp;Android StudioConhecimento e/ou experiência em Angular.js.Familiaridade com HTML, CSS e JavaScript para a construção de interfaces.Entendimento do padrão MVC (Model-View-Controller).﻿Informações adicionaisInformações adicionais:Contratação: EstágioValor Bolsa Auxílio: A combinarCarga Horária: 4 a 6 horas diárias, de segunda a sextaTrabalho Presencial ou Híbrido em Curitiba/PR ou Remoto (a definir). Se você é proativo(a), busca desenvolvimento constante e quer integrar um time que está sempre em busca das melhores práticas de desenvolvimento de software, queremos te conhecer!Pronto(a) pra ser #Wise?",
            "careerPageId": 57035,
            "careerPageName": "Wise Group",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/26272/career/57035/images/2022-05-19_16-58_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-19T20:35:15.140Z",
            "applicationDeadline": "2035-12-31T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Curitiba",
            "state": "Paraná",
            "country": "Brasil",
            "jobUrl": "https://wises.gupy.io/job/eyJqb2JJZCI6OTcxOTcwNiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://wises.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9560364,
            "companyId": 17527,
            "name": "Desenvolvedor Front-End Web Angular Sr. | AWS | Cliente Bancário | Home-Office",
            "description": "UTILIZE A SUA PAIXÃO POR TECNOLOGIA PARA CAUSAR IMPACTO POSITIVO E #VemSerLuminiITAqui na Lumini IT a inovação e a resiliência fazem parte da nossa rotina.Somos uma empresa de soluções de TI que preza pela qualidade e agilidade na entrega de seus serviços.O nosso grande segredo para estar sempre um passo à frente do mercado é a audácia e a transformação que cada LUMINER promove todos os dias.Nossa integridade nos impulsiona e, o melhor, todo mundo colabora com todo mundo, não importa quem deu a ideia, somos uma empresa de estratégia horizontal, todas as pessoas estão dispostas a ajudar e se envolvem legitimamente para fazer dar certo e entregar resultados.Curtiu? Inscreva-se na vaga!Responsabilidades e atribuiçõesBuscamos um(a) Desenvolvedor(a) Front-End Angular Sênior apaixonado(a) por tecnologia, com experiência sólida em Angular e foco em performance, acessibilidade e boas práticas. Se você gosta de construir interfaces intuitivas, escaláveis e que entregam valor real ao usuário final, essa vaga é para você!Desenvolver e manter aplicações web modernas e responsivas utilizando Angular (versão 12+);Colaborar com times de back-end, UX/UI e produto para entregar soluções completas e eficientes;Traduzir requisitos técnicos e de negócio em interfaces intuitivas e performáticas;Garantir a qualidade do código com boas práticas, testes unitários e revisões de pull requests;Participar ativamente das cerimônias ágeis: dailies, plannings, reviews e retrospectivas;Contribuir com arquitetura de front-end e componentização escalável;Apoiar o time com mentoria técnica e boas práticas de desenvolvimento;Trabalhar em ambientes de nuvem (AWS), incluindo integração e deploy de aplicações;Aplicar práticas de segurança no front-end, como prevenção a XSS e CSRF;Instrumentar a&nbsp;aplicação com ferramentas de monitoramento (ex: Sentry, LogRocket).Requisitos e qualificaçõesRequisitos Obrigatórios5+&nbsp;anos de experiência com desenvolvimento front-end;Sólido domínio de Angular (idealmente versão 12 ou superior);Experiência com TypeScript, HTML5, CSS3 e design responsivo;Consumo de APIs RESTful;Controle de versão com Git;Experiência com metodologias ágeis (Scrum/Kanban);Boa comunicação, autonomia e organização.Diferenciais ValorizadosAtuação anterior em empresas do setor financeiro ou bancário;Conhecimento em testes automatizados (unitários e end-to-end);Familiaridade com CI/CD, práticas deploy em nuvem (preferencialmente AWS);Noções de UX/UI focadas em acessibilidade e usabilidade;Experiência com Angular Universal (SSR) e/ou desenvolvimento de PWAs;Participação&nbsp;em comunidades técnicas ou contribuição com projetos open source.Informações adicionaisModalidade de Trabalho: 100% Home Office;Contratação: PJ;Horário de atuação da equipe:&nbsp;comercial;Importante: Nós valorizamos a diversidade e inclusão, consideramos todos os candidatos para as nossas vagas, independente de cor, raça, religião, gênero e identidade de gênero, nacionalidade, deficiência, orientação sexual, ascendência, idade, etc.",
            "careerPageId": 40930,
            "careerPageName": "Lumini IT Solutions",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/17527/career/40930/images/2021-12-27_20-10_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2025-07-22T20:03:16.519Z",
            "applicationDeadline": "2026-09-20T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://luminiitsolutions.gupy.io/job/eyJqb2JJZCI6OTU2MDM2NCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://luminiitsolutions.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9559956,
            "companyId": 17527,
            "name": "Desenvolvedor .NET Sr. | AWS | Cliente Bancário | Home-Office",
            "description": "UTILIZE A SUA PAIXÃO POR TECNOLOGIA PARA CAUSAR IMPACTO POSITIVO E #VemSerLuminiITAqui na Lumini IT a inovação e a resiliência fazem parte da nossa rotina.Somos uma empresa de soluções de TI que preza pela qualidade e agilidade na entrega de seus serviços.O nosso grande segredo para estar sempre um passo à frente do mercado é a audácia e a transformação que cada LUMINER promove todos os dias.Nossa integridade nos impulsiona e, o melhor, todo mundo colabora com todo mundo, não importa quem deu a ideia, somos uma empresa de estratégia horizontal, todas as pessoas estão dispostas a ajudar e se envolvem legitimamente para fazer dar certo e entregar resultados.Curtiu? Inscreva-se na vaga!Responsabilidades e atribuiçõesEstamos em busca de um(a) Desenvolvedor(a) .NET III para atuar em um projeto desafiador no setor bancário. Procuramos profissionais experientes, com perfil analítico, domínio técnico em .NET e familiaridade com ambientes de nuvem e metodologias ágeis.Analisar, desenvolver e manter aplicações utilizando C# e a plataforma .NET;Construir APIs e aplicações web com atenção à qualidade, performance e segurança;Escrever código limpo, testável e de fácil manutenção;Criar e executar testes unitários para garantir a qualidade do software;Realizar revisão de código e refatoração quando necessário;Atuar em ambientes baseados em nuvem (AWS), contribuindo com integração e deployment contínuo;Colaborar com equipes multidisciplinares em ambiente ágil.Requisitos e qualificaçõesRequisitos ObrigatóriosMínimo de 5 anos de experiência como desenvolvedor .NET;Conhecimento avançado em AWS;Experiência com desenvolvimento de APIs .NET e aplicações web com Angular;Proficiência em C# e domínio da plataforma .NET;Familiaridade com práticas de desenvolvimento ágil (Scrum, Kanban);Boa comunicação, organização e habilidade de trabalho em equipe.﻿Diferenciais DesejáveisVivência anterior no setor bancário ou financeiro;Experiência com esteira CI/CD e automação de processos de build e deploy;Conhecimentos em&nbsp;segurança de aplicações e performance em larga escala.Informações adicionaisModalidade de Trabalho: 100% Home Office;Contratação: PJ;Horário de atuação da equipe:&nbsp;comercial.Importante: Nós valorizamos a diversidade e inclusão, consideramos todos os candidatos para as nossas vagas, independente de cor, raça, religião, gênero e identidade de gênero, nacionalidade, deficiência, orientação sexual, ascendência, idade, etc.",
            "careerPageId": 40930,
            "careerPageName": "Lumini IT Solutions",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/17527/career/40930/images/2021-12-27_20-10_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2025-07-22T19:57:14.484Z",
            "applicationDeadline": "2026-09-20T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://luminiitsolutions.gupy.io/job/eyJqb2JJZCI6OTU1OTk1Niwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://luminiitsolutions.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9538769,
            "companyId": 213,
            "name": "Desenvolvedor(a) em Inteligência Artificial",
            "description": "Buscamos um(a) Desenvolvedor(a) em Inteligência Artificial para integrar o time e atuar no desenvolvimento de soluções inovadoras em IA, com foco em otimização, escalabilidade e segurança.Será responsável por todo o ciclo de vida de projetos de IA, desde o discovery com stakeholders até a entrega final, garantindo eficiência, qualidade e aderência à LGPD.Responsabilidades e atribuiçõesResponsabilidades:Conduzir discovery com stakeholders e entender objetivos/dados;Desenhar arquitetura (dados, LLMs e infraestrutura) com foco em custo, desempenho e LGPD;Implementar pipelines (ETL/ELT) e soluções de RAG (BM25 + embeddings + reranking);Desenvolver e integrar APIs (FastAPI) e interfaces (Streamlit);Versionar, testar código e orquestrar deploy (Docker/CI/CD);Configurar observabilidade, métricas e alarmes;Avaliar modelos, prompts e propor melhorias contínuas;Documentar decisões, criar playbooks e capacitar equipes.Requisitos e qualificaçõesRequisitos:Domínio em Python e frameworks de IA (TensorFlow, PyTorch, scikit-learn, NumPy, Pandas, Matplotlib);Experiência com IA Generativa (LangChain, LangGraph, LlamaIndex);Conhecimento em aprendizado supervisionado, não supervisionado e deep learning;Experiência em nuvem (AWS, Azure ou GCP) e práticas DevOps;Vivência com Machine Learning, visão computacional e IA generativa;Graduação em ADS, Engenharia de Software, Ciência da Computação ou áreas correlatas;Soft skills: criatividade, inovação, gestão do tempo, comunicação clara e trabalho em equipe.Informações adicionaisFlexibilidade de horário;Wellub;Day Off no aniversário;Vale cultura - Carteira de desconto em shows, cinemas, teatro entre outros;Ascensão profissional;Programas de treinamento e mentoria;Visibilidade de mercado;Parceria com instituições de ensino;Auxílio educacional;Respeito e transparência entre líderes e liderados;",
            "careerPageId": 48,
            "careerPageName": "Gomes de Matos Consultoria",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/213/career/48/images/2021-05-27_14-25_logo.jpg",
            "type": "vacancy_legal_entity",
            "publishedDate": "2025-07-18T12:34:12.989Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Fortaleza",
            "state": "Ceará",
            "country": "Brasil",
            "jobUrl": "https://gomesdematos.gupy.io/job/eyJqb2JJZCI6OTUzODc2OSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "on-site",
            "careerPageUrl": "https://gomesdematos.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9450893,
            "companyId": 36239,
            "name": "VAGA EXCLUSIVA - DESENVOLVEDOR JAVA - PESSOA COM DEFICIÊNCIA",
            "description": "A AUTBANK possui mais de 35 anos de experiência, somos pioneiros e referência em soluções para o mercado financeiro. Estamos localizados na zona sul de SP.&nbsp;Estamos buscando profissionais que tenham experiência, e que gostem de desenvolver utilizando Java.&nbsp;Faz parte de nossa cultura compartilhar conhecimentos e aprendizados, acreditamos que tanto o colaborador mais novo quanto o mais experiente tem sempre algo a ensinar!Temos uma equipe engajada e voltada para soluções que auxiliem o sucesso de nossos clientes.Responsabilidades e atribuiçõesAtuar com desenvolvimento em Java será a principal atividade. Terá oportunidade de trabalhar com as tecnologias Java, JSP, Ajax, Tomcat, Eclipse e SQL Server.Desenvolvimento de novas funcionalidades para sistemas em Java web.Manutenção de sistemas em Java web.Desenvolvimento de microsserviços.Elaboração de relatórios.Elaboração de telas utilizando HTML, JSP e CSS.Requisitos e qualificaçõesPessoas cursando o último semestre ou formadas, nos cursos de Ciência da Computação, Engenharia da Computação, Análise e Desenvolvimento de Sistemas ou Sistemas de Informação.Disponibilidade para trabalhar período integral (40 horas semanais).Facilidade com lógica e algoritmo.Conhecimento / Atuação em linguagem Java.Ter conhecimento e/ou trabalhado com a linguagem SQL.Informações adicionaisDisponibilidade para atuar presencial (atualmente atuação híbrida, porém podendo ser alterado para 100% presencial)A empresa fica localizada na Zona Sul de São Paulo/SP.Necessário possuir estrutura (equipamento próprio, internet boa) para atuação nos dias de home office.CRITÉRIO DE PARTICIPAÇÃO: Apenas pessoas que se enquadram no público-alvo da vaga podem participar do processo seletivo.&nbsp;Oferecemos os seguintes benefícios:Vale RefeiçãoAssistência MédicaAssistência OdontológicaVale TransporteAuxílio crecheSeguro de vidaParceria SESCParceria TotalPassAcredita que o seu perfil está aderente à posição? Inscreva-se, e venha fazer parte do nosso time!",
            "careerPageId": 77395,
            "careerPageName": "Autbank",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/36239/career/77395/images/2022-06-24_18-28_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-07-01T19:51:28.164Z",
            "applicationDeadline": "2026-07-31T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://autbank.gupy.io/job/eyJqb2JJZCI6OTQ1MDg5Mywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://autbank.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9287422,
            "companyId": 54718,
            "name": "Desenvolvedor Senior (Backend) - Rio de Janeiro",
            "description": "Lugar de gente inovadora que faz acontecer!Somos uma empresa reconhecida pela ousadia de propor serviços e soluções diferenciadas, construídas de maneira única e com excelência. Perseguimos sempre o “algo mais” fugindo do normal e esperado, para que possamos surpreender os clientes com ideias inovadoras.Responsabilidades e atribuiçõesResponsabilidades:Projetar, desenvolver e manter aplicações serverless em Python utilizando AWS Lambda e outros serviços gerenciados;Desenvolver APIs REST de alta performance via API Gateway, integrando com sistemas internos e externos;Realizar integração com bancos de dados MSSQL Server e Oracle, manipulando dados estruturados com eficiência;Trabalhar com Secret Manager para gerenciamento seguro de credenciais, e com S3 para armazenar e processar arquivos;Implementar lógica de negócio robusta, com foco em resiliência, escalabilidade e segurança;Garantir tratamento de erros estruturado, monitoramento via CloudWatch, e logging estruturado para observabilidade;Participar de decisões técnicas e arquiteturais, propondo soluções e padrões de desenvolvimento;Atuar em colaboração com times de arquitetura, segurança, DevOps e produtos;Conduzir revisões de código, mentoring técnico e disseminação de boas práticas no time.Requisitos e qualificaçõesRequisitos:Experiência sólida com Python em projetos de backend.Domínio em AWS Lambda, API Gateway, S3, CloudWatch, Secrets Manager.Experiência prática com bancos de dados relacionais (MSSQL e Oracle), incluindo modelagem, consultas complexas e tuning.Experiência com pelo menos um framework Python (ex: FastAPI, Flask, Django).Forte entendimento de RESTful APIs, controle de versão com Git e padrões de codificação limpos.Vivência com manipulação de arquivos, consumo de APIs externas, parsing de dados (JSON, XML).Capacidade de atuar de forma autônoma, propondo e implementando soluções de ponta a ponta.Conhecimentos em mensageria (SNS, SQS), EventBridge e arquitetura orientada a eventos.Experiência com autenticação/autorização (OAuth2, JWT, Cognito).Conhecimentos básicos de infraestrutura como código (Terraform, AWS SAM, Serverless Framework).Informações adicionais🏥 Assistência Médica e Odontológica Bradesco🛡️ Seguro de Vida Icatu🍴 Vale Refeição ou Alimentação🚌 Vale Transporte📚 Incentivo Educacional - custeando 50% das despesas de Graduação, Inglês ou Pós-Graduação, limitado a R$ 300,00 por mês🌐 Inglês in Company🏋️ TotalPass💊 Golden Farma🏆 Prêmio de Estabilidade por Tempo de Casa🚀 Avaliação de Desempenho (Oportunidades de Crescimento e Desenvolvimento)🤝 Plano de Mentoria💳 Empréstimo Consignado📜 Custeio do Registro Profissional (CRC, OAB ou CRP)📱 Aparelho Corporativo🎉 Birthday Off🎁 Vale Presente do Birthday Off",
            "careerPageId": 194447,
            "careerPageName": "Confidencial",
            "careerPageLogo": "https://career-page-prod.gupy.io/default-creation-images/confidencial_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-06-30T21:10:48.222Z",
            "applicationDeadline": "2026-04-17T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Rio de Janeiro",
            "state": "Rio de Janeiro",
            "country": "Brasil",
            "jobUrl": "https://privatejobs.gupy.io/job/eyJqb2JJZCI6OTI4NzQyMiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://privatejobs.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9186815,
            "companyId": 50527,
            "name": "Banco de Talentos | Desenvolvedor Backend Sênior (Java/Node)",
            "description": "A FCamara é uma consultoria de tecnologia que atua em diversos segmentos do mercado, como varejo, saúde, financeiro, mobilidade, entre outros. Trabalhamos lado a lado com grandes empresas, desenvolvendo soluções inovadoras e impulsionando a transformação digital.Estamos em constante expansão e, por isso, mantemos nosso Banco de Talentos sempre aberto para profissionais de destaque!No momento, estamos recebendo currículos para oportunidades de Desenvolvedor(a) Backend Sênior, com foco em Java e/ou Node.js. Temos diversas vagas disponíveis neste perfil, e ao se cadastrar, seu currículo será analisado com prioridade para estas posições.Responsabilidades e atribuiçõesAtuar de forma colaborativa com times multidisciplinares, promovendo uma comunicação clara, empática e eficiente entre áreas de produto, design e engenharia.Liderar tecnicamente projetos de backend, apoiando decisões estratégicas e compartilhando conhecimento com desenvolvedores menos experientes.Ser protagonista na identificação e resolução de problemas, com postura proativa e foco em soluções sustentáveis.Demonstrar responsabilidade e autonomia na gestão de demandas, prazos e prioridades, contribuindo para o bom andamento do time.Participar ativamente de cerimônias ágeis (Daily, Planning, Review, Retrospective), com mindset voltado à melhoria contínua e ao trabalho em equipe.Manter uma postura aberta a feedbacks e à evolução constante, incentivando a cultura de aprendizado dentro do time.Requisitos e qualificaçõesSólida experiência em desenvolvimento backend com Node.js (Express ou Nest JS) e Java (8+).Familiaridade com boas práticas de engenharia de software, princípios SOLID, design patterns e arquitetura limpa.Proficiência em desenvolvimento e consumo de APIs RESTfulExperiência com bancos de dados relacionais (Oracle, MySQL) e não relacionais (MongoDB, Redis).Familiaridade com ferramentas de mensageria e filas, como RabbitMQ, Kafka ou AWS SQS.Conhecimento em práticas de DevOps e experiência com CI/CD, containers (Docker), e orquestração (Kubernetes é um diferencial).Experiência com testes automatizados (unitários, integração, contrato) e ferramentas como JUnit, Jest, Mocha, etc.Conhecimento e uso de ferramentas de APM (Application Performance Monitoring) como New Relic, Datadog, Dynatrace, Elastic APM ou similares para análise de performance e rastreamento de aplicações.",
            "careerPageId": 117226,
            "careerPageName": "VENHA SER #SANGUELARANJA 🧡🚀",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/50527/career/117226/images/2022-12-05_17-18_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-19T14:00:19.288Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://fcamara.gupy.io/job/eyJqb2JJZCI6OTE4NjgxNSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://fcamara.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9186882,
            "companyId": 50527,
            "name": "Banco de Talentos | Desenvolvedor Fullstack Sênior (Node/React)",
            "description": "A FCamara é uma consultoria de tecnologia que atua em diversos segmentos do mercado, como varejo, saúde, financeiro, mobilidade, entre outros. Trabalhamos lado a lado com grandes empresas, desenvolvendo soluções inovadoras e impulsionando a transformação digital.Estamos em constante expansão e, por isso, mantemos nosso Banco de Talentos sempre aberto para profissionais de destaque!No momento, estamos recebendo currículos para oportunidades de Desenvolvedor(a) Fullstack Sênior, com foco em Node JS e React JS Temos diversas vagas disponíveis neste perfil, e ao se cadastrar, seu currículo será analisado com prioridade para estas posições.Responsabilidades e atribuiçõesAtuar de forma colaborativa com times multidisciplinares, promovendo uma comunicação clara, empática e eficiente entre áreas de produto, design e engenharia.Liderar tecnicamente projetos de backend, apoiando decisões estratégicas e compartilhando conhecimento com desenvolvedores menos experientes.Ser protagonista na identificação e resolução de problemas, com postura proativa e foco em soluções sustentáveis.Demonstrar responsabilidade e autonomia na gestão de demandas, prazos e prioridades, contribuindo para o bom andamento do time.Participar ativamente de cerimônias ágeis (Daily, Planning, Review, Retrospective), com mindset voltado à melhoria contínua e ao trabalho em equipe.Manter uma postura aberta a feedbacks e à evolução constante, incentivando a cultura de aprendizado dentro do time.Requisitos e qualificaçõesExperiência sólida com Node.js no desenvolvimento de aplicações backend, utilizando frameworks como Express.js, NestJS ou equivalentes.Forte domínio em React.js para desenvolvimento frontend, com conhecimento em hooks, contexto, roteamento e componentização escalável.Conhecimento em TypeScript no backend e frontend.Experiência na construção e consumo de APIs RESTfulVivência com testes automatizados, utilizando ferramentas como Jest, React Testing Library, Mocha, entre outras.Experiência com bancos de dados relacionais (PostgreSQL, MySQL) e não relacionais (MongoDB, Redis).Conhecimento em controle de estado no frontend (ex: Redux, Zustand, Recoil) e gerenciamento de side effects.Experiência com CI/CD, containers com Docker e boas práticas de versionamento (Git).Conhecimento de ambientes cloud (preferencialmente AWS) e integração com serviços como S3, Lambda, API Gateway, etc.Familiaridade com ferramentas de APM (Application Performance Monitoring) como Datadog, New Relic, Elastic APM, Sentry ou similares.Noções de UX/UI e boas práticas de acessibilidade (a11y) são diferenciais.",
            "careerPageId": 117226,
            "careerPageName": "VENHA SER #SANGUELARANJA 🧡🚀",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/50527/career/117226/images/2022-12-05_17-18_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-19T13:56:56.407Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://fcamara.gupy.io/job/eyJqb2JJZCI6OTE4Njg4Miwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://fcamara.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9186940,
            "companyId": 50527,
            "name": "Banco de Talentos | Desenvolvedor Backend Sênior (PHP/Node)",
            "description": "A FCamara é uma consultoria de tecnologia que atua em diversos segmentos do mercado, como varejo, saúde, financeiro, mobilidade, entre outros. Trabalhamos lado a lado com grandes empresas, desenvolvendo soluções inovadoras e impulsionando a transformação digital.Estamos em constante expansão e, por isso, mantemos nosso Banco de Talentos sempre aberto para profissionais de destaque!No momento, estamos recebendo currículos para oportunidades de Desenvolvedor(a) Backend Sênior, com foco em PHP e Node. Temos diversas vagas disponíveis neste perfil, e ao se cadastrar, seu currículo será analisado com prioridade para estas posições.Responsabilidades e atribuiçõesAtuar de forma colaborativa com times multidisciplinares, promovendo uma comunicação clara, empática e eficiente entre áreas de produto, design e engenharia.Liderar tecnicamente projetos de backend, apoiando decisões estratégicas e compartilhando conhecimento com desenvolvedores menos experientes.Ser protagonista na identificação e resolução de problemas, com postura proativa e foco em soluções sustentáveis.Demonstrar responsabilidade e autonomia na gestão de demandas, prazos e prioridades, contribuindo para o bom andamento do time.Participar ativamente de cerimônias ágeis (Daily, Planning, Review, Retrospective), com mindset voltado à melhoria contínua e ao trabalho em equipe.Manter uma postura aberta a feedbacks e à evolução constante, incentivando a cultura de aprendizado dentro do time.Requisitos e qualificaçõesSólida experiência em desenvolvimento backend com Node.js (Express ou Nest JS) e PHP (Preferencial estruturado ou Laravel).Familiaridade com boas práticas de engenharia de software, princípios SOLID, design patterns e arquitetura limpa.Proficiência em desenvolvimento e consumo de APIs RESTfulExperiência com bancos de dados relacionais (PostgreSQL, MySQL) e não relacionais (MongoDB, Redis).Familiaridade com ferramentas de mensageria e filas, como RabbitMQ, Kafka ou AWS SQS.Conhecimento em práticas de DevOps e experiência com CI/CD, containers (Docker), e orquestração (Kubernetes é um diferencial).Experiência com testes automatizados (unitários, integração, contrato) e ferramentas como JUnit, Jest, Mocha, etc.Conhecimento e uso de ferramentas de APM (Application Performance Monitoring) como New Relic, Datadog, Dynatrace, Elastic APM ou similares para análise de performance e rastreamento de aplicações.",
            "careerPageId": 117226,
            "careerPageName": "VENHA SER #SANGUELARANJA 🧡🚀",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/50527/career/117226/images/2022-12-05_17-18_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-19T13:54:17.169Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://fcamara.gupy.io/job/eyJqb2JJZCI6OTE4Njk0MCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://fcamara.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9141271,
            "companyId": 24820,
            "name": "Banco de Talentos | Desenvolvedor Fullstack PHP Angular Pleno",
            "description": "Não encontrou uma vaga para Desenvolvedor Fullstack PHP Angular Pleno?Não se preocupe! Cadastre seu currículo em nosso Banco de Talentos, pois surgindo oportunidades, serão priorizados os candidatos inscritos no banco de talentos.Nossas vagas para Desenvolvedores Fullstack PHP Angular Pleno tem como objetivo desenvolver uma nova plataforma LMS (Learning Management System), utilizando framework laravel e outras tecnologias open source.Procuramos parceiros que estejam sempre conectados com as novas tendências e consigam transpor o melhor de nossa cultura para os produtos produzidos e consequentemente para nosso cliente final.Somos uma empresa que surgiu e ama Educação, criamos soluções inclusivas para o nosso principal público que são coordenadores, professores, alunos e colaboradores de instituições de ensino que utilizam o pacote Google Workspace como parte de sua transformação acadêmica.Prestação de serviço home-office.Nosso modelo de contratação é por Pessoa Jurídica.Responsabilidades e atribuiçõesResponsabilidades e atribuições:&nbsp;Auxiliar na arquitetura durante o desenvolvimento de novas funcionalidades.Desenvolver novas interfaces para nossos produtos.Realizar melhorias e correções de sistemas já existentes.Manter os sistemas funcionando com uma alta taxa de qualidade.Otimizar as aplicações para garantir uma boa usabilidade.Realizar manutenções em nossos bancos de dados.Auxiliar o restante da equipe durante a resolução de problemas.Escrever testes automatizados.Documentar todo o código desenvolvido.Manter os produtos atualizados e utilizando as últimas tendências do mercado.Requisitos e qualificaçõesRequisitos e qualificações:&nbsp;Conhecimento de GIT;Experiência com o framework Laravel;Angular 2+;HTML;CSS;Less;Experiência com o desenvolvimento utilizando PHP;Conhecimento das APIs do Google;Conhecimento das ferramentas Google Workspace;Conhecimento das ferramentas Google Cloud;Testes automatizados;Banco de dados (SQL e NoSQL);Experiência Github/Gitlab;Gitlab;Inglês técnico;Experiência em CI/CD;Experiência na manutenção de clusters Kubernetes;Facilidade para trabalhar em equipe;TDD; eDocker.Diferencial:Ter atuado no desenvolvimento de projetos com PHP (Laravel / PHP) e Angular (Angular 2+) por pelo menos 2 anos;Ter atuado no desenvolvimento de projetos envolvendo a construção do banco de dados;Ter bom conhecimento em bancos de dados relacionais;Ter boa lógica na realização de troubleshooting;Já ter participado da estrututação de um novo sistema ou novos módulos; eConhecimento em integrações com APIs.﻿﻿Restrição:&nbsp;não trabalhar para empresa concorrente.Informações adicionaisHabilidades comportamentais:Tenha iniciativa e busque soluções;Tenha capacidade de resolução de problemas;Tenha comprometimento;Tenha uma boa comunicação;Seja criativo;Tenha agilidade;Seja adaptável;Tenha autonomia;Tenha foco e atenção; eTenha mentalidade de crescimento.Equipamentos necessários:Possuir computador ou notebook, Intel Core i5 ou superior, compatível a 8GB de memória RAM (livres);Computador com Sistema Operacional Linux (preferencialmente), Mac ou Windows;Internet deverá ser fixa, com velocidade mínima de 30Mb;Uma mesa e uma cadeira padrão de escritório;Se você optar pelo uso do Notebook importante ter um suporte e um teclado para que ele fique na direção de seus olhos;Crie o seu espaço de trabalho, orientamos sempre escolher aquele espaço sem ruídos e barulhos;Webcam Full HD; eHeadset para vídeo conferência.",
            "careerPageId": 54823,
            "careerPageName": "Inicie",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/24820/career/54823/images/2024-01-04_14-13_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-12T18:53:30.013Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://inicie.gupy.io/job/eyJqb2JJZCI6OTE0MTI3MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://inicie.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 106
    }
}