{
    "data": [
        {
            "id": 9560364,
            "companyId": 17527,
            "name": "Desenvolvedor Front-End Web Angular Sr. | AWS | Cliente Bancário | Home-Office",
            "description": "UTILIZE A SUA PAIXÃO POR TECNOLOGIA PARA CAUSAR IMPACTO POSITIVO E #VemSerLuminiITAqui na Lumini IT a inovação e a resiliência fazem parte da nossa rotina.Somos uma empresa de soluções de TI que preza pela qualidade e agilidade na entrega de seus serviços.O nosso grande segredo para estar sempre um passo à frente do mercado é a audácia e a transformação que cada LUMINER promove todos os dias.Nossa integridade nos impulsiona e, o melhor, todo mundo colabora com todo mundo, não importa quem deu a ideia, somos uma empresa de estratégia horizontal, todas as pessoas estão dispostas a ajudar e se envolvem legitimamente para fazer dar certo e entregar resultados.Curtiu? Inscreva-se na vaga!Responsabilidades e atribuiçõesBuscamos um(a) Desenvolvedor(a) Front-End Angular Sênior apaixonado(a) por tecnologia, com experiência sólida em Angular e foco em performance, acessibilidade e boas práticas. Se você gosta de construir interfaces intuitivas, escaláveis e que entregam valor real ao usuário final, essa vaga é para você!Desenvolver e manter aplicações web modernas e responsivas utilizando Angular (versão 12+);Colaborar com times de back-end, UX/UI e produto para entregar soluções completas e eficientes;Traduzir requisitos técnicos e de negócio em interfaces intuitivas e performáticas;Garantir a qualidade do código com boas práticas, testes unitários e revisões de pull requests;Participar ativamente das cerimônias ágeis: dailies, plannings, reviews e retrospectivas;Contribuir com arquitetura de front-end e componentização escalável;Apoiar o time com mentoria técnica e boas práticas de desenvolvimento;Trabalhar em ambientes de nuvem (AWS), incluindo integração e deploy de aplicações;Aplicar práticas de segurança no front-end, como prevenção a XSS e CSRF;Instrumentar a&nbsp;aplicação com ferramentas de monitoramento (ex: Sentry, LogRocket).Requisitos e qualificaçõesRequisitos Obrigatórios5+&nbsp;anos de experiência com desenvolvimento front-end;Sólido domínio de Angular (idealmente versão 12 ou superior);Experiência com TypeScript, HTML5, CSS3 e design responsivo;Consumo de APIs RESTful;Controle de versão com Git;Experiência com metodologias ágeis (Scrum/Kanban);Boa comunicação, autonomia e organização.Diferenciais ValorizadosAtuação anterior em empresas do setor financeiro ou bancário;Conhecimento em testes automatizados (unitários e end-to-end);Familiaridade com CI/CD, práticas deploy em nuvem (preferencialmente AWS);Noções de UX/UI focadas em acessibilidade e usabilidade;Experiência com Angular Universal (SSR) e/ou desenvolvimento de PWAs;Participação&nbsp;em comunidades técnicas ou contribuição com projetos open source.Informações adicionaisModalidade de Trabalho: 100% Home Office;Contratação: PJ;Horário de atuação da equipe:&nbsp;comercial;Importante: Nós valorizamos a diversidade e inclusão, consideramos todos os candidatos para as nossas vagas, independente de cor, raça, religião, gênero e identidade de gênero, nacionalidade, deficiência, orientação sexual, ascendência, idade, etc.",
            "careerPageId": 40930,
            "careerPageName": "Lumini IT Solutions",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/17527/career/40930/images/2021-12-27_20-10_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2025-07-22T20:03:16.519Z",
            "applicationDeadline": "2026-09-20T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://luminiitsolutions.gupy.io/job/eyJqb2JJZCI6OTU2MDM2NCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://luminiitsolutions.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9502610,
            "companyId": 7198,
            "name": "Pessoa Engenheira de Software Sênior - Front end",
            "description": "Vamos buscar o extraordinário juntos? 🚀Somos um time de especialistas focados na inovação de produtos e serviços financeiros.&nbsp;Oferecemos uma solução pioneira: uma one-stop-shop para profissionais bancários independentes e escritórios de investimentos.Juntos, transformamos o mercado financeiro por meio da tecnologia. Temos como propósito, com muita franqueza, garantir a autonomia, a liberdade e a transparência para os consumidores.Por isso, buscamos maneiras transformadoras de melhorar a forma como nossos clientes se relacionam com o mercado.Somos a Franq - Finance is Personal.&nbsp;💵Nossos princípiosFalamos de pessoa para pessoaBuscamos o extraordinárioDamos vida à inovaçãoNos fortalecemos com a transparênciaResponsabilidades e atribuiçõesO seu papel será:Criar experiências digitais memoráveis – Desenvolver interfaces responsivas e acessíveis a partir de wireframes e protótipos, garantindo uma navegação fluida e intuitiva.Escrever código limpo e escalável – Participar de code reviews, garantindo a qualidade do código e promovendo boas práticas.Construir aplicações performáticas – Criar componentes reutilizáveis com React.js, TypeScript e TailwindCSS, otimizando carregamento e acessibilidade.Colaborar ativamente com o time – Trabalhar próximo a UX/UI Designers, Product Managers e Backend Engineers, garantindo a melhor experiência para os usuários.Garantir estabilidade e inovação – Monitorar e resolver incidentes rapidamente, além de desenvolver novas features e melhorias contínuas para a plataforma.Requisitos e qualificaçõesO que esperamos:Experiência sólida em React e sua stack principal (Hooks, Context API, Server Components e State Management com Redux, Zustand ou Recoil).Conhecimento avançado em Next.js para construção de aplicações performáticas e escaláveis.Domínio de JavaScript e TypeScript.Experiência com CSS moderno (TailwindCSS, Emotion ou Styled Components).Experiência com arquitetura de componentes reutilizáveis e acessibilidade (A11y).Conhecimento em CI/CD pipelines, integração contínua e versionamento com Git/GitHub ou Bitbucket.Prática em testes automatizados com Jest, React Testing Library ou CypressCapacidade de trabalhar com Figma ou Sketch, transformando designs em código fiel ao protótipo.Familiaridade com arquitetura de Microfrontends e integração com Microsserviços e APIs, garantindo modularidade e escalabilidade.Experiência com estratégias de gerenciamento de bundle (Lazy Loading, Code Splitting e Tree Shaking) para otimização de performance e carregamento progressivo.Você irá se destacar se tiver:Conhecimento em Storybook para documentação e testes de UI.Familiaridade com Web Performance Optimization (WPO) e técnicas avançadas de SSR/ISR.Experiência com Infraestrutura AWS (Amplify, S3, CloudFront, Lambda).Se você quer fazer parte de um time que valoriza a inovação, a colaboração e a excelência técnica, vem com a gente!Informações adicionaisAqui na Franq você vai:Atuar com um time de profissionais experientes e renomados do mercado financeiro;Participar de um projeto inovador que impacta vidas financeiras de clientes além de criar novas formas de fazer negócio.Ambiente dinâmico e colaborativo, com foco em inovação contínua;Oportunidade de crescimento e desenvolvimento profissional;Flexibilidade de trabalho remoto;&nbsp;Vamos oferecer:Contrato CLT;Ambiente leve e descontraído;Cartão de benefícios flexíveis Caju de R$ 933,48;&nbsp;Assistência médica e odontológica, sem coparticipação, totalmente subsidiada pela empresa.Seguro de vida;GympassNo dress code;Day off no mês de aniversário.﻿Diversidade e Inclusão na Franq!Aqui na Franq você tem espaço para ser franco com você, ser quem você é!Nós te valorizamos, independente de raça, cor, religião, identidade de gênero, nacionalidade, deficiência, orientação sexual, descendência ou idade.Todas as nossas vagas são aptas para receber candidaturas de pessoas com deficiências, caso você se enquadre. Você pode especificar na sua candidatura e informar o código do CID correspondente.VENHA BUSCAR O EXTRAORDINÁRIO CONOSCO🚀Venha ser Franqer!#GoFranq",
            "careerPageId": 15784,
            "careerPageName": "Franq",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/7198/career/15784/images/2021-07-05_14-49_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-07-11T12:23:12.295Z",
            "applicationDeadline": "2026-12-31T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Florianópolis",
            "state": "Santa Catarina",
            "country": "Brasil",
            "jobUrl": "https://franq.gupy.io/job/eyJqb2JJZCI6OTUwMjYxMCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://franq.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 7205326,
            "companyId": 59833,
            "name": "Banco de Talentos - Senior Front End Developer [react]",
            "description": "Quem somos:A Dentsu World Services (DWS) é parte do grupo Dentsu, presente em mais de 140 países e conta com mais de 50.000 pessoas comprometidas com nossa missão. No Brasil, em Porto Alegre/RS, atuamos como centro de tecnologia, inovação e design do grupo. Possuímos parceria com diversas agências do grupo e estamos empenhados em entregar soluções criativas e inovadoras aos nossos clientes, atendendo a projetos de desenvolvimento web e mobile. Embora tenhamos nosso escritório físico, por acreditarmos numa conexão sem fronteiras, temos pessoas espalhadas por todo o país que compões os times da DWS Brazil.Os DWSianes se integram a times multiculturais e que contam com pessoas de diversos países, levando o trabalho em grupo a um nível mais elevado e significativo. Assim, a diversidade de ideias contribui para a construção de tecnologias&nbsp;que revolucionam o mercado.&nbsp;Muitos desafios, aprendizado e crescimento esperam você na DWS Brazil!#vemserumDWSiane&nbsp;&nbsp;Estamos em busca de uma Pessoa Desenvolvedora&nbsp;Senior em React.js para apoiar no desenvolvimento Front end de nossas soluções.Responsabilidades e atribuiçõesVocê será responsável por:Projetar e desenvolver o front end de páginas web e suas aplicações, utilizando Javascript (react);&nbsp;Fazer a manutenção de códigos em banco já existente, através de testes e correção de erros;&nbsp;Compor os times com expertise em desenvolvimento front end;Auxiliar o time nas rampas técnicas em atividades de alta complexidade;Realizar a manutenção de códigos, através de testes e correção de erros;Apoiar a integração com o back end do sistema;Analisar, desenvolver e testar aplicações, utilizando metodologia e procedimentos adequados para sua implantação;Apoiar nas definições técnicas e funcionais embasadas nas necessidades de negócio;Documentar todo o processo de desenvolvimento do código;&nbsp;Criar relatórios de status e possíveis problemas para o Project Manager;Participar de reuniões técnicas e cerimônias do projeto.Requisitos e qualificaçõesPara essa posição, é importante que você tenha: Experiência em tecnologias como HTML, Javascript e Typescript;Experiência em frameworks de Front end, React, Next.JS;Experiências nas bibliotecas Redux, Flux e Hooks;Aplicação de testes unitários, Clean Code e Clean Architecture;Familiaridade com desenvolvimento ágil;Conhecimentos no idioma inglês, comunicação verbal e escrita em nível avançado.Informações adicionaisAqui você vai encontrar (Nossos benefícios):Todo o equipamento necessário para seu trabalho (notebook e periféricos);Plano de saúde e odontológico;Seguro de vida;Mental health program;Anywhere office - flexibilidade para trabalhar de onde precisar;VR/VA (cartão de benefícios Flash);Auxílio home office (cartão de benefícios Flash);Auxílio mobilidade (cartão de benefícios Flash);Programa de mentoria para desenvolvimento e acompanhamento de carreira;Participação nas tracks de desenvolvimento (investimento em cursos e etc) e acesso a nossa plataforma gratuita com muitos cursos para self Learning;&nbsp;Aulas de inglês com professor particular;&nbsp;Awesomeness Committee - envio de mimos temáticos e exclusivos;&nbsp;Gympass;&nbsp;Horário flexível (40h semanais);&nbsp;Day off no dia do aniversário;&nbsp;Appreciation - Programa de reconhecimento com possibilidade de doar e receber 'dentsu dolars' mensalmente;&nbsp;Atuação 100% remota ou híbrida (a sua escolha).",
            "careerPageId": 147026,
            "careerPageName": "Dentsu World Services Brazil",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/59833/career/147026/images/2023-06-08_19-32_companyLogoUrl.jpg",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2024-05-22T19:00:55.094Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://dwsbrazil.gupy.io/job/eyJqb2JJZCI6NzIwNTMyNiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://dwsbrazil.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 6944103,
            "companyId": 732,
            "name": "Banco de Talentos | Front-End Engineer - Remote",
            "description": "Transforme o futuro da segurança de aplicações com a Conviso!Nosso propósito é empoderar pessoas desenvolvedoras para construírem aplicações mais seguras, ajudando empresas a alcançar maior maturidade em desenvolvimento seguro, mitigar riscos e proteger o que importa: seus negócios. Somos movidos pela inovação, investindo em pesquisa e novas tecnologias para transformar a cultura de segurança de aplicações em todo o mundo.Como Front-End Engineer da Conviso, você fará parte de uma equipe plural e multidisciplinar, colaborando com nosso time de Product Development. Você irá trabalhar diretamente com nosso principal produto, a Conviso Platform, que é uma plataforma completa de DevSecOps.Aqui, acreditamos que grandes resultados vêm de pessoas apaixonadas por hacking e que compartilham o compromisso de tornar o mundo mais seguro. Nossa cultura é transparente, colaborativa e focada no aprendizado contínuo. Além disso, somos um time anywhere office com uma equipe que trabalha em mais de 34 cidades diferentes e cada Insider (nossas pessoas colaboradoras) tem liberdade para crescer de onde quiser.💻 Trabalho remoto, impacto global.Está pronto para transformar desafios em soluções e crescer com a gente?Vem para a Conviso! 💙💛Responsabilidades e atribuições✨ SEU DIA A DIAFocar na entrega de valor para o produto, utilizando boas práticas de desenvolvimento como DDD, TDD, BDD e Clean Architectures;Realizar revisão de código de outros desenvolvedores do time para ajudar a garantir a qualidade do nosso código;Colaborar nas definições de arquitetura e escalabilidade dos nossos produtos;Desenvolvimento focado em API-First;Aplicar boas práticas de modelagem de banco de dados;Desenvolver utilizando as melhores práticas de segurança;Ter uma boa comunicação com o time, colaborar e trazer novas ideias e apoiar time e gestor na tomada de decisões.Requisitos e qualificações👀 IMPRESCINDÍVEL TERConhecimento em Javascript, HTML e CSS;Experiência em VueJs (v2 e v3);Experiência em TypeScript;Experiência construindo aplicações web data-driven consumindo serviços/APIs;Experiência em GraphQL;Experiência com testes automatizados;Conhecimento em protocolos de comunicação: TCP/UDP, HTTP;Conhecimento em Web Servers e Proxies;Conhecimento em containers Docker;Conhecimentos em Cloud (AWS, Azure ou outras equivalentes);Conhecimentos em CI/CD.⚡ SERÁ UM DIFERENCIALConhecimento em Ruby;Conhecimento em Python;Conhecimentos de UX e Design;Ter inglês intermediário ou superior.Informações adicionais🚀 COMO SERÁ SUA JORNADA&nbsp;Candidatar-se;Fazer nosso Teste de Inglês.Caso o seu perfil seja aderente à alguma posição iremos te realocar na vaga e entrar em contato com você! 😉🎁 BENEFÍCIOSAlém de trabalhar numa empresa onde você pode se desenvolver enquanto faz parte integralmente do negócio, oferecemos benefícios para tornar nossos dias ainda mais agradáveis!Vale Refeição de R$1000,00 por mês, pagos no cartão multibenefícios Flash, com desconto de apenas R$1 por mês;Auxílio anywhere office de R$100,00 por mês;Plano de saúde e odontológico da Amil nacional para cuidar de você, sem desconto;Plano específico da Flash Care para saúde mental e atenção primária à saúde;Seguro de vida;Gympass ou Totalpass;Acesso à plataforma de cursos de idioma da Duolingo para dar um up no idioma;Reembolso de 70% em treinamentos e certificações;Programa de Indicação: Meu Amigo Vale Ouro;Programa filho nota 10;Day off de aniversário;Day off no dia de mudança de casa;Time off to pet care;Qualidade de vida, horário semi-flexível e trabalho 100% remoto, isso mesmo, anywhere office.💛 QUER SABER MAIS SOBRE A CONVISO?!Culture CodeBlog&nbsp;Podcast&nbsp;Canal do youtube—Aqui a diversidade importa! Valorizamos as diferenças, pluralidades de raça, cor, religião, gênero e identidade de gênero, nacionalidade, orientações sexuais ou de idade, pois acreditamos na importância de compartilhar ideias e pontos de vista distintos.Cada pessoa importa, ninguém aqui é somente um número. Cada Insider importa! 💙💛",
            "careerPageId": 943,
            "careerPageName": "Conviso Application Security",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/732/career/943/images/2022-02-04_21-04_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2024-03-27T14:33:08.378Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://convisoappsec.gupy.io/job/eyJqb2JJZCI6Njk0NDEwMywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://convisoappsec.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 4829259,
            "companyId": 56104,
            "name": "Pessoa Desenvolvedora Front-end (Angular) ",
            "description": "Ser MJVer 🤝 é estar em um dos melhores lugares para trabalhar.Nós sabemos que na construção de uma sociedade mais forte a evolução deve vir de dentro para fora. Por isso, um ambiente acolhedor e com o sentimento constante de pertencimento é fundamental para o crescimento individual e coletivo.O esforço é de todos nós, e as conquistas também. Porque ser um MJVer é bem mais do que ser um colaborador: é sobre fazer parte. Somos colaborativos, ágeis, plurais, criativos e inovadores. Somos MJV!&nbsp;Saiba mais em Quem Somos: https://www.mjvinnovation.com/pt-br/quem-somos/Responsabilidades e atribuiçõesResponsável por criar a interface de utilização de um site ou aplicação web.Criar a camada visual das aplicações web, na qual os usuários interagemMontar a estrutura da página, colocando o cabeçalho, rodapé, colunas e imagens em seus devidos lugares.Cuidar da estilização da página cuidando da sua aparência, adicionando as devidas cores e fontes, por exemplo.&nbsp;Garantir o fluxo de navegação entre as páginas, de forma que o usuário consiga navegar pela aplicação com boa fluidez.Requisitos e qualificaçõesRequisitos necessários:Experiência com framework JavaScript Angular;&nbsp;mínimo de 04 anosHTML5; CSS3; JavaScript VanillaJS(ES6); Jquery; - Wordpress; Experiência com Pré-processadores CSS ( SASS, SCSS, LESS ou Stylus); Familiaridade com algum \"task runner\" (Gulp, Grunt).Desejável:Experiência com Hubspot (Desenvolvimento de módulos, componentes e temas); Google Analytics; Google Tag Manager; Google Search Console; PHP; Nodejs; MySQL.Modelo de TrabalhoTer disponibilidade para trabalhar no modelo Híbrido, 3x por semana presencial e 2x remotoInformações adicionaisO que oferecemos para você:🍕 Vale Refeição;👨🏾‍🤝‍👩🏽‍🤝‍👩🏼 Seguro de vida em grupo;🏨 Plano de saúde e odontológico - Amil;💪🏽 TotalPass;✈️ People Mobility: damos uma forcinha para pessoas que tem interesse e disponibilidade de atuar em projetos desafiadores em outros estados e países;💻 Ações de treinamento: palestras, fóruns, trocas e conversas de conhecimentos relativos ao nosso negócio. Estamos em constante conexão para aprender mais e juntos;🗣️ Grupos de idiomas;💲 Parcerias: quer desconto? Temos um grupo no Workplace onde divulgamos parcerias com instituições de ensino, escolas de idiomas, academias, restaurantes, produtos e outros serviços;👉 Programa +MJVer: programa interno de indicação onde você indica um colega para trabalhar conosco e se esse relacionamento der match, você ganha um prêmio;💡 Co-criação: conectamos talentos para gerar soluções completas. Colaboração está no nosso sangue.",
            "careerPageId": 137587,
            "careerPageName": "MJV Technology & Innovation",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/56104/career/137587/images/2023-02-23_13-06_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-06-30T20:02:37.508Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://mjvcarreiras.gupy.io/job/eyJqb2JJZCI6NDgyOTI1OSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://mjvcarreiras.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 4739348,
            "companyId": 40133,
            "name": "Desenvolvedor Front end Angular Pl/Sr",
            "description": "16029 - Desenvolvedor Front End Angular PL/SR.Deve possuir habilidades sólidas em HTML, CSS e JavaScript, além de conhecimentos na linguagem TypeScript e experiência na criação de interfaces de usuário responsivas, acessíveis e intuitivas, utilizando frameworks e bibliotecas modernas de front-end como Bootstrap no desenvolvimento de componentes reutilizáveis, serviços, roteamento, gerenciamento de estado e integração com APIs RESTful e realizar testes unitários e de integração.&nbsp;Conhecimentos em design de sistemas, incluindo padrões de arquitetura, modelagem de dados e design de APIs, além de trabalhar em conjunto com equipe de desenvolvimento em .Net e UX.&nbsp;Habilidades em programação utilizando a linguagem C# e outras linguagens e tecnologias da plataforma .NET são bem-vindas.Contratação: PJ - 100% remoto.Ao enviar seu currículo você confere pleno consentimento ao tratamento de dados pessoais nos termos da nossa Política de Privacidade https://www.taking.com.br/politica-de-privacidade/",
            "careerPageId": 91359,
            "careerPageName": "Taking",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/40133/career/91359/images/2022-08-22_12-31_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2023-04-26T18:01:46.034Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Sp",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://taking-people&91359&inactive.gupy.io/job/eyJqb2JJZCI6NDczOTM0OCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": ""
        },
        {
            "id": 3590796,
            "companyId": 14557,
            "name": "Banco de Talentos - Pessoa Instrutora de Ensino Front-end [Vaga Afirmativa para Mulheres]",
            "description": "➡Essa é uma vaga para o nosso&nbsp;Banco de Talentos! Isso significa que a vaga não está disponível agora, mas você pode se inscrever e nós da&nbsp;Cubos&nbsp;iremos analisar a sua inscrição e quando surgir uma vaga que esteja alinhada com o seu perfil, entraremos em contato com você, ok?➡A&nbsp;Cubos Academy&nbsp;é uma escola de formação de&nbsp;profissionais da área de tecnologia. Fomentamos o mercado de tecnologia, qualificando novos profissionais e intermediando sua entrada no mercado de trabalho, contando com uma área especializada na empregabilidade dos nossos alunos.🏃Buscamos uma pessoa com&nbsp;experiência em Frontend, em níveis de carreira:&nbsp;Júnior, Pleno ou Sênior,&nbsp;que goste de compartilhar conhecimento e acredite no potencial transformador da educação na vida das pessoas! Essa pessoa irá compor nosso time da&nbsp;área de Pedagógico&nbsp;e estará em constante comunicação com o time e acompanhando o desenvolvimento e evolução dos nossos alunos.&nbsp;➡ Se você gosta de ensinar e contribuir para o desenvolvimento das pessoas essa vaga é pra você! 💪🏻﻿#VempraCubosAcademy🚀Responsabilidades e atribuiçõesImpactar diretamente na formação de novas pessoas desenvolvedoras através da instrução dos conteúdos de Front-end;Criar, projetar e resolver exercícios e projetos que serão praticados durante o processo de aprendizagem de nossos estudantes;&nbsp;Sanar dúvidas dos estudantes e orientá-los nos projetos e desafios propostos pelo curso;Preparar materiais e conteúdos, aulas ao vivo focando em pontos que o mercado realmente valoriza em uma pessoa desenvolvedora;Preparar aulas de revisão para os estudantes, com o intuito de sanar dúvidas que foram recorrentes durante as aulas anteriores;Mentorear e acompanhar o desempenho e o desenvolvimento da turma;Participar das reuniões de acompanhamento da turma junto ao time de experiência do estudante;Acompanhar e dar suporte às pessoas monitoras ao longo do curso;Participação na idealização e estruturação de novos cursos da Cubos Academy.Requisitos e qualificações🏅ObrigatóriosBoa comunicação oral e escrita;Gostar de ensinar e aprender;Conhecimento em HTML, CSS e Javascript (ES6+);Experiência com React, Vue.js, Angular ou Svelte;Experiência consumindo bancos de dados relacionais;Conhecimento em versionamento com Git;Disponibilidade de dedicação de 40 horas semanais.&nbsp;&nbsp;🍒Cerejas do bolo, mas tudo bem se não tiver, nem todo bolo tem cereja:&nbsp;Experiência anteriores ministrando aulas (qualquer área);Gostar de ensinar e desenvolver pessoas;Já ter trabalhado com algum produto de educação;Experiência sólida com React;Conhecimento em Typescript;Informações adicionais🧡&nbsp;Nossos Benefícios:&nbsp;Plano de Saúde Bradesco (custeado 100% por nós) (CLT)Plano Odontológico Bradesco (CLT)Cartão de benefícios Flexíveis Flash: para você escolher onde usar (CLT)Auxílio Home Office (CLT)Day Off para o aniversariante em qualquer dia do mês para curtir como quiser (CLT + PJ)Vale presente no dia do seu aniversário (CLT + PJ)Gympass: para você cuidar do seu corpo e saúde (CLT + PJ)Licença Parental estendida (CLT + PJ)Licença Casamento estendida (CLT + PJ)🔎 O que mais você encontra aqui:Participação em Trilhas de ConhecimentoOne on One com a sua liderança: aquele bate-papo aberto e seguro pra você falar sobre sua carreira e também vida pessoal, feedback e tudo mais;Programa Pause: para ao longo do dia você não se esquecer de respirar novos ares, se alongar e dar uma pausa.Horário semi-flexível: dentro do horário comercialHome-office permanenteAqui na Cubos emendamos&nbsp;todos&nbsp;os feriados que caem das&nbsp;terças e quintas-feiras, para você poder curtir o feriadãoOportunidade de trabalhar em uma startup com um ambiente colaborativo, dinâmico e repleto de desafios.Informações Adicionais:As aulas serão todas online, então você pode estar em qualquer lugar do mundo.As aulas já estão gravadas e a ementa e o conteúdo desenvolvido.Para se candidatar, não é necessário possuir nenhum título acadêmico, como Mestrado ou Doutorado.🎉ContrataçãoPJ ou CLT: você escolhe!&nbsp;Cubos Academy e Diversidade﻿&nbsp;Estamos buscando cada vez mais um espaço de crescimento profissional e pessoal para todas as pessoas, respeitando as individualidades de cada um e reconhecendo as desigualdades.&nbsp;Ao se inscrever em nossas vagas, você poderá responder a algumas perguntas a fim de conhecermos melhor nossas pessoas candidatas. Essas informações são importantes para as nossas ações de&nbsp;equidade,&nbsp;diversidade&nbsp;e&nbsp;inclusão. Enfatizamos que sua resposta é&nbsp;opcional, e&nbsp;confidencial&nbsp;e não a usaremos como critério de avaliação.",
            "careerPageId": 37201,
            "careerPageName": "Cubos Academy",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/14557/career/37201/images/2021-11-16_18-08_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2022-11-30T18:12:25.389Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Salvador",
            "state": "Bahia",
            "country": "Brasil",
            "jobUrl": "https://cubosacademy.gupy.io/job/eyJqb2JJZCI6MzU5MDc5Niwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "careerPageUrl": "https://cubosacademy.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 1459517,
            "companyId": 1963,
            "name": "Pessoa Desenvolvedora Front-end (G1, Globo.com, Gshow, Globoplay, GE, Cartola)",
            "description": "A Globo&nbsp;é feita de gente que quer fazer diferente, fazer junto, fazer o futuro. Gente espalhada por todo o país (e mundo!) trabalhando com conteúdo, notícias, negócios, tecnologia e brasilidade de sobra. Canais na TV aberta e por assinatura, produtos digitais como globoplay, Cartola, g1, ge, gshow e outros serviços estão reunidos no mesmo lugar, na mesma globo. Novos modelos de negócios digitais estão sendo pensados e desenvolvidos, buscando nos aproximar cada vez mais do usuário e dos seus desejos. As oportunidades de novos negócios também trazem a chance e o desafio de construirmos novos times data-driven e que coloquem o consumidor no centro das nossas decisões.Criamos ambientes onde todas as pessoas são incluídas, acolhidas e valorizadas. Nos empenhamos em ser uma Globo cada vez mais diversa, em representatividade e pensamento, aprendendo uns com os outros e estimulando a criatividade e inovação.Responsabilidades e atribuiçõesO Hub Digital faz parte da nossa área de Estratégia e Tecnologia, tendo papel de destaque na nossa transformação em uma empresa media tech e D2C. Aqui cuidamos da gestão de dados e do desenvolvimento dos nossos produtos digitais como Globoplay, Globo.com, família G (G1, Ge, Gshow) e Cartola, visando a melhor experiência de consumo, interação e relacionamento com os nossos usuários.&nbsp;&nbsp;Trabalhamos com uma variedade de tecnologias e linguagens para atingir nossos objetivos, além de estabelecermos uma relação contínua e crescente de compartilhamento de soluções com a comunidade de tecnologia!&nbsp;&nbsp;﻿A inscrição em nosso banco de talentos não garante a contratação, pois ela dependerá da disponibilidade de vagas e avaliação de currículos e requisitos de cada uma das oportunidades.Como será seu dia a dia:&nbsp;&nbsp;Escrever código limpo, de fácil manutenção, utilizando as melhores práticas de desenvolvimento de software;&nbsp;Procurar sempre criar para os produtos&nbsp;Globo&nbsp;a melhor experiência de uso para o usuário final, trabalhando de perto com os especialistas em UX;&nbsp;Atuar como um&nbsp;team-player, comprometendo-se com os objetivos do time e trabalhando em harmonia com todos;&nbsp;Estar sempre crescendo e se desenvolvendo tecnicamente e profissionalmente;&nbsp;Participar de times geograficamente distribuídos.&nbsp;Requisitos e qualificaçõesDo que você precisa:&nbsp;Ter habilidades em algoritmos e estruturas de dados;Conhecimento em engenharia de software, como princípios, boas práticas e padrões de arquitetura;Experiência com desenvolvimento de Aplicações Escaláveis;Vivência com algumas linguagens de programação, como:&nbsp;JavaScript,&nbsp;Node,&nbsp;React, Angular,&nbsp;Vue,&nbsp;Redux,&nbsp;JS Vanilla,&nbsp;etc;Prática com as ferramentas de versionamento (como&nbsp;GIT,&nbsp;SVN,&nbsp;etc.);Experiência em escrever testes;Conhecimento em bancos de dados (MySQL,&nbsp;SQL,&nbsp;MongoDB,&nbsp;Oracle,&nbsp;etc.);Vivência com metodologias ágeis.Conhecimentos que te destacam:&nbsp;&nbsp;&nbsp;Ter noções com&nbsp;alguma linguagem de programação Back End:&nbsp;Python,&nbsp;Golang, Java, Ruby, Elixir, Scala,&nbsp;Clojure, C/C++, C#, etc.;Interesse em&nbsp;programar em todos os níveis do&nbsp;stacktecnológico;Experiência com Cloud, como AWS e Google Cloud Platform.&nbsp;Informações adicionaisPor que vir para Globo:&nbsp;&nbsp;Vem e vamos criar histórias e tecnologias juntos.Na Globo, o encontro de histórias com tecnologia move um time diverso e apaixonado por inovação. A gente tem a chance de aproximar os brasileiros, criando novas formas de se conectar com eles. Aqui, cada um faz a transformação acontecer.Nossos processos seletivos estão acontecendo de forma 100% remota e nós encorajamos inscrições de qualquer lugar do Brasil e do mundo. #vempraglobo&nbsp;&nbsp;&nbsp;&nbsp;Seguindo o compromisso de contribuir para um ambiente seguro para nossas pessoas, informamos que ter o esquema completo vacinação contra a Covid-19 é uma condição obrigatória para o trabalho na Globo, presencial ou a distância, e que o comprovante deverá ser apresentado como pré-requisito para a contratação.&nbsp;&nbsp;Quer saber mais sobre como é trabalhar na Globo? Vem acompanhar nosso dia a dia, desafios e conquistas nas nossas redes:&nbsp;https://www.linkedin.com/company/globo&nbsp;&nbsp;https://www.instagram.com/vempraglobo&nbsp;&nbsp;&nbsp;https://www.youtube.com/c/VemPraGlobo/&nbsp;&nbsp;Os seus dados pessoais serão utilizados para fins de seleção de candidatos para preenchimento das vagas abertas na Globo. Os dados pessoais coletados durante o processo seletivo dos candidatos que não forem admitidos neste momento poderão ser mantidos nos bancos de dados para consideração em futuros processos seletivos. Todos os dados coletados serão tratados segundo rígidos padrões de segurança da informação e em total respeito às leis de privacidade aplicáveis, incluindo a Lei 13.709/18, e nos termos de nossa política de privacidade, disponível no link:&nbsp;https://vempraglobo.g.globo/files/politica_de_privacidade.pdf&nbsp;Ao prosseguir você está ciente e de acordo para realização de sua candidatura nestes termos.&nbsp;",
            "careerPageId": 40535,
            "careerPageName": "Globo",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/1963/career/40535/images/2024-04-17_17-15_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2022-01-14T20:28:01.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Rio de Janeiro",
            "state": "Rio de Janeiro",
            "country": "Brasil",
            "jobUrl": "https://globo.gupy.io/job/eyJqb2JJZCI6MTQ1OTUxNywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://globo.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 1139506,
            "companyId": 390,
            "name": "TI | Desenvolvedor(a) Front End",
            "description": "O Hurb é uma das maiores empresas de tecnologia no setor de Travel Experiences do mundo e com muito orgulho, desde 2011, realizamos milhares de sonhos.Um dos pontos centrais da nossa cultura é ter as pessoas sempre em primeiro lugar, e alinhando isso com a nossa missão de \"Otimizar Viagens através da Tecnologia\", estamos formando equipes excepcionais - e em Software, não é diferente!De maneira robusta, contando com mais de dez squads (como CX, Hotéis, Metasearch e Pagamentos), construímos times de alta qualidade com lideranças extremamente acessíveis e uma estrutura horizontal.Porque muito mais do que código, esperamos do nosso time tech um olhar crítico e proporcionamos autonomia para pensar em novas soluções!A nossa prioridade é manter um ambiente de desenvolvimento, com espaço para todos crescerem em conjunto e tendo um olhar atento para novas tecnologias.Por isso, buscamos pessoas que sejam movidas a desafios e temos oportunidades para todos os níveis técnicos: Júnior, Pleno e Sênior! \\o/Ah, se a sua pegada for mais Back End, não deixa de se inscrever aqui: https://hurb.gupy.io/jobs/1139483?jobBoardSource=gupy_public_pageE se você curte ser Full Stack, corre nesse link: https://hurb.gupy.io/jobs/1139483?jobBoardSource=gupy_public_pageResponsabilidades e atribuiçõesEscrever testes com códigos por padrão;&nbsp;Ter habilidade em colocar uma aplicação em ambiente de produção, dentre outras atividades e domínios;Trabalhar para construir e manter aplicações Front End com alta performance e escalabilidade;Construir interfaces reativas, respeitando a identidade visual da companhia;Escrever testes unitários e de integração nas aplicações;Monitorar a saúde dos serviços em que atua;Melhorar a qualidade da base de código em que atua;Manter o fluxo de deployment e versionamento das aplicações consistente;Colaborar com um time multidisciplinar para manter um ambiente de desenvolvimento saudável e ágil.Requisitos e qualificaçõesExperiência com HTML, CSS, JavaScript e ReactJS;Vivência com metodologias ágeis, como Kanban e Scrum;Experiência com testes unitários e de integração;Conhecimento em conteinerização utilizando Docker;Conhecimento de Gitflow;Entendimento sobre os conceitos de clean architecture;Conhecimento sobre design patterns.DiferenciaisTer noções de Back End (Python, NodeJS, PHP ou Golang);Experiência aplicando TDD;Experiência na construção de APIs REST;Experiência com GraphQL.Informações adicionaisBENEFÍCIOS:Benefícios Flexíveis Caju: VR, VA e muito mais!;Vale Transporte ou Vale Combustível;Van Hurb;Plano de Saúde e Odontológico SulAmérica (extensível para dependentes);Café da Manhã e Lanche da Tarde (escritório);Auxílio Creche ou Babá;Aula de inglês e espanhol;Hurb Learning, o portal de ensino exclusivo do Hurb;Hurb Education Development Program - o Hurb te leva para se desenvolver e trabalhar em outros países!Self Growth (valor equivalente a um salário extra anual para investimento em educação, saúde mental ou coworking).PARCERIAS:Convênio Farmácia;TotalPass (Smart Fit) e BodyTech;Política educacional (desconto em diversas faculdades);Dell - itens de informática e tecnologia;E muito mais!Ahh e além disso tudo, sexta-feira é o Dia Internacional da Cerveja no Hurb!",
            "careerPageId": 360,
            "careerPageName": "Hurb",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/390/career/360/images/2022-01-18_14-04_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2021-08-24T17:31:51.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Rio de Janeiro",
            "state": "Rio de Janeiro",
            "country": "Brasil",
            "jobUrl": "https://hurb.gupy.io/job/eyJqb2JJZCI6MTEzOTUwNiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "careerPageUrl": "https://hurb.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 941135,
            "companyId": 1243,
            "name": "Desenvolvedor(a) Front-End",
            "description": "Vaga para nosso BANCO DE TALENTOSProcuramos&nbsp;Desenvolvedor(a) Front-End,&nbsp;responsável por criar&nbsp;a interface de utilização de um site ou aplicação web.Somos inquietos, somos desbravadores e estamos em constante transformação.Por isso, estamos na busca constante de crescimentos do nosso time com profissionais inovadores, que desafiam os limites e estejam preparados para embarcar em uma cultura totalmente nômade.SOMOS NÔMADES, NOSSAS VAGAS SÃO PARA QUALQUER LUGAR!Seja qual for o seu gênero, orientação sexual, idade, raça, etnia, crença ou deficiência, todos são bem-vindos no nosso time.Responsabilidades e atribuiçõesDesenvolvimento de front end com uso de HTML, CSS, JS e aplicação de Angular, React e Bootstrap;Projetar as estruturas web, sempre pensando na experiência do usuário;Produzir o layout do produto digital e criando interatividade entre os elementos da página ou do aplicativo.Requisitos e qualificaçõesConhecimento das técnicas de estilização CSS e alta proficiência em JavaScript;Conhecer pré-compiladores CSS, saber configurar e utilizar gerenciadores de tarefas, entender conceitos de testes automatizados, integração contínua e versionamento.Informações adicionaisOs desbravadores tem:Horário flexível, aqui você é responsável por se organizar;Cultura ágil, aqui todos os desbravadores utilizam metodologias ágeis no dia a dia;No dress code, seja 100% você;Vale transporte;Vale refeição ou alimentação FLEX;Gympass;Plano odontológico Bradesco;Plano de saúde Amil;Seguro de vida Metlife;Bem estar psicológico gratuito;Brivia Academy, treinamentos para aperfeiçoamento;Bônus salarial;Associação e descontos na&nbsp;ANAMID;E o melhor de todos: trabalhe de onde você quiser, somos nômades e estamos 100% em home office!",
            "careerPageId": 9448,
            "careerPageName": "Brivia",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/1243/career/9448/images/2022-03-21_12-58_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2021-06-04T22:33:05.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://brivia.gupy.io/job/eyJqb2JJZCI6OTQxMTM1LCJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://brivia.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 10
    }
}