{
    "data": [
        {
            "id": 9438526,
            "companyId": 345,
            "name": "Lead Data Engineer - Vila Velha/ES",
            "description": "Olá! :DBuscamos um profissional para liderar o time de Data Engineer (DataOps) da Autoglass Tech!&nbsp;&nbsp;Esse profissional possui o compromisso de garantir a entrega contínua, confiável e automatizada de dados para consumo analítico e operacional, liderando a equipe técnica e promovendo integração entre engenharia de dados, governança de dados e áreas de negócio.&nbsp;Também será responsável por liderar o uso de novas tecnologias e otimização do data lakehouse.Aqui você também irá trabalhar com as maiores clouds do mercado (AWS, GCP, Oracle, Snowflake) e também com tecnologias de ponta 😉Que tal gerir a equipe, cultivar e desenvolver nossos profissionais de dados?Curtiu o desafio?! Venha fazer história conosco 🚀Responsabilidades e atribuiçõesGerir equipes de Engenharia de Dados e DataOps;Elaborar planos de desenvolvimento individual e garantir o desenvolvimento individual e coletivo da equipe;Fornecer feedback's e gerenciar conflitos;Estruturar plano de trabalho para utilização de tecnologias dentro do contexto do data lakehouse;Liderar iniciativas e projetos relacionados a plataforma de dados;Buscar estratégias para otimizar custos de cloud da plataforma de dados;Apoiar na construção das soluções da área;Garantir a aplicação das metodologias ágeis dentro dos times;Ser um elo de comunicação entre as áreas de negócio e a TI.Requisitos e qualificaçõesEnsino superior completo ou em andamento;Experiência com: AWS ou outra cloud;Experiência com DataOps;Linguagem SQL;Experiência com Snowflake ou Bigquery;&nbsp;Linguagem de programação como Python, Java ou Scala;Conhecimento de bancos de dados relacionais e não relacionais;Spark.Valorizamos se você tiver:Participado de projetos de construção de data lake;Conhecimento com liderança de equipe.Informações adicionaisO que&nbsp;a Autoglass&nbsp;proporciona?&nbsp;&nbsp;Pra cuidar da sua saúde física e mental:&nbsp;🩺&nbsp;Plano de saúde&nbsp;Unimed e Plano odontológico&nbsp;Bradesco, extensivos a seus dependentes;&nbsp;💙&nbsp;Atendimento psicológico e nutricional;&nbsp;💙&nbsp;Seguro de vida;&nbsp;💙&nbsp;Programa da Gestante com licença maternidade estendida;&nbsp;💙&nbsp;Espaço Cuidar - Salão de beleza;&nbsp;🏋️‍♀️&nbsp;Wellhub&nbsp;(desconto em academias);💆&nbsp;&nbsp;Para&nbsp;tornar o seu dia mais leve, na&nbsp;Autoglass&nbsp;você recebe massagem relaxante em seu posto de trabalho.&nbsp;&nbsp;&nbsp;Pra apoiar seu dia a dia:&nbsp;🚌&nbsp;Vale transporte;&nbsp;🛒&nbsp;Vale Refeição e Alimentação (Cartão Ifood Benefícios);&nbsp;📚&nbsp;Descontos em creches e escolas para os papais&nbsp;e mamães;&nbsp;📚&nbsp;Descontos em Instituições de Ensino;&nbsp;☕ Café da manhã e da tarde;😎 Oportunidade de trabalhar e trocar conhecimentos diários com um time incrível e acolhedor;&nbsp;🏠 Oportunidades&nbsp;Home Office;&nbsp;💺 Trabalho de modo confortável! Caso necessário, enviaremos toda mobília para&nbsp;equipar o seu ambiente Home Office;&nbsp;👥 Programa Indica Tech - bônus por indicar novos talentos para fazerem parte do time.&nbsp;&nbsp;Pra desenvolver sua carreira:&nbsp;🚀&nbsp;Oportunidade de crescimento profissional;🚀 Acesso ao Portal de Educação Corporativa Grupo Autoglass com mais de 200 cursos gratuitos e com emissão de certificado;🚀&nbsp;Treinamentos e programas de mentorias frequentes;&nbsp;🚀&nbsp;Acesso GRATUITO e EXCLUSIVO à plataforma&nbsp;Alura ou Udemy;&nbsp;🚀&nbsp;Programa de Incentivo à Certificação;&nbsp;🚀 Um&nbsp;ambiente de trabalho altamente colaborativo e desafiador.No Grupo Autoglass, você encontrará oportunidade de crescimento e uma cultura de inovação e melhoria contínua muito forte.&nbsp;",
            "careerPageId": 38719,
            "careerPageName": "Grupo Autoglass Tech",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/345/career/38719/images/2024-03-25_14-42_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-07-09T17:00:45.224Z",
            "applicationDeadline": "2026-02-28T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://autoglasstech.gupy.io/job/eyJqb2JJZCI6OTQzODUyNiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://autoglasstech.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 8757860,
            "companyId": 53927,
            "name": "BANCO DE TALENTOS| VEM SER DATA! ",
            "description": "Vem Ser Data!&nbsp;🌟A Data acredita no poder transformador das pessoas. Aqui, trabalhamos com excelência técnica, liderança, inovação e espírito de equipe, competências poderosas que guiam nossa atuação e evolução.&nbsp;&nbsp;Se você procura por uma empresa com um time altamente especializado, excelente clima organizacional e parceira dos clientes na potencialização de seus resultados, estamos prontos para acompanhá-lo nessa jornada.Responsabilidades e atribuiçõesTransforme o Seu Potencial em Realidade. Venha para o Nosso Banco de Talentos! 🌟Aqui, acreditamos que cada pessoa tem algo único a oferecer. Se você é movido por resultados, busca constantemente o aprimoramento e deseja fazer parte de uma equipe que valoriza a diversidade e a criatividade, nós queremos conhecê-lo!Ao se inscrever no nosso Banco de Talentos, você terá acesso a uma rede de oportunidades incríveis, com chances de trabalhar em projetos inovadores, desenvolver suas habilidades e contribuir para um ambiente de trabalho dinâmico e colaborativo.Se você é apaixonado pelo que faz e acredita no poder de transformar o mundo ao seu redor, nós queremos ver seu talento brilhar. Não perca a chance de fazer parte da nossa jornada!Cadastre-se agora e dê o primeiro passo para um futuro cheio de possibilidades.Junte-se ao nosso Banco de Talentos. O melhor ainda está por vir.Informações adicionaisNa nossa empresa, você tem benefícios completos para cuidar da sua saúde, bem-estar, crescimento profissional e qualidade de vida! 🌟Qual o horário de trabalho?&nbsp;Das 07:15 às 16:33h, de Segunda à Sexta.🏥&nbsp;Assistência Médica: Cuidado para sua saúde.🦷&nbsp;Assistência Odontológica: Sorriso saudável garantido.🍽️&nbsp;Alimentação na Empresa: Refeições saudáveis e saborosas, avaliadas por nossas Nutricionistas.💳&nbsp;Cartão Premiação: Cartão premiação por assiduidade.💊Cartão Farmácia:&nbsp;Cuide da sua saúde com descontos.&nbsp;&nbsp;🚍&nbsp;Fretado ou Vale Transporte: Mobilidade facilitada.💰&nbsp;PLR: Participação nos lucros da empresa.🛡️&nbsp;Seguro de Vida: Tranquilidade para você e sua família.🎓&nbsp;Política de Bolsa de Estudos: Invista no seu futuro.👫&nbsp;Programa Quem Confia Indica: Indique e seja recompensado!🏋️&nbsp;Clube Sesi: Lazer e bem-estar sua e de sua família ao seu alcance.💪&nbsp;Gympass: Incentivo para sua saúde física.Aqui, você é nosso maior ativo! 💼✨",
            "careerPageId": 109405,
            "careerPageName": "Data Engenharia",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/53927/career/109405/images/2024-01-29_19-16_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-03-06T12:51:55.423Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Sarzedo",
            "state": "Minas Gerais",
            "country": "Brasil",
            "jobUrl": "https://dataengenharia.gupy.io/job/eyJqb2JJZCI6ODc1Nzg2MCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://dataengenharia.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 7072991,
            "companyId": 5581,
            "name": "Data Insight",
            "description": "Empresa líder global em serviços profissionais, com ampla atuação e oferta de soluções em estratégia de negócios, consultoria, digital, tecnologia e operações.Responsabilidades e atribuiçõesFará visualização de dados, desenvolvimento de dashboards e análise de dados.Visualização de dados e desenvolvimento de dashboards (ou seja, PowerBI, Tableau, QlikView ou outros clientes analíticos).Antecipará as necessidades analíticas dos clientes e conceitua e defende proativamente soluções de Business Intelligence de alto valor.Requisitos e qualificaçõesExperiência comprovada em visualização de dados, desenvolvimento de dashboards e análise de dados.Proficiência em domínio de visualização de dados e desenvolvimento de dashboards: PowerBI, Tableau, QlikView ou outros clientes analíticos.Experiência em análise de negócios em empresas de grande porte com múltiplas funções/unidades de negócios.Proficiente em SQL avançado para manipulação e visualização de dados.Familiarizado com ferramentas de orquestração de fluxo de trabalho para extração e transformação eficiente de dados.Proficiente em análise de causa raiz para solucionar anomalias de dados, garantindo a qualidade dos dados e conduzindo correções proativas em pipelines de dados.Informações adicionaisVale Alimentação 150,00 mensal&nbsp;Vale refeição 35,00 por dia&nbsp;Day off no dia do Aniversário + voucher almoço R$ 41,00&nbsp;Assistência Médica Amil sem desconto para o titular e dependente 100%&nbsp;Assistência Odontológica Amil titular e dependente custo 100%&nbsp;Ambiente com cultura de inovação, meritocracia e desenvolvimento&nbsp;Auxílio de Custo – R$350,00/mês&nbsp;Auxilio creche 20% do salario normativo do acordo sindical (filhos até 60 meses)&nbsp;PLR valor estipulado confome acordo sindical.&nbsp;",
            "careerPageId": 166396,
            "careerPageName": "QiBit Vagas",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/5581/career/166396/images/2024-04-03_15-29_companyLogoUrl.png",
            "type": "vacancy_type_temporary",
            "publishedDate": "2024-04-23T18:48:56.075Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://qibit.gupy.io/job/eyJqb2JJZCI6NzA3Mjk5MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://qibit.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 6663937,
            "companyId": 410,
            "name": "Base de Datos 2024",
            "description": "¡BASE DE DATOS CBN!¿No encuentras una vacante que se ajuste a tu perfil?Déjanos tu CV aquí 🍻 *Utilizamos esta base para encontrar talentos en el caso de abrirse una vacante en nuestra compañía, por lo cual te pedimos que llenes tus datos y completes todo el proceso.!No pierdas la oportunidad!Responsabilidades y atribucionesRequisitos y calificacionesBuscamos talento: personas dinámicas, curiosas, con ganas de aprender y aportar a nuestros equipos.Buscamos buenas personas: gente empática, colaborativa, dispuesta a trabajar en equipo.Formación sugerida: Licenciatura en ramas comerciales/industriales/corporativas (si eres egresado/a de la carrera o estás en último año, también puedes registrarte).Nivel de manejo del paquete Microsoft Office: intermedioInglés: intermedio (depende de la posición)Informaciones adicionales",
            "careerPageId": 398,
            "careerPageName": "Cervecería Boliviana Nacional S.A",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/410/career/398/images/logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2024-01-23T20:48:17.713Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "",
            "state": "",
            "country": "",
            "jobUrl": "https://cbn.gupy.io/job/eyJqb2JJZCI6NjY2MzkzNywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "on-site",
            "careerPageUrl": "https://cbn.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 5513167,
            "companyId": 2022,
            "name": "OCA | Datos & CRM",
            "description": "En OCA queremos ser la plataforma financiera más relevante de Uruguay y contribuir activamente al desarrollo de nuestra comunidad. Nos seguimos transformando; cambiando formas de trabajar y pensar, buscando estrategias nuevas e innovadoras. Siempre pensando en nuestros clientes.Con +500 mil clientes, variedad de productos, experiencias 100% digitales y una red física con +30 sucursales, queremos llevar contigo a OCA al siguiente nivel.Responsabilidades e atribuições·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Desarrollar actividades que permitan maximizar el uso de CRM, con una visión cliente 360 y basado en datos; trabajando conjuntamente con los equipos de negocio, marketing, comunidad experiencia y CX, trabajando en metodologías ágiles·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Extracción, análisis y procesamiento de datos, para generar audiencias y seguimiento de resultados. ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Definición reglas y políticas CRM·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Uso Marketing Cloud en Salesforce·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ser parte de una compañía líder y en constante crecimiento.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sumarte a una empresa en constante cambio·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un excelente clima de trabajo.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Aprender en un ambiente dinámico, donde podrás explotar tu potencial y tus ideas.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Trabajar en equipo, dispuesto a compartir experiencias y en búsqueda de nuevos desafíos.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un lugar para potenciar tus habilidades·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ser protagonista de tu desarrollo, con oportunidades, aprendizaje, crecimiento&nbsp;y proyectos desafiantes.Requisitos e qualificações&nbsp;·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ganas de ser protagonista·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Capacidad analítica, orientada a resultados, con toma de decisiones basadas en datos·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excelente dominio aplicado de:\to&nbsp;&nbsp;herramientas de análisis (SQL y/o python)\to&nbsp;&nbsp;visualización de datos (tableau o similar)\to&nbsp;&nbsp;Saleforce, especificamente Marketing Cloud (creación de Data Extensions, jornadas, resultados, etc)Informações adicionais·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Idioma unidad: Español ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se valorará experiencia en desarrollo/uso de modelos estadísticos·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se valorará experiencia en servicios cloud, preferentemente AWS·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se valorará conocimientos en agilidad (Scrum, kanban, etc)Ter ao menos 1 ano de Itaú UnibancoSer nível pleno, Sênior ou acimaAlinhar inscrição com liderançaDisponibilidade de 6-9 meses fora do Brasil",
            "careerPageId": 93202,
            "careerPageName": "International Experience ✈ ",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/2022/career/93202/images/2022-10-14_15-22_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-09-21T18:12:15.314Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "",
            "state": "",
            "country": "",
            "jobUrl": "https://internationalexperienceitau.gupy.io/job/eyJqb2JJZCI6NTUxMzE2Nywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://internationalexperienceitau.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 5226299,
            "companyId": 316,
            "name": "Vagas Exclusiva para Pessoas com Deficiência I Área Big Data (Banco de Talentos)",
            "description": "Estamos em busca de talentos&nbsp;diversos para área de Big Data à nível Brasil.A diversidade da nossa equipe é fundamental para criarmos um ambiente que estimule a inovação e a criatividade, onde pessoas com diferentes histórias de vida e formas de pensar convivam, em busca de soluções conjuntas. Além disso, como temos a pretensão de ser uma companhia capaz de atender a toda a população brasileira, entendemos que precisamos refletir a diversidade dessa população em nossas equipes.&nbsp;Globalmente, contamos com uma Política de Diversidade e Inclusão, que estabelece a busca pela diversidade nas seguintes dimensões: cultural, gênero, raça, orientação sexual, geração, religião, habilidade e deficiência.&nbsp;Nosso Propósito é promover&nbsp;a cultura inclusiva, ampliando nossa capacidade de compreender, valorizar e incluir o diverso para que possamos conviver com um número cada vez maior de ideias, valores, identidades, orientações e origens.Garantir&nbsp;a participação de diferentes públicos, ampliando, inicialmente, a representatividade de mulheres, negros e pardos, pessoas com deficiência e LGBTI+, em todos os níveis hierárquicos da empresa.Responsabilidades e atribuiçõesQueremos construir uma porta de entrada para você aqui na Vivo! E para isso, queremos conhecer sua carreira e seus&nbsp;skills&nbsp;voltados para a área de: Big DataA ideia é que tanto a equipe de Atração de Talentos quanto os gestores das áreas tenham acesso ao seu currículo para que possamos avalia-lo para nossas oportunidades, então capricha no seu cadastro! Conta para gente em quais dessas áreas você manda bem para podermos oferecer uma oportunidade que tenha a sua cara!Requisitos e qualificaçõesEstar inserido dentro de um (ou mais) pilar de diversidade (PCD, raça, LGBTQI+, 50+, mulheres em cargos de liderança);Conhecimento e/ou experiência em:Capacidade de analisar e interpretar conjuntos de dados complexos. Isso envolve a habilidade de identificar padrões, tendências e insights valiosos que podem ser usados para tomar decisões estratégicas e impulsionar o negócio;Conhecimentos sólidos em programação e experiência em linguagens de programação como R ou Python, pois essas são ferramentas importantes para manipular e analisar grandes volumes de dados;Capacidade de trabalhar com diferentes tecnologias e plataformas de Big Data, como Hadoop e Spark. Essas tecnologias são usadas para processar e armazenar grandes quantidades de dados de forma eficiente e escalável;Habilidades de visualização de dados, pois a apresentação de informações de forma clara e compreensível é fundamental para transmitir insights para as equipes de negócios;Capacidade de trabalhar em equipe e se comunicar de forma eficaz também é crucial, pois os projetos de Big Data geralmente envolvem colaboração com diferentes áreas da empresa, como marketing, finanças e operações.Procuramos profissionais que possuam curiosidade, abertura, atitude digital e que faça acontecer com responsabilidade. Se identificou? Não perca a oportunidade de se inscrever em nosso banco de talentos!&nbsp;Informações adicionaisVeja o que ofereceremos* para você:Na Vivo não medimos esforços em apoiar e valorizar nossos colaboradores. Não são apenas excelentes benefícios, mas também flexíveis.• Escolher o benefício ideal para você e seus dependentes, numa plataforma digital com diversas categorias de Academia, VR, VA, Auxílio Farmácia, Assistência Médica, Odontológica e Seguro de Vida;• Celular corporativo. Sim, um smartphone novinho para você!• Plano de voz e Dados ilimitado! Sim ilimitado! Com a melhor rede móvel, ainda mais rápida com o 5G da Vivo!• Uma oferta exclusiva da Vivo, com desconto especial em linha fixa, banda larga, TV e apps;• Terá direito a receber Bônus ou PPR anual;• Planejará seu futuro através do plano de Previdência Privada;• Tem filhos? Terá direito a um subsídio para ajudar nas despesas com escola, creche ou babá;• Viver em um ambiente que respeitará sua personalidade, seu estilo de se vestir, seu jeito de ser e poderá ser autêntico. #VemdeVocê• Trabalhar remotamente até 3 vezes por semana. #Mobility• Ter flexibilidade de horário;• Aproveitar um dia de folga (Day off) para comemorar seu aniversário;• Participar de um dos maiores programas de voluntariado corporativo para você transformar o mundo;• Usufruir do nosso Programa de Desenvolvimento Educacional que oferece parcerias em instituições de ensino com desconto; certificações e cursos online.• Potencializar sua carreira por meio do nosso Programa de Recrutamento Interno, no Brasil ou fora, afinal estamos presentes em mais de 17 países! #VivoMinhaCarreira• Contar com uma série de iniciativas para melhorar a sua saúde física, emocional e social! Por aqui, temos o #VivoBemEstar, que estimula o nosso time a ter hábitos saudáveis e mais qualidade de vida! Disponibilizados aos nossos colaboradores consultas com nutricionista, psicólogos, serviço social, telemedicina, e muito mais!#VempraVivoTodas as nossas vagas são elegíveis a pessoas com deficiência e/ou reabilitados. Temos uma cultura que valoriza a diversidade, as diferenças e o potencial das pessoa",
            "careerPageId": 31162,
            "careerPageName": "Vivo Diversidade",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/316/career/31162/images/2021-10-18_18-31_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2023-08-01T18:55:14.794Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://vivodiversidade.gupy.io/job/eyJqb2JJZCI6NTIyNjI5OSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "on-site",
            "careerPageUrl": "https://vivodiversidade.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 5032281,
            "companyId": 40133,
            "name": "Desenvolvedor – Visual Data Flex SR",
            "description": "Vaga: 16521 Desenvolvedor – Visual Data Flex SRHome OfficePJ - indeterminadoDesenvolver e manter aplicativos usando a linguagem Visual Data Flex.Colaborar com a equipe de desenvolvimento para projetar e implementar soluções eficientes.Participar de reuniões de equipe para discutir requisitos, progresso e questões técnicas.Realizar testes de unidade e depuração de código para garantir a qualidade do software.Documentar o código e os processos relacionados ao desenvolvimento.Fornecer suporte técnico e solucionar problemas em relação aos aplicativos desenvolvidos.Inglês avançadoAo inserir os seus Dados no formulário para cadastro você confere pleno consentimento ao tratamento de dados pessoais nos termos da nossa&nbsp;Política de Privacidade https://www.taking.com.br/politica-de-privacidade/",
            "careerPageId": 91359,
            "careerPageName": "Taking",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/40133/career/91359/images/2022-08-22_12-31_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2023-06-21T16:44:39.757Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://taking-people&91359&inactive.gupy.io/job/eyJqb2JJZCI6NTAzMjI4MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": ""
        },
        {
            "id": 4883309,
            "companyId": 2022,
            "name": "OCA | Ingeniero de Datos - Datos&CRM",
            "description": "En OCA queremos ser la plataforma financiera más relevante de Uruguay y construir activamente al desarrollo de nuestra sociedad. Nos encontramos en la búsqueda de un Ingeniero de Datos para sumar al equipo de Datos &amp; CRM, chapter Capacidades &amp; Gobierno.&nbsp;Desafios:Ser referente dentro de nuestra comunidad de datos identificando, planeando y acompañando proyectos de ingeniería de dados, teniendo postura proactiva en proposición de conceptos adecuados a cada contexto de negocio y viabilidad de infraestructura. Tendrás como desafíos:&nbsp;•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Evolucionar el repositorio central de datos (Data Lake)•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Construcción y mantenimiento de pipelines de datos (ETL)•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Deploy de modelos•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Integración de servicios y herramientas•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Armado alertas y monitoreos•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Gobierno de DatosResponsabilidades e atribuições·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ser parte de una compañía líder y en constante crecimiento.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sumarte a una empresa en constante cambio.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un excelente clima de trabajo.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Aprender en un ambiente dinámico, donde podrás explotar tu potencial y tus ideas.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Trabajar en equipo, dispuesto a compartir experiencias y en búsqueda de nuevos desafíos.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un lugar para potenciar tus habilidades.·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ser protagonista de tu desarrollo, con oportunidades, aprendizaje, crecimiento&nbsp;y proyectos desafiantes.Requisitos e qualificações•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ganas de ser protagonista•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Capacidad analítica, orientada a resultados•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Profesional egresado de la carrera ingeniería en informática o similar•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Conocimiento técnico en: bases y modelos de datos, ambientes informáticos: NoSQL, SQL, dados no estructurados, Python, Spark•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Conocimiento y experiencia trabajando en ambientes cloud-based, de preferencia AWSTer ao menos 1 ano de Itaú UnibancoSer nível pleno, Sênior ou acimaAlinhar com sua liderança sua inscriçãoDisponibilidade de 6-9 meses fora do BrasilInformações adicionaisDesejável: Se valorará: certificaciones en AWS, arquitectura de datos y conocimientos en agilidad (Scrum, kanban, etc)",
            "careerPageId": 93202,
            "careerPageName": "International Experience ✈ ",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/2022/career/93202/images/2022-10-14_15-22_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-05-31T14:32:49.494Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "",
            "state": "",
            "country": "Uruguai",
            "jobUrl": "https://internationalexperienceitau.gupy.io/job/eyJqb2JJZCI6NDg4MzMwOSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://internationalexperienceitau.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 3703353,
            "companyId": 52573,
            "name": "Data Analytics - Analista de Desenvolvimento do Produto",
            "description": "O objetivo deste projeto é a análise e visualização de medições de sinais aquisitados em veículos de teste, dentro de um sistema específico para tal finalidade. Os dados são adquiridos de uma variedade de fontes dentro da rede de comunicação, por exemplo, CAN BUS, Ethernet, GPS, etc. Algoritmos devem ser desenvolvidos, para auxiliar na melhor disponibilização e análise desses dados.Responsabilidades e atribuiçõesDefinir o escopo de análise a ser processado durante o período de desenvolvimento e implementação;Elaborar as condições de aceitação para os volumes de análise individuais, na forma de critérios de aceitação e casos de teste;Determinar os requisitos necessários para a implementação do escopo de análise.Requisitos e qualificaçõesFormação em Engenharia Elétrica, Engenharia Mecatrônica ou Ciência da ComputaçãoIdioma: Inglês avançadoProgramação: Conhecimentos em Python e/ou Java são essenciais (programação orientada a objetos), XML e SQL são diferenciaisInteresse no ramo automotivo e novas tecnologias sendo desenvolvidas no mesmoConhecimentos em análise de dados de séries temporais, visualização estatística e análise descritiva é um diferencialInformações adicionaisO que a IAV oferece:Contrato CLT;HorárioFlexível;Vale Refeição; Combustível ou vale transporte;PLR;Incentivo para cursos: idiomas e especializações;Seguro devida e&nbsp;Saúde e Odontológico;Parcerias com Universidades e Escolas de Idiomas",
            "careerPageId": 109801,
            "careerPageName": "Carreiras - IAV",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/52573/career/109801/images/2022-11-04_13-19_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2022-12-15T22:12:44.645Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://iav.gupy.io/job/eyJqb2JJZCI6MzcwMzM1Mywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://iav.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 3142249,
            "companyId": 12808,
            "name": "Banco de Talentos Data Science | Afirmativa para pessoas Pretas, Pardas e Indígenas",
            "description": "Você já se imaginou trabalhar numa empresa com o propósito de transformar o mercado?Aqui você Quod!Somos uma empresa de inteligência de dados e nascemos para transformar positivamente a vida das pessoas e das empresas esse é o nosso jeito,&nbsp;o “jeito q” de mudar o mundo.Alinhado a um dos nossos Propósitos, onde&nbsp;Dados são pessoas&nbsp;queremos ampliar nossa diversidade com vagas exclusivas.Faça parte do nosso time!&nbsp;#VemPraQuodRequisitos e qualificaçõesSuperior completo em estatística, matemática ou engenharias.Conhecimento em linguagem de programação R, SQL, Python , ETL.Vontade de se desenvolver no time de dados.",
            "careerPageId": 30700,
            "careerPageName": "Quod",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/12808/career/30700/images/2024-06-20_09-48_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2022-11-07T13:51:35.258Z",
            "applicationDeadline": "2026-02-28T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "Barueri",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://vempraquod.gupy.io/job/eyJqb2JJZCI6MzE0MjI0OSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://vempraquod.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 12
    }
}