{
    "data": [
        {
            "id": 9186882,
            "companyId": 50527,
            "name": "Banco de Talentos | Desenvolvedor Fullstack Sênior (Node/React)",
            "description": "A FCamara é uma consultoria de tecnologia que atua em diversos segmentos do mercado, como varejo, saúde, financeiro, mobilidade, entre outros. Trabalhamos lado a lado com grandes empresas, desenvolvendo soluções inovadoras e impulsionando a transformação digital.Estamos em constante expansão e, por isso, mantemos nosso Banco de Talentos sempre aberto para profissionais de destaque!No momento, estamos recebendo currículos para oportunidades de Desenvolvedor(a) Fullstack Sênior, com foco em Node JS e React JS Temos diversas vagas disponíveis neste perfil, e ao se cadastrar, seu currículo será analisado com prioridade para estas posições.Responsabilidades e atribuiçõesAtuar de forma colaborativa com times multidisciplinares, promovendo uma comunicação clara, empática e eficiente entre áreas de produto, design e engenharia.Liderar tecnicamente projetos de backend, apoiando decisões estratégicas e compartilhando conhecimento com desenvolvedores menos experientes.Ser protagonista na identificação e resolução de problemas, com postura proativa e foco em soluções sustentáveis.Demonstrar responsabilidade e autonomia na gestão de demandas, prazos e prioridades, contribuindo para o bom andamento do time.Participar ativamente de cerimônias ágeis (Daily, Planning, Review, Retrospective), com mindset voltado à melhoria contínua e ao trabalho em equipe.Manter uma postura aberta a feedbacks e à evolução constante, incentivando a cultura de aprendizado dentro do time.Requisitos e qualificaçõesExperiência sólida com Node.js no desenvolvimento de aplicações backend, utilizando frameworks como Express.js, NestJS ou equivalentes.Forte domínio em React.js para desenvolvimento frontend, com conhecimento em hooks, contexto, roteamento e componentização escalável.Conhecimento em TypeScript no backend e frontend.Experiência na construção e consumo de APIs RESTfulVivência com testes automatizados, utilizando ferramentas como Jest, React Testing Library, Mocha, entre outras.Experiência com bancos de dados relacionais (PostgreSQL, MySQL) e não relacionais (MongoDB, Redis).Conhecimento em controle de estado no frontend (ex: Redux, Zustand, Recoil) e gerenciamento de side effects.Experiência com CI/CD, containers com Docker e boas práticas de versionamento (Git).Conhecimento de ambientes cloud (preferencialmente AWS) e integração com serviços como S3, Lambda, API Gateway, etc.Familiaridade com ferramentas de APM (Application Performance Monitoring) como Datadog, New Relic, Elastic APM, Sentry ou similares.Noções de UX/UI e boas práticas de acessibilidade (a11y) são diferenciais.",
            "careerPageId": 117226,
            "careerPageName": "VENHA SER #SANGUELARANJA 🧡🚀",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/50527/career/117226/images/2022-12-05_17-18_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-19T13:56:56.407Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://fcamara.gupy.io/job/eyJqb2JJZCI6OTE4Njg4Miwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://fcamara.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9141271,
            "companyId": 24820,
            "name": "Banco de Talentos | Desenvolvedor Fullstack PHP Angular Pleno",
            "description": "Não encontrou uma vaga para Desenvolvedor Fullstack PHP Angular Pleno?Não se preocupe! Cadastre seu currículo em nosso Banco de Talentos, pois surgindo oportunidades, serão priorizados os candidatos inscritos no banco de talentos.Nossas vagas para Desenvolvedores Fullstack PHP Angular Pleno tem como objetivo desenvolver uma nova plataforma LMS (Learning Management System), utilizando framework laravel e outras tecnologias open source.Procuramos parceiros que estejam sempre conectados com as novas tendências e consigam transpor o melhor de nossa cultura para os produtos produzidos e consequentemente para nosso cliente final.Somos uma empresa que surgiu e ama Educação, criamos soluções inclusivas para o nosso principal público que são coordenadores, professores, alunos e colaboradores de instituições de ensino que utilizam o pacote Google Workspace como parte de sua transformação acadêmica.Prestação de serviço home-office.Nosso modelo de contratação é por Pessoa Jurídica.Responsabilidades e atribuiçõesResponsabilidades e atribuições:&nbsp;Auxiliar na arquitetura durante o desenvolvimento de novas funcionalidades.Desenvolver novas interfaces para nossos produtos.Realizar melhorias e correções de sistemas já existentes.Manter os sistemas funcionando com uma alta taxa de qualidade.Otimizar as aplicações para garantir uma boa usabilidade.Realizar manutenções em nossos bancos de dados.Auxiliar o restante da equipe durante a resolução de problemas.Escrever testes automatizados.Documentar todo o código desenvolvido.Manter os produtos atualizados e utilizando as últimas tendências do mercado.Requisitos e qualificaçõesRequisitos e qualificações:&nbsp;Conhecimento de GIT;Experiência com o framework Laravel;Angular 2+;HTML;CSS;Less;Experiência com o desenvolvimento utilizando PHP;Conhecimento das APIs do Google;Conhecimento das ferramentas Google Workspace;Conhecimento das ferramentas Google Cloud;Testes automatizados;Banco de dados (SQL e NoSQL);Experiência Github/Gitlab;Gitlab;Inglês técnico;Experiência em CI/CD;Experiência na manutenção de clusters Kubernetes;Facilidade para trabalhar em equipe;TDD; eDocker.Diferencial:Ter atuado no desenvolvimento de projetos com PHP (Laravel / PHP) e Angular (Angular 2+) por pelo menos 2 anos;Ter atuado no desenvolvimento de projetos envolvendo a construção do banco de dados;Ter bom conhecimento em bancos de dados relacionais;Ter boa lógica na realização de troubleshooting;Já ter participado da estrututação de um novo sistema ou novos módulos; eConhecimento em integrações com APIs.﻿﻿Restrição:&nbsp;não trabalhar para empresa concorrente.Informações adicionaisHabilidades comportamentais:Tenha iniciativa e busque soluções;Tenha capacidade de resolução de problemas;Tenha comprometimento;Tenha uma boa comunicação;Seja criativo;Tenha agilidade;Seja adaptável;Tenha autonomia;Tenha foco e atenção; eTenha mentalidade de crescimento.Equipamentos necessários:Possuir computador ou notebook, Intel Core i5 ou superior, compatível a 8GB de memória RAM (livres);Computador com Sistema Operacional Linux (preferencialmente), Mac ou Windows;Internet deverá ser fixa, com velocidade mínima de 30Mb;Uma mesa e uma cadeira padrão de escritório;Se você optar pelo uso do Notebook importante ter um suporte e um teclado para que ele fique na direção de seus olhos;Crie o seu espaço de trabalho, orientamos sempre escolher aquele espaço sem ruídos e barulhos;Webcam Full HD; eHeadset para vídeo conferência.",
            "careerPageId": 54823,
            "careerPageName": "Inicie",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/24820/career/54823/images/2024-01-04_14-13_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-12T18:53:30.013Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://inicie.gupy.io/job/eyJqb2JJZCI6OTE0MTI3MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://inicie.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 7454617,
            "companyId": 52408,
            "name": "Engenheiro de Software SR Fullstack Java/Angular | Engenharia",
            "description": "Muito prazer, Somos a Evertec + Sinqia! 🧡Diariamente, processamos bilhões de transações através dos nossos produtos, impactando diretamente a vida de muitos brasileiros. Fomos eleitos uma das melhores empresas para se trabalhar com certificado GPTW e estamos entre as 100 maiores Fintechs do mundo.Nossos colaboradores são Makers, criam soluções relevantes, são Smart, transmitem conhecimento com inteligência e de forma Leve, prezando pelo carisma ao agir e se comunicar.Responsabilidades e atribuiçõesA área de Engenharia Fundos na Evertec + Sinqia é responsável por fazer a manutenção e desenvolvimento do software da companhia da área de Fundos, Busca um(a) Engenheiro de Software SR com foco em Java para compor nosso time, na maior empresa de desenvolvimento de softwares e produtos para o mercado financeiro do Brasil, onde acreditamos que a inovação tecnológica inspira a evolução.Esse cargo é responsável por:• Desenvolvimento em Java;• Teste de Unidade;• Teste de Integração;• Interagir com o time e POs.Requisitos e qualificaçõesPara dar #match, essa vaga necessita que atenda alguns requisitos obrigatórios:• Experiência com Java 8;• SQL - bancos de dados da ORACLE e SQL SERVER;• GIT;• Experiência com Angular;• Experiência com manipulação de arquivos XML - e demais formatos de arquivo texto csv, txt;• Atuação com JasperReport / JasperSoft;• Conhecimento em ActiveMQ (Filas) e WebService (REST, SOAP).&nbsp;Caso possua o conhecimento ou atuação abaixo, será um diferencial:• Conhecimento em Metodologia Ágil;• Conhecimento com o mercado financeiro (Fundos de investimento).&nbsp;📌IMPORTANTE: Essa oportunidade é para atuação no escritório da Sinqia São Paulo/SP, modalidade Hibrido. 😉Informações adicionais🏅&nbsp;E ai, se identificou com o que leu até agora? Então, vou te contar o que você encontrará aqui, além de um ambiente dinâmico;• Vale refeição ou alimentação;• Assistência médica;• Assistência Odontológica• Auxílio creche;• Benefícios Flexíveis (Flash);• Vale transporte;• Gympass e TotalPass;• Horários flexíveis;• Seguro de vida;• Clube de parcerias;• Just dress no code (sem código de vestimenta!),• Day off no aniversário.&nbsp;♿️🌈🙋🏾👴🏻Na Sinqia valorizamos a diversidade e entendemos que o que acrescenta é justamente ideias e pontos de vistas variados. Por isso raça, cor, religião, gênero e identidade de gênero, nacionalidade, deficiência, orientação sexual, ascendência ou idade, não serão impeditivos de você fazer parte do nosso time.✔Saiba mais sobre a Sinqia em:&nbsp;www.sinqia.com.br&nbsp;e siga os nossos perfis nas redes sociais.",
            "careerPageId": 110100,
            "careerPageName": "Evertec Brasil",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/52408/career/110100/images/2024-09-06_14-27_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2024-07-12T14:17:10.687Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://sinqia.gupy.io/job/eyJqb2JJZCI6NzQ1NDYxNywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://sinqia.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 6864428,
            "companyId": 40368,
            "name": "Desenvolvedor FullStack ",
            "description": "Oportunidade surgindo na Koode Tecnologia para Desenvolvedor Fullstack.&nbsp;Como um profissional Koode, em um mundo em transformação e inovação constante, entendemos a importância de apresentar as melhores estratégias de ação para que nossos clientes alcancem os melhores resultados.Para isso, buscamos por um profissional com ampla experiência e que tenha habilidade para entender uma demanda, definir e executar.&nbsp;Se você gosta de desafios e se identifica com a gente, inscreva-se!Responsabilidades e atribuiçõesPrincipais Atividades:Desenvolvimento de Aplicações: Desenvolver e manter aplicações utilizando tecnologias como ASP.NET, Web Forms, .NET Core, REST, Javascript, AJAX, JQuery, HTML, CSS e C#.Conhecimento em Banco de Dados SQL Server, Transact e Modelagem;Single Page Application – SPA: Ter trabalhado com algum framework Javascript como ReactJS ou Angular.Colaboração em Projetos Scrum: Participar ativamente de projeto Scrum, contribuindo em reuniões e seguindo práticas ágeis.Implementação e Otimização de Store Procedures: Criar e otimizar store procedures em banco de dados, preferencialmente utilizando SQL Server.Controle de Versão com Azure DevOps: Utilizar Azure DevOps para controle de versão, integração contínua e entrega contínua.me;&nbsp;Requisitos e qualificaçõesRequisito Técnico:&nbsp;C# (.net Framework e .net Core),&nbsp;Aplicações Web MVC e Forms, HTML/CSS/JS (JavaScript) Bootstrap, SQL, Azure Devops&nbsp;&nbsp;Qualificação:Excelentes habilidades em comunicação (oratória e escrita) para entender a demanda e orientar o time para a idealização de novas soluções.Diferencial:Conhecimento Básico em Cloud com mais proficiência em Azure: Possuir conhecimentos básicos em recursos Azure para oferecer suporte a ambientes de nuvem.Segurança: Possuir conhecimentos básicos de segurança de aplicações, desenvolvimento seguro e alguns protocolos de segurança como JWT, oAuth e OpenConnectID para processos de autorização e autenticação.&nbsp;Design Patterns: Conhecimento de patterns padrões de mercado como Producer/ Consumer e Async/Await Task-based Asynchronous Pattern (TAP).Relatórios: Possuir conhecimento de Crystal Reports.Informações adicionaisModelo de contratação: PJModelo de trabalho: HíbridoPLRPrograma Livre Escolha - Reembolso de R$ 450,00, a cada 3 meses. (Pode ser usado para saúde, educação, tecnologias, entre outros)",
            "careerPageId": 164625,
            "careerPageName": "Koode",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/40368/career/164625/images/2023-09-28_19-30_companyLogoUrl.jpg",
            "type": "vacancy_legal_entity",
            "publishedDate": "2024-03-12T15:33:56.667Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://koode.gupy.io/job/eyJqb2JJZCI6Njg2NDQyOCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://koode.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 4823097,
            "companyId": 40133,
            "name": "Desenvolvedor Fullstack PHP c/ Angular",
            "description": "Desenvolvedor Fullstack PHP c/ Angular - REF: 16245Descrição:Ficará responsável por evoluir as telas do cellcard tanto na perspectiva de Backend e Frontend (PHP 5.3, MySQL 5.6, HTML/AngularJS 1.6)Perfil de analista é fundamental para:Entendimento de como funciona a governança de perfis no cellcardEntrevista com usuários sêniors do cellcardNão PODE depender da área de produtos definir o que querCriar sugestões de melhoria na perspectiva de segurança e fraudeModalidade: PJ. (Determinado 7 meses, com possibilidade de prorrogação).Local: Home Office.Ao enviar seu currículo você confere&nbsp;pleno consentimento ao tratamento de dados pessoais nos termos da nossa&nbsp;Política de Privacidade&nbsp;https://www.taking.com.br/politica-de-privacidade/",
            "careerPageId": 91359,
            "careerPageName": "Taking",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/40133/career/91359/images/2022-08-22_12-31_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2023-05-18T18:44:40.093Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Belo Horizonte",
            "state": "Minas Gerais",
            "country": "Brasil",
            "jobUrl": "https://taking-people&91359&inactive.gupy.io/job/eyJqb2JJZCI6NDgyMzA5Nywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": ""
        },
        {
            "id": 4758905,
            "companyId": 258,
            "name": "ICLINIC | Pessoa Engenheira de Software Fullstack Sênior",
            "description": "Somos o futuro da Saúde e Educação!&nbsp;&nbsp;&nbsp;A Afya é o maior ecossistema de educação em saúde e healthtechs do Brasil. Nascemos do sonho de democratizar o acesso à saúde a todas as pessoas do país.&nbsp;&nbsp;Acompanhamos os profissionais de saúde em toda a sua jornada. Somos o único grupo do país parceiro de longo prazo do médico, com entrega de valor em todas as etapas acadêmicas, no exercício da profissão e no seu relacionamento com o mercado de saúde.&nbsp;&nbsp;Nosso propósito é revolucionar o jeito de ensinar, aprender e aplicar a medicina para formar os melhores profissionais médicos em todas as fases de sua trajetória, combinando educação e saúde para potencializar a formação, atualização, assertividade e produtividade.&nbsp;&nbsp;Queremos nos tornar referência na jornada médica, capacitando nossos clientes para transformarem seus sonhos em experiências extraordinárias ao longo da vida.&nbsp;&nbsp;&nbsp;Desde a nossa existência, apoiamos milhares de vidas, impactando positivamente ponta a ponta do clico médico e ajudando a transformar a saúde no Brasil. 🚀&nbsp;&nbsp;&nbsp;🔎 SOBRE O PRODUTO: &nbsp;A iClinic é líder de mercado em soluções online para gestão de clínicas e consultórios. Principais funções: AGENDA MÉDICAPRONTUÁRIO ELETRÔNICO​MARKETING MÉDICOGESTÃO FINANCEIRATELECONSULTAAGENDAMENTO ONLINE​&nbsp;♿ Todas as nossas oportunidades são extensivas à pessoas com deficiência e reabilitadas do INSS.&nbsp;Responsabilidades e atribuições💻🩺 Como será seu dia-dia? &nbsp;(colocar as responsabilidades da função, em bullet points, sempre começando com o verbo no infinitivo: Garantir, Definir, Propor, Desenhar, Acompanhar, etc.)&nbsp;Exemplo:&nbsp;&nbsp;Definir a estratégia de lançamentos e expansão de produtos, garantindo o alinhamento com liderança e stakeholders;&nbsp;Propor e executar testes rápidos para validar hipóteses e coletar dados;&nbsp;Traçar roadmap e as dependências associadas ao processo de expansão, envolvendo times multidisciplinares em cada etapa do planejamento;&nbsp;Garantir que a estratégia e o roadmap sejam comunicados para toda a empresa, de forma recorrente e transparente, para garantir alinhamento com os objetivos da companhia;&nbsp;Definir e acompanhar os KPIs medidores de sucesso.Requisitos e qualificações🔎 Buscamos as seguintes Skills (mas não esperamos que uma única pessoa possua todos eles):&nbsp;&nbsp;Exemplo:&nbsp;&nbsp;Ensino Superior Completo;&nbsp;Experiência na construção de produtos digitais da etapa de delivery ao discovery;&nbsp;Experiência em análise de dados, criação de hipóteses e construção de critérios de satisfação para experimentos;&nbsp;Familiaridade com agile, lean e MVPs;&nbsp;Forte habilidade de influenciar, engajar e resolver conflitos de forma construtiva.&nbsp;Vivência prévia em startups ou na área de saúde;&nbsp;Saber se comunicar de forma eficaz em Inglês e/ou Espanhol.&nbsp;Informações adicionaisAlém de transformar a saúde no Brasil, você ganha uma lista de benefícios:&nbsp;&nbsp;🌞Para o dia a dia:&nbsp;&nbsp;&nbsp;Vale alimentação / refeição;&nbsp;&nbsp;Flexibilidade de horários e locações (para vagas remotas);&nbsp;&nbsp;Vale Transporte&nbsp;(para vagas Hibridas ou Presencial)&nbsp;💰UP na remuneração:&nbsp;&nbsp;PLR;&nbsp;&nbsp;&nbsp;Tech Coins (Créditos via Cartão Flash que pode ser utilizado como quiser);&nbsp;&nbsp;👩‍👩‍👧‍👦Família, Saúde e Bem-estar:&nbsp;&nbsp;Gympass;&nbsp;&nbsp;Assistência Médica e Odontológica;&nbsp;&nbsp;Seguro de Vida;&nbsp;&nbsp;Day Off de Aniversário (Um dia de folga para tirar no dia ou durante o mês do seu aniversário.);&nbsp;&nbsp;📖Desenvolvimento e Aprendizado:&nbsp;&nbsp;Plataformas com +40 Cursos voltados para o nicho de negócio (UCA)&nbsp;&nbsp;&nbsp;Academia de idiomas (AIA).&nbsp;",
            "careerPageId": 643,
            "careerPageName": "Afya ",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/258/career/643/images/2021-01-05_20-39_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-05-02T20:57:43.022Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Ribeirão Preto",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://afya.gupy.io/job/eyJqb2JJZCI6NDc1ODkwNSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "careerPageUrl": "https://afya.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 4093798,
            "companyId": 52441,
            "name": "Banco de Talentos WK Technology -  Fullstack C#",
            "description": "Banco de Talentos Desenvolvedor C#.A WK Technology, está vivendo um momento muito importante de crescimento e expansão, e por isso criamos esse banco de talentos para profissionais Desenvolvedores em Delphi, ainda não temos essa vaga, mas logo surgirá a oportunidade e entraremos em contato pra dar continuidade e finalizar o processo seletivo.A WK Technology, é uma Empresa inovadora que está em crescimento e tem como base a qualidade com seus serviços e seus parceiros.Faz parte do nosso DNA:Acolhimento com empatia e respeito aos nossos colaboradores e parceiros;Perseverança, porque não desistimos até alcançar nossos objetivos;Qualificação, valorizamos o conhecimento e aprendizado continuo;Versatilidade, adaptamos de maneira ágil as mudanças, atento ao cenário presente e o futuro;Visionário, adeptos a inovação, aqui boas ideias são ouvidas e bem-vindas.Responsabilidades e atribuiçõesDar sustentação e desenvolvimento de novas funcionalidade em um ERPRequisitos e qualificaçõesPara o bom desempenho da função é importante que você tenha:Fundamento sólido em POOForte conhecimento em SOLIDPadrões Gof(Mediator, Command, factory)Clean Code.Net5NUnitWeb Api RestConhecimento de DDDGitJavascript, CSS, Bootstrap, HTMLAngular 2 ou Vue.JS ou React.JS ou Asp.NetExperiência de desenvolvimento de micro serviçosExperiência de trabalho com banco de dados relacionalSerá diferencial se você tiver experiência com:NoSqlTeste unitário e Teste de integraçãoNoções Básicas de Azure DevOpsInformações adicionaisBenefícios:💵 Remuneração: A COMBINAR📝 Contratação: Pessoa Jurídica🏠 Local de Trabalho: Home Office📈 Avaliação de Desempenho: A cada 6 meses, podendo elevar a remuneração;⏳ Carga horária: 160 horas/mês horário comercial📆 Disponibilidade de Início: Imediato👨‍💼 Renda Extra: Possibilidade de complemento com projetos extras👨‍💻 Cursos: Pagos 100% pela empresa (graduação ou pós graduação)",
            "careerPageId": 103300,
            "careerPageName": "WK Technology",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/52441/career/103300/images/2022-10-06_12-05_logo.jpg",
            "type": "vacancy_legal_entity",
            "publishedDate": "2023-02-15T16:58:45.904Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://wktechnology&103300&inactive.gupy.io/job/eyJqb2JJZCI6NDA5Mzc5OCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": ""
        },
        {
            "id": 4099023,
            "companyId": 52441,
            "name": "Banco de Talentos WK Technology -  Fullstack PHP - ANGULAR",
            "description": "Banco de Talentos WK Technology - Desenvolvedor PHP - ANGULAR.A WK Technology, está vivendo um momento muito importante de crescimento e expansão, e por isso criamos esse banco de talentos para profissionais Desenvolvedores em PHP/Angular, ainda não temos essa vaga, mas logo surgirá a oportunidade e entraremos em contato pra dar continuidade e finalizar o processo seletivo.A WK Technology, é uma Empresa inovadora que está em crescimento e tem como base a qualidade com seus serviços e seus parceiros.Faz parte do nosso DNA:Acolhimento com empatia e respeito aos nossos colaboradores e parceiros;Perseverança, porque não desistimos até alcançar nossos objetivos;Qualificação, valorizamos o conhecimento e aprendizado continuo;Versatilidade, adaptamos de maneira ágil as mudanças, atento ao cenário presente e o futuro;Visionário, adeptos a inovação, aqui boas ideias são ouvidas e bem-vindas.Responsabilidades e atribuiçõesAtuar no desenvolvimento de diversos projetos.Requisitos e qualificaçõesPara o bom desempenho do seu trabalho é importante que você tenha:Experiência em PHP (Laravel ou Lumen)Experiência com Angular e TypeScriptExperiência com HTML5, CSS, Styled-components, Single File ComponentsConsumo de API Restful e manipulação de dadosExperiência com aplicações multiplataforma, PWA e micro front-endsSerá um diferencial:Source control e branches (GIT)Outras linguagens ou frameworks (Node, React, React Native,&nbsp;Vue.JS)Experiência com análise de sistemasCriação de arquitetura de sistemasInformações adicionaisBenefícios:💵 Remuneração: A COMBINAR📝 Contratação: Pessoa Jurídica🏠 Local de Trabalho: Home Office📈 Avaliação de Desempenho: A cada 6 meses, podendo elevar a remuneração;⏳ Carga horária: 160 horas/mês horário comercial📆 Disponibilidade de Início: Imediato👨‍💻 Cursos: Pagos 100% pela empresa (graduação ou pós graduação)",
            "careerPageId": 103300,
            "careerPageName": "WK Technology",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/52441/career/103300/images/2022-10-06_12-05_logo.jpg",
            "type": "vacancy_legal_entity",
            "publishedDate": "2023-02-15T16:42:03.341Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://wktechnology&103300&inactive.gupy.io/job/eyJqb2JJZCI6NDA5OTAyMywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": ""
        },
        {
            "id": 1583381,
            "companyId": 12083,
            "name": "Desenvolvedor Fullstack ",
            "description": "Sobre o seu papel:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Você trabalhará com todas as partes do desenvolvimento de uma aplicação no Front-End&nbsp;e no Back-End.&nbsp;&nbsp;Responsabilidades e atribuições&nbsp;O que você fará:&nbsp;Desenvolverá sistemas web responsivos&nbsp;e também&nbsp;aplicativos;&nbsp;Criará&nbsp;e&nbsp;fará a&nbsp;manutenção de banco de dados;&nbsp;Utilizará linguagem de programação e ferramentas de desenvolvimento, infraestrutura, cloud,&nbsp;devops, apps e mobile.&nbsp;Requisitos e qualificaçõesExperiência necessária:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Formação em TI, desenvolvimento e áreas dentro da tecnologia;&nbsp;Boa lógica de programação&nbsp;com conhecimento em&nbsp;linguagem PHP, HTML, CSS e JS;&nbsp;Conhecimento em SQL&nbsp;e&nbsp;desenvolvimento de testes unitários;&nbsp;Abertura em receber/dar feedbacks/sugestões.&nbsp;",
            "careerPageId": 26575,
            "careerPageName": "meufluxo.com",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/12083/career/26575/images/2021-09-10_19-02_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2022-03-10T11:21:06.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Caxias do Sul",
            "state": "Rio Grande do Sul",
            "country": "Brasil",
            "jobUrl": "https://meufluxo.gupy.io/job/eyJqb2JJZCI6MTU4MzM4MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "careerPageUrl": "https://meufluxo.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 9
    }
}