{
    "data": [
        {
            "id": 8502926,
            "companyId": 26272,
            "name": "Banco de Talentos - Trainee Desenvolvedor Full Stack",
            "description": "Seu futuro começa agora com o Programa Trainee da Wise&nbsp;Olá, futuro Wiser! Se você está buscando uma oportunidade para iniciar sua carreira em Desenvolvimento de Software, chegou ao lugar certo. O Programa Trainee da Wise foi criado para ajudar novos talentos a darem seus primeiros passos profissionais, enquanto identificamos aqueles com potencial para se destacar em nossa equipe.&nbsp;Oportunidade para quem quer fazer a diferença&nbsp;De 2 a 3 vezes ao ano, oferecemos 20 vagas para pessoas que desejam aprender, crescer e colocar a mão na massa. Durante o programa, você terá acesso a conteúdo teórico de alta qualidade por meio de uma plataforma de ensino, além de participar de sessões de tutoria com nossos profissionais, que estarão ao seu lado para orientar, tirar dúvidas e ajudar a transformar conhecimento em prática.&nbsp;Nosso objetivo? Preparar você para atuar na Wise e no mercado como um todo, enfrentando desafios que simulam situações reais do dia a dia de um desenvolvedor.&nbsp;Responsabilidades e atribuiçõesO que valorizamos?&nbsp;Buscamos jovens talentos que demonstrem:&nbsp;Criatividade&nbsp;Foco em resultados&nbsp;Capacidade de solucionar problemas&nbsp;Proatividade&nbsp;Habilidade de trabalhar em equipe&nbsp;Como funciona o programa?&nbsp;O Programa Trainee tem duração de 2 meses. Ao final, você aplicará tudo que aprendeu no desenvolvimento de um projeto, que será apresentado para os gestores da Wise. O tema é sugerido, mas você terá liberdade para explorar soluções criativas e utilizar diferentes tecnologias, desde que atendam ao desafio proposto.&nbsp;Com base no seu desempenho e na qualidade do projeto, nossos gestores avaliarão sua prontidão para integrar nossa equipe de desenvolvimento. Se for identificado como um talento em potencial, mas ainda não estiver completamente preparado, há a possibilidade de atuação em outras áreas da empresa até que você esteja pronto para dar o próximo passo em sua carreira.&nbsp;Etapas do processo seletivo&nbsp;Inscrição: Analisaremos seu perfil considerando currículo, cursos realizados, conhecimento prévio em tecnologia, experiência internacional e fluência em idiomas.&nbsp;Entrevista (RH e instrutor do programa): Avaliaremos seu engajamento, conhecimento sobre a Wise e o mercado, além de suas futuras responsabilidades.&nbsp;Mãos à obra: Ao final do programa, você desenvolverá um projeto que poderá ser sua porta de entrada para a equipe Wise.&nbsp;Quem pode ser trainee?&nbsp;Não importa se você já tem graduação, pós-graduação ou curso técnico. O que conta para nós é sua vontade de aprender, conhecimento prévio e desejo de seguir carreira em tecnologia. Ah, e aqui na Wise, idade não é um fator decisivo! Valorizamos o seu potencial como desenvolvedor reconhecendo que diferentes perspectivas fortalecem o nosso time.Por que ser trainee na Wise?&nbsp;Trabalhar na Wise: Ao final do programa, os selecionados já começarão como prestadores de serviço em nossas equipes, sem precisar passar por estágio.&nbsp;Desenvolvimento acelerado: Combinamos conhecimento teórico e prático, além de mentorias com nossos profissionais, garantindo que você aprenda com quem realmente entende do mercado.&nbsp;Mentoria especializada: Você terá um tutor dedicado a acompanhar seu progresso, orientar seus estudos e ajudar na superação de desafios.&nbsp;Requisitos e qualificaçõesPor que se inscrever?&nbsp;20 vagas exclusivas: São poucas oportunidades para muitos talentos. Aproveite essa chance!&nbsp;Mentoria e acompanhamento: Aprenda diretamente com os experts da Wise e aplique o conhecimento de forma prática e eficaz.&nbsp;Desenvolvimento acelerado: Em apenas 2 meses, você adquirirá habilidades essenciais para atuar como desenvolvedor, com a possibilidade de contratação ao final.&nbsp;Desafios reais: Coloque tudo o que aprendeu em prática, desenvolvendo um projeto real que será apresentado para nossos gestores.&nbsp;Está pronto para começar?&nbsp;Candidate-se para esta vaga e dê o primeiro passo para se tornar um desenvolvedor Wise. Esse é o momento de mostrar todo o seu potencial e se destacar em uma das empresas mais inovadoras do mercado de tecnologia!&nbsp;Informações adicionaisPara os candidatos selecionados no final do processo do Trainee, o que oferecemos?Trabalho Remoto, Híbrido ou Presencial em Curitiba/PRContratação PJ por tempo indeterminado&nbsp;Possibilidade de projeção de carreira&nbsp;Incentivos a CertificaçõesTreinamentos OnlineHorário flexívelNo Dress Code",
            "careerPageId": 57035,
            "careerPageName": "Wise Group",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/26272/career/57035/images/2022-05-19_16-58_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-01-21T18:38:29.821Z",
            "applicationDeadline": "2047-03-22T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://wises.gupy.io/job/eyJqb2JJZCI6ODUwMjkyNiwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://wises.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 4790255,
            "companyId": 40133,
            "name": "Java Full Stack Developer",
            "description": "Java Full Stack DeveloperHome Office (necessário idas esporádicas - Campinas)CLT + Benefícios&nbsp;** INGLÊS AVANÇADO**&nbsp;O que você vai fazer, e o que esperamos de você?A bordo de uma pequena equipe de desenvolvimento, apaixonada por qualidade e altos padrõesCriar soluções para frotas, para melhorar suas operações diárias e para que os caminhoneiros tenham um dia melhor na estradaContribuir para o projeto e a arquitetura de ambientes de software/armazenamento novos ou reprojetados, escrevendo especificações, diagramas, documentos e implementando-osUse vários chapéus, desempenhando um papel de desenvolvedor na maioria das vezes, mas também desempenhando os papéis de analista de QA, Arquiteto de Soluções ou mesmo Analista de Requisitos, se o objetivo do sprint exigir isso.&nbsp;Seja um pensador crítico que não tenha medo de questionar, sugerir novas funcionalidades, melhorias, ferramentas e processos para levar a equipe e o produto ao próximo nível.&nbsp;Qual é o histórico e a experiência que você precisa?Bacharel em Ciência da Computação, Engenharia de Software ou áreas afinsSólida experiência como desenvolvedor de software Java em framework ágilPensador analítico e habilidades lógicas sistemáticasInglês avançado ou fluente&nbsp;Habilidades técnicas e ferramentas sempre necessárias:&nbsp;Java 8 (em inglês)Programação orientada a objetosTestes unitáriosPadrões de projeto (SOLID, DDD ou Clean Architecture)&nbsp;MicrosserviçosREST-API'sBancos de dados SQL: Aurora / MySQL&nbsp;Banco de dados No-SQLFilas e fluxos de mensagensFront-end (TypeScript / AngularJS)&nbsp;Habilidades técnicas e ferramentas que também podem ser úteis:Docker / Kubernetes;&nbsp;Noções de observabilidade;&nbsp;Noções de serviços de nuvem da AWS;&nbsp;DevOps (noções de infraestrutura);Mobile (noções Android e iOS);&nbsp;Nossos olhos brilharão se você:&nbsp;Teve experiências anteriores com IoT ou dispositivos eletrônicos conectados à nuvem;Teve experiência anterior na criação de soluções nativas da nuvem (AWS, Azure, GCP);Divirta-se resolvendo problemas complexos e compartilhando conhecimento com colegas;&nbsp;Está constantemente atualizado em soluções, ferramentas e tendências de mercado relacionadas à segurança, desempenho e escalabilidade.",
            "careerPageId": 91359,
            "careerPageName": "Taking",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/40133/career/91359/images/2022-08-22_12-31_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2023-05-11T16:29:24.588Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Campinas",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://taking-people&91359&inactive.gupy.io/job/eyJqb2JJZCI6NDc5MDI1NSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": ""
        },
        {
            "id": 4121171,
            "companyId": 370,
            "name": "Full Stack Developer",
            "description": "The Volvo Group is one of the world’s leading manufacturers of trucks, buses, construction equipment and marine and industrial engines. The Group also provides complete solutions for financing and service. The Volvo Group, with its headquarters in Gothenburg, employs about 100,000 people, has production facilities in 18 countries and sells its products in more than 190 markets.Are you enthusiastic about pioneering new services and solutions utilizing digital technologies, insights based on data and working in diverse teams? Then Volvo Group Connected solutions in Latin America is the place for you to prosper. Welcome to our world!Volvo Group Connected Solutionsis a global organization that leads the development of Volvo’s connected services and solutions of tomorrow. We work at the forefront of connectivity by collecting and analyzing data from over 1 400 000 Volvo customer assets. The organization is set-up to deliver competitive offerings, shorten time to market and provide an arena for new service innovations together with customers, partners and the Volvo Group.Responsabilidades e atribuiçõesTHE POSITIONWe are now looking for a Full Stack Developer with power ful base in serverless tech stack to jo in our team. You will join a small and diverse team of pioneers taking a new service idea towards a commercial solution. Your team will act very Much like a small venture with in the company and your activities will range from designing &amp; building the new service as well as testing and maintaining the application.Requisitos e qualificaçõesYou like to have a holistic view when working on software development.&nbsp;You enjoy and have knowledge in both Front-end (React OR Angular) and Back-end development (Lambda, Typescript) with a specialization in Back end.&nbsp;For Backend specialists, additional knowledge in Java/Spring is necessary.&nbsp;You have also worked as part of a DevOps team developing, configuring, and maintaining solution son AWS.&nbsp;You have University Degree in Computer Science, Software Engineering or similar.WHO ARE YOU?As a person you are passionate about creating new smart services and ready to contribute with new ideas powered by your interest in new developments and technologies?You have an open mindset, a willingness to explore, a problem solving attitude, resource fulness and adaptability?If you want to be part of a team where digital technologies solve end-user needs in a creative environment - come and join us!Informações adicionaisFazem também do seu pacote de contratação os seguintes benefícios:​&nbsp;Plano de previdência privada, operacionalizado pela&nbsp;Vikingprev;​Assistência médica, administrada pela Volvo (Planos VOAM para&nbsp;Curitiba/Região Metropolitana, AMIL para demais localidades) (*1) (consulte&nbsp;www.voam.com.br);​Assistência odontológica – VOAM, em rede credenciada (*1);​Auxílio-farmácia (70% de reembolso das despesas com medicamentos&nbsp;prescritos), nos termos e sujeito às alterações da política Volvo (*1);​Reembolso lentes, limitado anualmente, conforme tabela fornecida pela&nbsp;empresa (*1);​Sistema de transporte fretado para funcionários;​Estacionamentos privativos, sem custo;​Ticket alimentação, fornecido por intermédio de cartão, no valor mensal de R$&nbsp;1.100,00 (para&nbsp;VdB);​Refeitórios internos;&nbsp;Seguro de vida em grupo com cobertura de auxílio-funeral (*1);​Auxílio-doença (complementação ao&nbsp;benefício&nbsp;do INSS – 100% até 60 dias,&nbsp;90% até 365 dias).​Associação Viking,&nbsp;Gympass&nbsp;e Clube Gazeta (*1);​Para funcionárias mulheres: auxílio creche {O valor do auxílio creche para a VdB é de R$ 613,42 e para VCE é 584,21}Participação nos Lucros e&nbsp;Resultados, atrelada ao atingimento das metas e proporcional aos meses&nbsp;trabalhados. Essas são as condições do acordo coletivo, das definições globais do&nbsp;Grupo Volvo e das negociações sindicais.&nbsp;",
            "careerPageId": 326,
            "careerPageName": "Ewave do Brasil",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/370/career/326/images/logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2023-02-17T18:17:16.680Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Curitiba",
            "state": "Paraná",
            "country": "Brasil",
            "jobUrl": "https://vagasewave.gupy.io/job/eyJqb2JJZCI6NDEyMTE3MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": false,
            "workplaceType": "on-site",
            "careerPageUrl": "https://vagasewave.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 1666477,
            "companyId": 23401,
            "name": "Desenvolvedor Full Stack",
            "description": "Olá, Tudo bem? 🙂Já pensou em trabalhar em uma equipe que tem como missão disponibilizar bem-estar e qualidade de vida?Somos a ASSIST, certificada pela 3ª vez consecutiva como um ótimo lugar para trabalhar pela GPTW. 🥇Estamos há mais de 35 anos cuidando do servidor público!Se você tem experiência em ASP NET C#, se inscreva na nossa Vaga Banco de Talentos Desenvolvedor Full Stack e venha compor o nosso time de feras. 👨‍💻🚀🚀 &nbsp;Você topa? Espero te ver em breve!Responsabilidades e atribuiçõesCodificar o back-end e o front-end dos sistemas a partir das especificações e padrões recebidos;Realização de testes;Participar de reuniões com a equipe.Requisitos e qualificaçõesConhecimentos em ASP NET C# WEB Forms;WEB API CORE e MVC CORE;APIs REST e semântica geral do protocolo HTTP;Documentação on-line de APIs com Swagger;SQL Server e Entity Framework com Migrations;Padrões de software como Arquitetura em Camadas, Data Caching, Repository, Dependency Injection (Service Collection), Object- to-Object Mapping (Auto Mapper);Fluxos de autenticação baseados em OAUTH com Active Directory e JWT;Práticas de segurança em desenvolvimento Web;Experiência com Microsoft Visual Studio 2019 ou Visual Studio Code;Semantic Versioning, Nuget Server e controladores de versão GIT e SVNConhecimentos Desejáveis:Domain Driven Design;Azure Blobs Storage e Azure Active Directory.Informações adicionaisRegime de contratação:&nbsp;CLT (Efetivo).Local: Centro, Rio de Janeiro.Horário:&nbsp;De segunda a sexta-feira, das 08:00 às 17:00hrs.Benefícios:&nbsp;Vale Transporte, Assistência Médica, Assistência Odontológica, Assistência Jurídica, Seguro de Vida em Grupo, Tíquete Alimentação, Programa Vida Saudável (Psicologia, Nutrição e Enfermagem), Auxilio Creche, Bday Off, Esporte e Lazer, Cursos EAD, Orientação Vocacional e Descontos especiais em parcerias e convênios.",
            "careerPageId": 52678,
            "careerPageName": "ASSIST - Associação dos Servidores Municipais, Estaduais e Federais RJ",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/23401/career/52678/images/2024-03-05_20-26_companyLogoUrl.jpg",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2022-03-29T18:44:38.000Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Rio de Janeiro",
            "state": "Rio de Janeiro",
            "country": "Brasil",
            "jobUrl": "https://vempraassist.gupy.io/job/eyJqb2JJZCI6MTY2NjQ3Nywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://vempraassist.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 1452367,
            "companyId": 1963,
            "name": "Pessoa Desenvolvedora Full Stack (G1, Globo.com, Gshow, Globoplay, GE, Cartola)",
            "description": "A Globo&nbsp;é feita de gente que quer fazer diferente, fazer junto, fazer o futuro. Gente espalhada por todo o país (e mundo!) trabalhando com conteúdo, notícias, negócios, tecnologia e brasilidade de sobra. Canais na TV aberta e por assinatura, produtos digitais como globoplay, Cartola, g1, ge, gshow e outros serviços estão reunidos no mesmo lugar, na mesma globo. Novos modelos de negócios digitais estão sendo pensados e desenvolvidos, buscando nos aproximar cada vez mais do usuário e dos seus desejos. As oportunidades de novos negócios também trazem a chance e o desafio de construirmos novos times data-driven e que coloquem o consumidor no centro das nossas decisões.Criamos ambientes onde todas as pessoas são incluídas, acolhidas e valorizadas. Nos empenhamos em ser uma Globo cada vez mais diversa, em representatividade e pensamento, aprendendo uns com os outros e estimulando a criatividade e inovação.O Hub Digital faz parte da nossa área de Estratégia e Tecnologia, tendo papel de destaque na nossa transformação em uma empresa media tech e D2C. Aqui cuidamos da gestão de dados e do desenvolvimento dos nossos produtos digitais como Globoplay, Globo.com, família G (G1, Ge, Gshow) e Cartola, visando a melhor experiência de consumo, interação e relacionamento com os nossos usuários.&nbsp;&nbsp;Trabalhamos com uma variedade de tecnologias e linguagens para atingir nossos objetivos, além de estabelecermos uma relação contínua e crescente de compartilhamento de soluções com a comunidade de tecnologia!&nbsp;&nbsp;﻿A inscrição em nosso banco de talentos não garante a contratação, pois ela dependerá da disponibilidade de vagas e avaliação de currículos e requisitos de cada uma das oportunidades.Responsabilidades e atribuiçõesComo será seu dia a dia:&nbsp;&nbsp;Escrever código limpo, de fácil manutenção, utilizando as melhores práticas de desenvolvimento de software;&nbsp;Procurar sempre criar para os produtos&nbsp;Globo a melhor experiência de uso para o usuário final, trabalhando de perto com os especialistas em UX;&nbsp;Atuar como um&nbsp;team-player, comprometendo-se com os objetivos do time e trabalhando em harmonia com todos;&nbsp;Estar sempre crescendo e se desenvolvendo tecnicamente e profissionalmente;&nbsp;Participar de times geograficamente distribuídos.&nbsp;Requisitos e qualificaçõesDo que você precisa:&nbsp;Ter habilidades em algoritmos e estruturas de dados;Conhecimento em engenharia de software, como princípios, boas práticas e padrões de arquitetura;Experiência com desenvolvimento de Aplicações Escaláveis;Vivência com algumas linguagens de programação, como:&nbsp;JavaScript, React, Angular, Vue, Redux, JS Vanilla, Node,&nbsp;Python,&nbsp;Golang, Java, Ruby, Elixir, Scala,&nbsp;Clojure, C/C++, C#, etc.;Prática com as ferramentas de versionamento (como GIT,&nbsp;SVN,&nbsp;etc.);Experiência em escrever testes;Conhecimento em bancos de dados MySQL,&nbsp;SQL,&nbsp;MongoDB,&nbsp;Oracle,&nbsp;etc.);Vivência com metodologias ágeis.﻿Conhecimentos que te destacam:&nbsp;&nbsp;&nbsp;Experiência com Cloud, como AWS e Google Cloud Platform.&nbsp;Informações adicionaisPor que vir para Globo:&nbsp;&nbsp;Vem e vamos criar histórias e tecnologias juntos.Na Globo, o encontro de histórias com tecnologia move um time diverso e apaixonado por inovação. A gente tem a chance de aproximar os brasileiros, criando novas formas de se conectar com eles. Aqui, cada um faz a transformação acontecer.Nossos processos seletivos estão acontecendo de forma 100% remota e nós encorajamos inscrições de qualquer lugar do Brasil e do mundo. #vempraglobo&nbsp;&nbsp;&nbsp;&nbsp;Seguindo o compromisso de contribuir para um ambiente seguro para nossas pessoas, informamos que ter o esquema completo vacinação contra a Covid-19 é uma condição obrigatória para o trabalho na Globo, presencial ou a distância, e que o comprovante deverá ser apresentado como pré-requisito para a contratação.&nbsp;&nbsp;Quer saber mais sobre como é trabalhar na Globo? Vem acompanhar nosso dia a dia, desafios e conquistas nas nossas redes:&nbsp;https://www.linkedin.com/company/globo&nbsp;&nbsp;https://www.instagram.com/vempraglobo&nbsp;&nbsp;&nbsp;https://www.youtube.com/c/VemPraGlobo/&nbsp;&nbsp;Os seus dados pessoais serão utilizados para fins de seleção de candidatos para preenchimento das vagas abertas na Globo. Os dados pessoais coletados durante o processo seletivo dos candidatos que não forem admitidos neste momento poderão ser mantidos nos bancos de dados para consideração em futuros processos seletivos. Todos os dados coletados serão tratados segundo rígidos padrões de segurança da informação e em total respeito às leis de privacidade aplicáveis, incluindo a Lei 13.709/18, e nos termos de nossa política de privacidade, disponível no link:&nbsp;https://vempraglobo.g.globo/files/politica_de_privacidade.pdf&nbsp;Ao prosseguir você está ciente e de acordo para realização de sua candidatura nestes termos.&nbsp;",
            "careerPageId": 40535,
            "careerPageName": "Globo",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/1963/career/40535/images/2023-07-05_19-15_companyLogoUrl.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2022-01-13T18:55:13.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Rio de Janeiro",
            "state": "Rio de Janeiro",
            "country": "Brasil",
            "jobUrl": "https://globo.gupy.io/job/eyJqb2JJZCI6MTQ1MjM2Nywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": false,
            "workplaceType": "remote",
            "careerPageUrl": "https://globo.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 1270686,
            "companyId": 8914,
            "name": "Banco de Talentos - Pessoa Desenvolvedora Full Stack",
            "description": "No momento não estamos com esta vaga em aberto, mas pretendemos em breve, para facilitar criamos essa área de banco de talentos, onde filtraremos futuros candidatos . Se você não tem medo de encarar desafios, ama trabalhos colaborativos e em equipe e gosta de desenvolver soluções para usuários globais, se inscreva aqui!Venha se tornar um(a) Shocker para fazer a diferença no dia a dia dos usuários através de aplicações! Nos ajude a atender esse universo de mais de 7 milhões de usuários.Responsabilidades e atribuiçõesRealizar o desenvolvimento dos aplicativos da Br24;Realizar a documentação técnica e funcional dos aplicativos;Apoiar o time em análises e estimativas de tarefas;Realizar a manutenção dos aplicativos;Zelar pela qualidade do desenvolvimento;Apoiar a realização dos testes;Apoiar o time e as demais áreas.Requisitos e qualificaçõesConhecimento Técnico desejável:Possuir experiência com PHP;Ter conhecimentos de MySQL;Ter conhecimentos de JavaScript;Possuir experiência com HTML e CSS;Realizar versionamento de código com Git;Realizar a integração entre sistemas via API REST e Webhooks;Diferencial:Possuir conhecimentos em Laravel;Ter experiência com frameworks/libs modernas de JavaScript, tais como React e Vue.js;Possuir noção de Linux utilizando linha de comando (terminal);Docker;AWS;Possuir conhecimento com testes funcionais;Informações adicionaisQuais os benefícios dos Shockers?Fazer parte do melhor time de especialistas Bitrix24 do mundo (são mais de 15,5 mil);Trabalhar lado a lado e aprender diariamente com profissionais referência no mercado;Cursos e certificações da Br24 Academy (nossa universidade corporativa) para você explorar;Atividades de mindfulness e ócio criativo para tornar a sua experiência ainda melhor;Avaliações de desempenho, troca de feedbacks e 1:1 com os líderes;Participação do founder e CEO na cultura diária da Br24, assim como a transparência na comunicação;Oportunidades internas que focam no desenvolvimento e crescimento dos Shockers;Espaço para apresentar novas ideias, aqui os Shockers são ouvidos;Happy Hour e comemorações internas para mover a energia dos Shockers;No dress code - o importante é se vestir como você se sentir melhor.",
            "careerPageId": 20107,
            "careerPageName": "Br24⚡",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/8914/career/20107/images/2022-05-17_13-28_logo.png",
            "type": "vacancy_legal_entity",
            "publishedDate": "2021-10-20T19:12:03.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Florianópolis",
            "state": "Santa Catarina",
            "country": "Brasil",
            "jobUrl": "https://br24.gupy.io/job/eyJqb2JJZCI6MTI3MDY4Niwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "careerPageUrl": "https://br24.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 1139362,
            "companyId": 390,
            "name": "TI | Desenvolvedor(a) Full Stack",
            "description": "O Hurb é uma das maiores empresas de tecnologia no setor de Travel Experiences do mundo e com muito orgulho, desde 2011, realizamos milhares de sonhos.Um dos pontos centrais da nossa cultura é ter as pessoas sempre em primeiro lugar, e alinhando isso com a nossa missão de \"Otimizar Viagens através da Tecnologia\", estamos formando equipes excepcionais - e em Software, não é diferente!De maneira robusta, contando com mais de dez squads (como CX, Hotéis, Metasearch e Pagamentos), construímos times de alta qualidade com lideranças extremamente acessíveis e uma estrutura horizontal.Porque muito mais do que código, esperamos do nosso time tech um olhar crítico e proporcionamos autonomia para pensar em novas soluções!A nossa prioridade é manter um ambiente de desenvolvimento, com espaço para todos crescerem em conjunto e tendo um olhar atento para novas tecnologias.Por isso, buscamos pessoas que sejam movidas a desafios e temos oportunidades para todos os níveis técnicos: Júnior, Pleno e Sênior! \\o/Ah, se a sua pegada for mais Back End, não deixa de se inscrever aqui: https://hurb.gupy.io/jobs/1139483?jobBoardSource=gupy_public_pageE, claro, se for Front End, corre nesse link: https://hurb.gupy.io/jobs/1139506?jobBoardSource=gupy_public_pageResponsabilidades e atribuiçõesTer habilidade em colocar uma aplicação em ambiente de produção, dentre outras atividades e domínios;Trabalhar para construir e manter serviços de Back End e aplicações de Front End com alta performance e escalabilidade;Construir interfaces reativas, respeitando a identidade visual da companhia;Escrever testes unitários e de integração nas aplicações;Monitorar a saúde dos serviços em que atua;Melhorar a qualidade da base de código em que atua;Manter o fluxo de deployment e versionamento das aplicações consistente;Colaborar com um time multidisciplinar para manter um ambiente de desenvolvimento saudável e ágil.Requisitos e qualificaçõesExperiência com Python, NodeJS, PHP ou Golang;Experiência com HTML, CSS, JavaScript e ReactJS;Vivência com metodologias ágeis, como Kanban e Scrum;Experiência na construção de APIs REST;Noções de SQL e/ou NoSQL;Experiência com testes unitários e de integração;Conhecimento em conteinerização utilizando Docker;Conhecimento de Gitflow;Entendimento sobre os conceitos de clean architecture;Conhecimento sobre os princípios SOLID, DRY, YAGNI, KISS;Conhecimento sobre design patterns.Diferenciais&nbsp;Já ter utilizado MongoDB, MySQL ou PostgreSQL;Experiência aplicando TDD;Experiência aplicando DDD;Conhecimento de utilização da Google Cloud Platform;Vivência com GraphQL;Experiência trabalhando com Kubernetes.Informações adicionaisBENEFÍCIOS:Benefícios Flexíveis Caju: VR, VA e muito mais!;Vale Transporte ou Vale Combustível;Van Hurb;Plano de Saúde e Odontológico SulAmérica (extensível para dependentes);Café da Manhã e Lanche da Tarde (escritório);Auxílio Creche ou Babá;Aula de inglês e espanhol;Hurb Learning, o portal de ensino exclusivo do Hurb;Hurb Education Development Program - o Hurb te leva para se desenvolver e trabalhar em outros países!Self Growth (valor equivalente a um salário extra anual para investimento em educação, saúde mental ou coworking).PARCERIAS:Convênio Farmácia;TotalPass (Smart Fit) e BodyTech;Política educacional (desconto em diversas faculdades);Dell - itens de informática e tecnologia;E muito mais!Ahh e além disso tudo, sexta-feira é o Dia Internacional da Cerveja no Hurb!",
            "careerPageId": 360,
            "careerPageName": "Hurb",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/390/career/360/images/2022-01-18_14-04_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2021-08-24T17:22:03.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "Rio de Janeiro",
            "state": "Rio de Janeiro",
            "country": "Brasil",
            "jobUrl": "https://hurb.gupy.io/job/eyJqb2JJZCI6MTEzOTM2Miwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "careerPageUrl": "https://hurb.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 940983,
            "companyId": 1243,
            "name": "Desenvolvedor(a) .NET Full Stack",
            "description": "Vaga para nosso BANCO DE TALENTOSBuscamos um profissional que tenha comprometimento e resiliência, boa comunicação verbal e escrita, eficiência com foco no cliente e capacidade analítica e disposição para os desafios. Se você tem isso, quais veja as competências técnicas e se candidate!Somos inquietos, somos desbravadores e estamos em constante transformação.Por isso, estamos na busca constante de crescimentos do nosso time com profissionais inovadores, que desafiam os limites e estejam preparados para embarcar em uma cultura totalmente nômade.SOMOS NÔMADES, NOSSAS VAGAS SÃO PARA QUALQUER LUGAR!Seja qual for o seu gênero, orientação sexual, idade, raça, etnia, crença ou deficiência, todos são bem-vindos no nosso time.Responsabilidades e atribuiçõesAnálise e Desenvolvimento de Aplicações WEB em .NET / .NET Core;Atendimento Baseline de Suporte a Aplicações;Modelagem de Banco de Dados;Realização de Testes Unitários;Implantação de Releases em Testes, QA e PRD;Especificação Técnica.Requisitos e qualificaçõesEssencialExperiência em Análise e Desenvolvimento .NET para Web;HTML e Javascript;Modelagem de Dados em MS SQL Server;Inglês ou Espanhol Fluente.DesejávelSharepoint Onpremisses e Online;Práticas de Segurança;Web Services (SOAP e Rest);Integração com Plataformas Cloud como Amazon AWS e Microsoft Azure DevOps.DiferencialExperiência com Angular e Integrações com Microserviços.E claro, muita vontade para desbravar.Informações adicionaisOs desbravadores tem:Horário flexível, aqui você é responsável por se organizar;Cultura ágil, aqui todos os desbravadores utilizam metodologias ágeis no dia a dia;No dress code, seja 100% você;Vale transporte;Vale refeição ou alimentação FLEX;Gympass;Plano odontológico Bradesco;Plano de saúde Amil;Seguro de vida Metlife;Bem estar psicológico gratuito;Brivia Academy, treinamentos para aperfeiçoamento;Bônus salarial;Associação e descontos na&nbsp;ANAMID;E o melhor de todos: trabalhe de onde você quiser, somos nômades e estamos 100% em home office!",
            "careerPageId": 9448,
            "careerPageName": "Brivia",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/1243/career/9448/images/2022-03-21_12-58_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2021-06-04T21:20:07.000Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://brivia.gupy.io/job/eyJqb2JJZCI6OTQwOTgzLCJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://brivia.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 8
    }
}