{
    "data": [
        {
            "id": 9723942,
            "companyId": 40924,
            "name": "BANCO DE TALENTOS - ENGENHARIA DE SOFTWARE ( SPEC, SR, PL E JR)",
            "description": "Na Inmetrics, a inovação e a excelência operam lado a lado em um ambiente de trabalho colaborativo, saudável e dinâmico. Nossa cultura valoriza o aprendizado constante, a transparência na comunicação e a flexibilidade, criando um espaço onde cada profissional pode se desenvolver e alcançar o seu máximo potencial.​Nosso time é apaixonado por tecnologia e comprometido com entregas de valor real para os nossos clientes. Nosso diferencial é a eficiência digital. ​Pessoas são o nosso maior ativo, por isso, investimos em oportunidades que vão além de um salário competitivo, proporcionamos benefícios diferenciados em relação ao mercado e um ambiente de trabalho saudável e reconhecido por nossos colaboradores.​#VemparainmetricsResponsabilidades e atribuiçõesSe você é apaixonado(a) por desenvolvimento de software e quer atuar em projetos de impacto, esse é o seu espaço!Nosso Banco de Talentos conecta profissionais de todas as senioridades — Júnior, Pleno, Sênior e Especialistas — às nossas oportunidades em Front-end, Back-end e Fullstack.📍 Vagas em modelo presencial, híbrido e remoto.🎯 O TIME INMETRICSAqui, engenharia de software é o coração da inovação.Nosso time atua com maestria técnica e excelência operacional, desenvolvendo soluções escaláveis, seguras e de alta performance.Somos multidisciplinares, vivemos metodologias ágeis e estamos sempre evoluindo para criar o futuro digital.Requisitos e qualificações🔧 TECNOLOGIAS E CONHECIMENTOS QUE VALORIZAMOS💡 Temos oportunidades em diversas frentes e ferramentas, incluindo:🔹 Back-end.NET Core / C#: APIs RESTful, Entity Framework Core, LINQ, Middleware, Injeção de Dependência, DDD, Arquitetura em camadasJava com Spring Boot: Microsserviços, Spring Data/JPA/Hibernate, Beans, Autowiring, ConfigurationsNode.js: Express, Nest.js, integrações e APIs escaláveis🔹 Front-endReact, Angular, Vue.jsIntegração com APIs RESTfulBoas práticas de UX/UI🔹 Cloud &amp; DevOpsAWS (EC2, S3, RDS, Lambda, SQS, SNS)Noções de Infraestrutura como Código (IaC)Containers (Docker, Kubernetes)CI/CD (GitHub Actions, GitLab CI, Azure DevOps, Jenkins)🔹 Testes AutomatizadosxUnit/NUnit (C#), JUnit (Java)Moq, Mockito (mocking)Testes de integração e cobertura de código🔹 Engenharia de SoftwarePrincípios SOLIDClean CodeVersionamento com Git (Git Flow)Arquitetura distribuídaIntegração de sistemas🔹 Bancos de DadosRelacionais (PostgreSQL, MySQL, SQL Server)Não relacionais (MongoDB, DynamoDB)Informações adicionais🌟 PERFIL QUE BUSCAMOSProatividade e senso de donoComunicação clara e colaboração em times multidisciplinaresCuriosidade técnica e abertura para aprendizado contínuoAutonomia com responsabilidade e atenção à qualidade de códigoVivência em times ágeis (Scrum/Kanban)🌟 POR QUE FAZER PARTE?Atuar em projetos desafiadores de grande impacto.Crescimento contínuo e troca de conhecimento.Ambientes que valorizam inovação e excelência técnica.👉 Inscreva-se em nosso Banco de Talentos e seja chamado(a) quando uma vaga estiver alinhada ao seu perfil.Venha construir o futuro da tecnologia conosco! 💻✨",
            "careerPageId": 88327,
            "careerPageName": "Vagas Inmetrics",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/40924/career/88327/images/2025-02-14_18-51_companyLogoUrl.jpg",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-08-20T20:12:58.247Z",
            "applicationDeadline": "2030-10-19T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Barueri",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://inmetrics.gupy.io/job/eyJqb2JJZCI6OTcyMzk0Miwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://inmetrics.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9618138,
            "companyId": 7198,
            "name": " Estágio em Desenvolvimento de Software Frontend",
            "description": "Vamos buscar o extraordinário juntos? 🚀Nossos princípiosFalamos de pessoa para pessoaBuscamos o extraordinárioDamos vida à inovaçãoNos fortalecemos com a transparência.﻿Na Franq Open Banking, estamos liderando uma revolução no setor financeiro, criando produtos inovadores que democratizam o acesso a serviços bancários e transformam a experiência dos nossos clientes. Como startup, valorizamos a criatividade, a colaboração e a busca por soluções disruptivas. Estamos em busca de um(a) estagiário(a) para integrar nossa área de dados, contribuindo com análises e insights que impulsionem nossos produtos e estratégias.A vaga é para atuação em modelo híbrido, com a possibilidade de trabalhar remotamente e também presencialmente em nosso escritório. Acreditamos que o contato pessoal é essencial para o aprendizado e desenvolvimento em uma posição de estágio, permitindo trocas ricas com as equipes, tanto técnicas quanto de negócio.Responsabilidades e atribuiçõesO seu papel será:Responsabilidades e Atribuições:Ajudará a estruturar toda fundação das nossas soluções;Trabalhará em conjunto com um time multidisciplinar e focado em encontrar a melhor, mais estável e escalável tecnologia;Irá apoiar no Desenvolvimento de soluções e API's de integração com diversos parceiros de todo o mercado financeiro;Irá auxiliar no Desenvolvimento das soluções integradas com um sistema de monitoramento.O que esperamos que você tenha:Curiosidade e vontade de aprender: Estamos em um setor dinâmico e em constante evolução, e buscamos alguém que tenha sede de conhecimento e disposição para explorar novos desafios.Colaboração e comunicação: Gostar de trabalhar em equipe, compartilhar ideias e se comunicar de forma clara é essencial para o sucesso nessa posição.Proatividade: Esperamos que você tenha iniciativa para propor melhorias, questionar processos e buscar soluções criativas.Requisitos e qualificaçõesO que esperamos:Que você esteja cursando faculdade, ou ensino técnico em TI;Vontade de aprender;Que tenha contato com lógica de programação.Você irá se destacar se tiver:Conhecimento em React;Conhecimento em Css.Informações adicionaisAqui na Franq você vai:Atuar com um time de profissionais experientes e renomados do mercado financeiro;Desenvolver, evoluir e aprender habilidades com as melhores práticas e novas tecnologias;Participar de um projeto inovador que impacta vidas financeiras de clientes além de criar novas formas de fazer negócio.&nbsp;&nbsp;&nbsp;Vamos oferecer:Bolsa de estágio no valor de R$ 1.350,00;Cartão de benefícios flexíveis Caju de R$&nbsp;664,75;&nbsp;Seguro de vida;Parceria com Wellhub (Gympass);Parceria com Psicologia Viva e Conexa Saúde;Day off no mês de aniversário;Mesa de frutas para os Franqers em modelo presencial.Diversidade e Inclusão na Franq!Aqui na Franq você tem espaço para ser franco com você, ser quem você é!Nós te valorizamos, independente de raça, cor, religião, identidade de gênero, nacionalidade, deficiência, orientação sexual, descendência ou idade.Todas as nossas vagas são aptas para receber candidaturas de pessoas com deficiências, caso você se enquadre. Você pode especificar na sua candidatura e informar o código do CID correspondente.VENHA BUSCAR O EXTRAORDINÁRIO CONOSCO🚀Venha ser Franqer!#GoFranq",
            "careerPageId": 15784,
            "careerPageName": "Franq",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/7198/career/15784/images/2021-07-05_14-49_logo.png",
            "type": "vacancy_type_internship",
            "publishedDate": "2025-08-01T19:27:48.299Z",
            "applicationDeadline": "2026-08-31T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Florianópolis",
            "state": "Santa Catarina",
            "country": "Brasil",
            "jobUrl": "https://franq.gupy.io/job/eyJqb2JJZCI6OTYxODEzOCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://franq.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9502610,
            "companyId": 7198,
            "name": "Pessoa Engenheira de Software Sênior - Front end",
            "description": "Vamos buscar o extraordinário juntos? 🚀Somos um time de especialistas focados na inovação de produtos e serviços financeiros.&nbsp;Oferecemos uma solução pioneira: uma one-stop-shop para profissionais bancários independentes e escritórios de investimentos.Juntos, transformamos o mercado financeiro por meio da tecnologia. Temos como propósito, com muita franqueza, garantir a autonomia, a liberdade e a transparência para os consumidores.Por isso, buscamos maneiras transformadoras de melhorar a forma como nossos clientes se relacionam com o mercado.Somos a Franq - Finance is Personal.&nbsp;💵Nossos princípiosFalamos de pessoa para pessoaBuscamos o extraordinárioDamos vida à inovaçãoNos fortalecemos com a transparênciaResponsabilidades e atribuiçõesO seu papel será:Criar experiências digitais memoráveis – Desenvolver interfaces responsivas e acessíveis a partir de wireframes e protótipos, garantindo uma navegação fluida e intuitiva.Escrever código limpo e escalável – Participar de code reviews, garantindo a qualidade do código e promovendo boas práticas.Construir aplicações performáticas – Criar componentes reutilizáveis com React.js, TypeScript e TailwindCSS, otimizando carregamento e acessibilidade.Colaborar ativamente com o time – Trabalhar próximo a UX/UI Designers, Product Managers e Backend Engineers, garantindo a melhor experiência para os usuários.Garantir estabilidade e inovação – Monitorar e resolver incidentes rapidamente, além de desenvolver novas features e melhorias contínuas para a plataforma.Requisitos e qualificaçõesO que esperamos:Experiência sólida em React e sua stack principal (Hooks, Context API, Server Components e State Management com Redux, Zustand ou Recoil).Conhecimento avançado em Next.js para construção de aplicações performáticas e escaláveis.Domínio de JavaScript e TypeScript.Experiência com CSS moderno (TailwindCSS, Emotion ou Styled Components).Experiência com arquitetura de componentes reutilizáveis e acessibilidade (A11y).Conhecimento em CI/CD pipelines, integração contínua e versionamento com Git/GitHub ou Bitbucket.Prática em testes automatizados com Jest, React Testing Library ou CypressCapacidade de trabalhar com Figma ou Sketch, transformando designs em código fiel ao protótipo.Familiaridade com arquitetura de Microfrontends e integração com Microsserviços e APIs, garantindo modularidade e escalabilidade.Experiência com estratégias de gerenciamento de bundle (Lazy Loading, Code Splitting e Tree Shaking) para otimização de performance e carregamento progressivo.Você irá se destacar se tiver:Conhecimento em Storybook para documentação e testes de UI.Familiaridade com Web Performance Optimization (WPO) e técnicas avançadas de SSR/ISR.Experiência com Infraestrutura AWS (Amplify, S3, CloudFront, Lambda).Se você quer fazer parte de um time que valoriza a inovação, a colaboração e a excelência técnica, vem com a gente!Informações adicionaisAqui na Franq você vai:Atuar com um time de profissionais experientes e renomados do mercado financeiro;Participar de um projeto inovador que impacta vidas financeiras de clientes além de criar novas formas de fazer negócio.Ambiente dinâmico e colaborativo, com foco em inovação contínua;Oportunidade de crescimento e desenvolvimento profissional;Flexibilidade de trabalho remoto;&nbsp;Vamos oferecer:Contrato CLT;Ambiente leve e descontraído;Cartão de benefícios flexíveis Caju de R$ 933,48;&nbsp;Assistência médica e odontológica, sem coparticipação, totalmente subsidiada pela empresa.Seguro de vida;GympassNo dress code;Day off no mês de aniversário.﻿Diversidade e Inclusão na Franq!Aqui na Franq você tem espaço para ser franco com você, ser quem você é!Nós te valorizamos, independente de raça, cor, religião, identidade de gênero, nacionalidade, deficiência, orientação sexual, descendência ou idade.Todas as nossas vagas são aptas para receber candidaturas de pessoas com deficiências, caso você se enquadre. Você pode especificar na sua candidatura e informar o código do CID correspondente.VENHA BUSCAR O EXTRAORDINÁRIO CONOSCO🚀Venha ser Franqer!#GoFranq",
            "careerPageId": 15784,
            "careerPageName": "Franq",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/7198/career/15784/images/2021-07-05_14-49_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-07-11T12:23:12.295Z",
            "applicationDeadline": "2026-12-31T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Florianópolis",
            "state": "Santa Catarina",
            "country": "Brasil",
            "jobUrl": "https://franq.gupy.io/job/eyJqb2JJZCI6OTUwMjYxMCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://franq.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9439033,
            "companyId": 1873,
            "name": "Tutor de Avaliação - Engenharia de Software",
            "description": "Somos a Vitru Educação! 💜A maior instituição privada de ensino EAD do Brasil e referência nacional do ensino presencial e Medicina. Juntos como Vitru, Unicesumar e Uniasselvi, nos dedicamos ao desenvolvimento individual e coletivo. Nossa prioridade é o aprendizado, fazemos do conhecimento um estilo de vida! Nós queremos continuar crescendo, com responsabilidade, mantendo a excelência e os valores que nos trouxeram até aqui e nos levarão adiante!Quer vir conosco no Universo do Conhecimento? 💜Se quiser saber mais sobre a Vitru e suas marcas Unicesumar e Uniasselvi, acesse nosso site: https://www.vitru.com.br/.Oportunidade de atuação na área pedagógica!Estamos buscando profissionais para atuar junto a área pedagógica na correção de avaliações discursivas de nossos alunos em Educação à Distância.&nbsp;Informações adicionais:Modalidade 100% Home Office;Carga Horária de&nbsp;20 e 40 horas semanais;Regime CLT.A UniCesumar valoriza e promove uma cultura diversa e inclusiva. Consideramos pessoas com deficiência (PCD) para todas as nossas oportunidades!Responsabilidades e atribuiçõesRealizar a correção de avaliações discursivas de alunos em modalidade de Ensino à Distância.Requisitos e qualificaçõesObrigatório Graduação em Engenharia de Software;Especialização completa;Desejável experiencia na área;Informações adicionaisO que você vai encontrar por aqui:Bolsa educação&nbsp;para graduação e pós-graduação de 70% à 100% (EAD, Presencial e Híbrido) para o colaborador;Bolsa educação&nbsp;para graduação e pós-graduação de 70% (EAD, Presencial e Híbrido) para dependentes;Bolsas educação para Mestrado e Doutorado&nbsp;de 70% de desconto&nbsp;(EAD, Presencial e Híbrido);Plano Odontológico:&nbsp;Valor reduzido e extensível para familiares.Clube de Vantagens&nbsp;para desconto de até 60%, com mais de 300 parcerias em farmácia, viagens, cursos, delivery, eletroeletrônicos e muito mais!Licença Maternidade e Paternidade estendida:&nbsp;Válida para filhos biológicos e adotivos, para aproveitar mais o seu bebê e adaptar-se à nova rotina.&nbsp;Day Off de Aniversário:&nbsp;Um dia de folga no mês do seu aniversário!Telemedicina Pluxee:&nbsp;Mais de dez médicos especialistas disponíveis para atendimento online e gratuito! O benefício inclui consultas médicas, solicitação e análise de exames, prescrições médicas e atestados.Apoio Pass:&nbsp;Atendimento 24 horas e gratuito com profissionais das áreas da Nutrição, Psicologia, Jurídica, Financeira e Social, extensível para cônjuges e filhos de até 24 anos.Go Good:&nbsp;Acesso a diversas academias na cidade com um valor mais acessível aos colaboradores.",
            "careerPageId": 113361,
            "careerPageName": "Unicesumar",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/1873/career/113361/images/2022-11-18_11-42_logo.jpg",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-06-30T12:01:57.230Z",
            "applicationDeadline": null,
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://unicesumaroficial.gupy.io/job/eyJqb2JJZCI6OTQzOTAzMywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://unicesumaroficial.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9368613,
            "companyId": 41980,
            "name": "Software Engineering Manager (Core banking) - Campinas/SP",
            "description": "Empresa contratante: HypeFlame Tecnologia e Big Data LTDAO modelo de trabalho é presencial. As oportunidades dos times de Tecnologia são para pessoas que moram ou desejam morar em Campinas/SP ou região metropolitana de Campinas/SP.Responsabilidades e atribuiçõesDesenvolver e apoiar a equipe em conhecimentos relacionados ao desenvolvimento de softwares, em todas as suas frentes;Ser referência na gestão de pessoas e na gestão e execução da estratégia;Promover a melhoria contínua em todas as frentes do seu time, tanto do ponto de vista estratégico, tático quanto operacional, garantindo a evolução das entregas, produtos e pessoas;Alinhar com os Portfolio Managers a alocação mais eficiente dos colaboradores sob sua gestão, sempre respeitando a priorização do negócio;Auxiliar Product Owners e Scrum Masters na resolução de conflitos, remoção de impedimentos e avanço dos projetos e iniciativas como um todo, inclusive facilitando a comunicação entre eles e para com seus pares em outras equipe;Ter clara a estratégia da empresa e alinhar a execução e priorização necessárias com os Portfolio Managers;Participar do planejamento do orçamento junto ao seu centro de custos e a Governança de TI e propor melhorias e correções que visem a eficiência de uso dos recursos para atingimento das metas;Trabalhar em conjunto com as comunidades e coaches para garantir que as squads estejam em conformidade e melhorando continuamente conforme modelo de maturidade proposto;Gerenciar e responder administrativamente pelos recursos sob sua gestão;Desenvolver os seus colaboradores, com o apoio do Scrum Master, nas competências e habilidades necessárias para a entrega da estratégia;Impulsionar a adoção de práticas DevOps e as principais ferramentas de continuous integration e continuous deployment;Ser referência em&nbsp;DevOps&nbsp;e qualidade de código;Mentorar e dar suporte a liderança&nbsp;de Plataformas Kubernetes;Garantir a estruturação e&nbsp;coordenação dos ambientes de produção CI/CD para implantação de novas versões;Apoiar a construção de documentação de APIs e micro serviços;Apoiar na integração de plataformas de produtos e serviços (Backend) e auxiliar na elaboração de arquiteturas para novas soluções;Atuar como um&nbsp;Product&nbsp;Manager&nbsp;nas&nbsp;Squads&nbsp;multidisciplinares, entendendo os&nbsp;roadmap&nbsp;de implantação de software em novas soluções com base nas oportunidades de mercado, mapeamento de custos e valor agregado;Auxiliar na execução de&nbsp;dicionário&nbsp;da aplicação.Requisitos e qualificaçõesGraduação completa;Engenharia de Software;&nbsp;Definição de Orçamentos Departamentais;&nbsp;Análise de Causa Raiz;&nbsp;Gestão de Pessoas;&nbsp;Gestão de Projetos;&nbsp;Jira e Confluence;&nbsp;Scrum e/ou Kanban.&nbsp;Conhecimento Conta Corrente/ CoreBakingInformações adicionaisALGUNS BENEFÍCIOS, FACILIDADES E PARCERIAS:Vale-refeição e/ou alimentação;Plano de saúde com isenção em exames preventivos 1 vez ao ano;Plano odontológico;Total Pass, pra atividade física e bem-estar;Programa de Participação nos Resultados (PPR) seguindo as regras estabelecidas anualmente;Programa de sócios do Agi, o Tô de Dono/a;Universidade interna, a Uni Agi;Folga de presente no mês do seu aniversário;Pesquisa semanal de clima, a Sem Climão;Avaliação de performance;Teleatendimento psicológico e médico gratuito, com o Conexão Saúde;Licença-maternidade de 6 meses e licença-paternidade de 20 dias;Dr. Pet: possibilidade fazer plano de saúde para o seu pet com até 20% de desconto;Auxílio-creche.Previdência Privada;Fretado de ida e volta para Campinas, Indaiatuba, Hortolândia, Santa Barbara D'Oeste, Americana, Paulínia e Valinhos. São lugares reserváveis mediante a disponibilidade de assentos e rota.",
            "careerPageId": 163881,
            "careerPageName": "Tecnologia - Agibank",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/41980/career/163881/images/2023-07-02_22-33_companyLogoUrl.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-06-23T12:05:53.998Z",
            "applicationDeadline": "2026-05-02T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "Campinas",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://tecnologia-agibank.gupy.io/job/eyJqb2JJZCI6OTM2ODYxMywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://tecnologia-agibank.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9385227,
            "companyId": 7198,
            "name": "Pessoa Engenheira de Software - Back-end Python",
            "description": "Vamos buscar o extraordinário juntos? 🚀Nossos princípiosFalamos de pessoa para pessoaBuscamos o extraordinárioDamos vida à inovaçãoNos fortalecemos com a transparênciaResponsabilidades e atribuiçõesO seu papel será:Ajudar na estruturação de toda fundação das nossas soluções;Desenvolver soluções e API's de integração com diversos parceiros de todo o mercado financeiro;Fazer parte da estruturação de nossa arquitetura distribuída, utilizando CI/CD com testes automatizados e totalmente na nuvem;Desenvolver as soluções integradas com um sistema de monitoramento para garantirmos performance e atuação preventiva;Desenvolver soluções sempre pensando em eficiência, escalabilidade e estabilidade.Requisitos e qualificaçõesO que esperamos que você tenha:Conhecimento profundo em Python + Django;Conhecimento de Clean Code e Design Patterns;Conhecimento de Banco de Dados relacional;Utilizar conceitos do Git: branching, issues, pull-requests, etc;Vivência em metodologias ágeis;Conhecimento da stack de soluções da AWS (EKS, RDS);Desenvolvimento de APIs;Desenvolvimento de soluções baseadas em eventos.Você irá se destacar se tiver:Conhecimento de soluções serverless e conceito FaaS;&nbsp;Conhecimento em configuração de arquitetura de sistemas na AWS;&nbsp;Experiência com pipelines de ETL;Conhecimento nas linguagens: Node.js ou Go;&nbsp;Conhecimento em TDD;&nbsp;Conhecimento em Data Storage e Data Architecture;&nbsp;Inglês (leitura e escrita);Desenvolvimento de testes automatizados e prática de code reviews pois queremos sempre garantir a máxima qualidade e segurança das nossas entregas.Informações adicionaisAqui na Franq você vai:Atuar com um time de profissionais experientes e renomados do mercado financeiro;Desenvolver, evoluir e aprender habilidades com as melhores práticas e novas tecnologias;Participar de um projeto inovador que impacta vidas financeiras de clientes além de criar novas formas de fazer negócio.&nbsp;&nbsp;&nbsp;Vamos oferecer:Contrato CLT;Cartão de benefícios flexíveis Caju de R$&nbsp;933,48;&nbsp;Assistência médica e odontológica, sem coparticipação, totalmente subsidiada pela empresa (Plano Bradesco);Seguro de vida;Parceria com Gympass;Parceria com Psicologia Viva e Conexa Saúde;Day off no mês de aniversário;Mesa de frutas para os Franqers em modelo presencial.Diversidade e Inclusão na Franq!Aqui na Franq você tem espaço para ser franco com você, ser quem você é!Nós te valorizamos, independente de raça, cor, religião, identidade de gênero, nacionalidade, deficiência, orientação sexual, descendência ou idade.Todas as nossas vagas são aptas para receber candidaturas de pessoas com deficiências, caso você se enquadre. Você pode especificar na sua candidatura e informar o código do CID correspondente.VENHA BUSCAR O EXTRAORDINÁRIO CONOSCO🚀Venha ser Franqer!#GoFranq",
            "careerPageId": 15784,
            "careerPageName": "Franq",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/7198/career/15784/images/2021-07-05_14-49_logo.png",
            "type": "vacancy_type_effective",
            "publishedDate": "2025-06-18T17:45:54.353Z",
            "applicationDeadline": "2026-12-31T00:00:00.000Z",
            "isRemoteWork": true,
            "city": "",
            "state": "",
            "country": "Brasil",
            "jobUrl": "https://franq.gupy.io/job/eyJqb2JJZCI6OTM4NTIyNywic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "remote",
            "careerPageUrl": "https://franq.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 9203220,
            "companyId": 1873,
            "name": "Professor de Engenharia de Software - Banco de Talentos",
            "description": "Somos um centro universitário, onde nosso maior objetivo é transformar e mudar a história das pessoas. 👩🏼🏫🎓👨🏾🎓Não oferecemos apenas cursos, mas sim sonhos e futuros a serem trilhados, precisamos cada vez mais de pessoas entusiasmadas com a educação para que nosso objetivo seja realizado.Nosso principal lema é: Não basta saber, é preciso saber fazer!Isso que levamos a frente para construir e colocar nosso time em campo.Responsabilidades e atribuiçõesPlanejar e ministrar aulas;Planejar, aplicar e avaliar atividades relacionadas aos conteúdos da disciplina;Acompanhar aulas e dar suporte aos&nbsp;alunos.ir&nbsp;reuniões pedagógicas.Requisitos e qualificaçõesFormação: Engenharia de Software, Análise e Desenvolvimento de Sistemas ou Sistemas de InformaçãoPós GraduadoMestrado Será um diferencial",
            "careerPageId": 2819,
            "careerPageName": "UNIASSELVI",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/1873/career/2819/images/2021-05-18_18-10_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-05-21T16:44:48.112Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Indaial",
            "state": "Santa Catarina",
            "country": "Brasil",
            "jobUrl": "https://uniasselvi.gupy.io/job/eyJqb2JJZCI6OTIwMzIyMCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "on-site",
            "careerPageUrl": "https://uniasselvi.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 8639882,
            "companyId": 2358,
            "name": "Executivo(a) de Contas Hunter - Software - Banco de Talentos",
            "description": "✨ Vem ser Benner!Somos apaixonados por tecnologia, inovação e, acima de tudo, por pessoas! 💙Na Benner, desenvolvemos soluções para facilitar o dia a dia de áreas como Saúde, RH, Jurídico, ERP, Turismo e Logística — e estamos sempre em busca de novos talentos para crescer junto com a gente.🌍 Temos vagas abertas em diferentes regiões do Brasil e modelos de trabalho (presencial, híbrido e remoto), com um ambiente colaborativo, onde o aprendizado é constante e as boas ideias têm vez!Se você acredita no poder da tecnologia para transformar o mundo e quer fazer parte de um time que valoriza o respeito, a diversidade e o desenvolvimento pessoal e profissional...Essa vaga pode ser o seu lugar! 💼🚀#VemSerBennerResponsabilidades e atribuições&nbsp;&nbsp;Experiência com vendas consultivas de Software e soluções corporativas para o mercado;Gestão de todo o processo de vendas (pipeline e forecast);&nbsp;Elaboração de propostas consultivas envolvendo negociações de alta complexidade em vendas B2B, interagindo com as áreas internas para elaboração das propostas nos padrões de custo,&nbsp;qualidade e prazo negociados com os clientes;Relacionamento com gerentes de mercado, parceiros de negócios&nbsp;e equipes internas;Visitas à prospects dos setores: públicos, privados e de economia mista, com o objetivo de estreitar o relacionamento e identificar novos negócios&nbsp;;&nbsp;&nbsp;Gestão de agendas com registro de atividades no CRM;&nbsp;Gestão dos contratos dos novos clientes até a assinatura.&nbsp;&nbsp;Participação em Workshops, Eventos, e Campanhas de vendas.Requisitos e qualificaçõesNecessário: &nbsp;Necessário: Experiência na área de vendas em mercados B2B;Necessário: Experiência com venda de software;Bons conhecimento em Excel e Power Point, além do pacote office;&nbsp;Formação:&nbsp;Superior completo em Administração, Gestão Comercial ou relacionados.&nbsp;&nbsp;Cursos de especialização na área (Diferencial)Informações adicionais• Vale refeição/alimentação 🥗• Plano de saúde 🩺• Seguro de Vida 🥰🏘️• Plano odontológico 🦷• Day off de aniversário 🎉• Vale-transporte 🚍• Universidade Corporativa: IPED / Allura: Plataforma gratuita de educação corporativa 📚;• Incentivo a Certificação: Remuneração adicional a cada certificação de acordo com a política vigente (A partir de 3 meses na empresa)📚• Auxílio Educação: Reembolso de até 50% de Pós-graduação ou MBA. (A partir de 3 meses na empresa) 📚• Auxilio casamento(A partir de 1 ano);• Auxilio creche: (Valores alterados anualmente para crianças até 60 meses);• Bolsa maternidade/paternidade: Kit saída de hospital para o bebê; 👩🏽‍🍼• TotalPass 💪🏼",
            "careerPageId": 11857,
            "careerPageName": "Benner",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/2358/career/11857/images/2021-06-08_21-03_logo.jpg",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2025-02-12T20:19:26.482Z",
            "applicationDeadline": "2027-01-30T00:00:00.000Z",
            "isRemoteWork": false,
            "city": "São Paulo",
            "state": "São Paulo",
            "country": "Brasil",
            "jobUrl": "https://vemserbenner.gupy.io/job/eyJqb2JJZCI6ODYzOTg4Miwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": false
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://vemserbenner.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 8087305,
            "companyId": 26272,
            "name": "Banco de Talentos - QA Software Tester",
            "description": "A Wise tem a missão de transformar empresas, oferecendo soluções que otimizam processos e reduzem custos, ajudando-as a se tornarem mais produtivas e eficientes.&nbsp;&nbsp;Com um time espalhado pelo Brasil e Europa, a empresa possui um núcleo forte em Curitiba.&nbsp;&nbsp;O ambiente de trabalho valoriza autonomia, criatividade e companheirismo, promovendo aprendizado a partir de erros.&nbsp;&nbsp;A Wise incentiva o crescimento de seus colaboradores, sejam eles presenciais ou remotos, e busca pessoas dispostas a inovar e evoluir com a empresa.&nbsp;#vemprawise #sejawise #bewise #tester #qaResponsabilidades e atribuiçõesExecutar e planejar os casos de teste (manuais e automatizados) e analisar resultados.Realizar e concluir os testes de acordo com os prazos e seguindo os processos e utilizando&nbsp;ferramentas apropriadas de gerenciamento e automação de testes.Entender a complexidade do modelo de negócio do cliente e contribuir relatando bugs e erros para as equipes de desenvolvimento e ajudando a solucionar problemas.Participar ativamente na melhoria contínua do processo/produto do cliente.Requisitos e qualificaçõesO que você precisa ter para esta função:&nbsp;Conhecimento da pirâmide de testes;Conhecimento no ciclo de vida de testes e qualidade;Facilidade de compreensão de regras de negócio e documentação de software para usuários;Capacidade de documentar e solucionar erros;Conhecimento prático de software de gerenciamento de teste;Excelentes habilidades de comunicação (verbal e escrita);Atenção aos detalhes;Mente analítica e aptidão para resolver problemas;O que é um diferencial:&nbsp;Teste de regressão, conhecimento prático de Gerenciamento de Teste S/WConhecimento em criação de testes automatizados;Experência/conhecimento em BDD.Ciclo de Testes: Produto, UAT, Integrado e Regressivo.Gerenciamento de Tarefas: JiraBanco de Dados: relacional.API Testing Tool: Swagger e Postman.Metodologia Ágil: ScrumInformações adicionaisTrabalho Remoto ou Híbrido (a definir)Remuneração: A combinarCarga horária de prestação de serviço: 8 horas diárias, aproximadamente 168 horas/mês, de segunda à sexta.Contratação PJ (Pessoa Jurídica)Oportunidades de auxílio a obtenção à CertificaçõesTreinamentos - AluraHorário flexívelNo Dress Code",
            "careerPageId": 57035,
            "careerPageName": "Wise Group",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/26272/career/57035/images/2022-05-19_16-58_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2024-11-06T11:45:23.649Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Curitiba",
            "state": "Paraná",
            "country": "Brasil",
            "jobUrl": "https://wises.gupy.io/job/eyJqb2JJZCI6ODA4NzMwNSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://wises.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        },
        {
            "id": 8087205,
            "companyId": 26272,
            "name": "Banco de Talentos - Analista de Requisitos de Software",
            "description": "Seja bem-vindo a WISE!Somos uma empresa que desenvolve soluções em informática para organizações dos mais diversos portes e atividades. Operamos com dinamismo e inovação, oferecendo soluções específicas que otimizam processos, implementam ou reorganizam todo o sistema de informação das empresas. Oferecemos acesso rápido a informações essenciais para a tomada de decisões, gerando mais produtividade, agilizando processos e reduzindo custos para os nossos clientes. Nossa sede está localizada em Curitiba/PR, mas atuamos em todo o Brasil em nossos clientes e através do Home Office.Se Você é engajado, dinâmico, ágil, apaixonado por tecnologia, gosta de fazer a diferença no que faz, busca desenvolvimento profissional constante e uma empresa com bom clima de trabalho. O seu lugar é na WISE!Nossa empresa é voltada para as melhores práticas de desenvolvimento de software. Os projetos da WISE são diversificados e oferecem oportunidade para adquirir novos conhecimentos e atuar com várias tecnologias. Valorizamos novas ideias, criatividade, autonomia, companheirismo e bom humor. Seja Wise e venha fazer parte do nosso time!#vemprawise #sejawise #bewise #analistadesistemas #analistaderequisitos #vagaanalista #vagaResponsabilidades e atribuiçõesAtuar de forma consultiva, mapeando os processos de negócio dos clientes;&nbsp;Realizar o levantamento de requisitos;&nbsp;Realizar levantamento de estimativas;&nbsp;Elaborar especificações de negócio de customizações a serem incorporadas ao produto;&nbsp;Homologar o sistema com o cliente;&nbsp;Acompanhar os usuários na utilização da plataforma e realizar treinamentos;&nbsp;Participar de reuniões com o cliente&nbsp;Apresentar a ferramenta para novos clientes;&nbsp;Proceder com a implantação dos sistemas garantindo a qualidade do projeto.Requisitos e qualificaçõesO que você precisa ter para esta função:&nbsp;Conhecimentos de Banco de dados relacionais (SQL);Conhecimentos de UML;Conhecimento em modelagem de dados;Experiência com levantamento de requisitos;2 anos de experiência como analista;Comportamental: facilidade de trabalho em equipe, comunicação, iniciativa, dinamismo e responsabilidade.O que é um diferencial:&nbsp;Experiência anterior como desenvolvedor;Conhecimento de regras do negócio planos de saúde;Experiência em projetos ou produtos com integração de sistemas diferentes (web services);Experiência com metodologias ágeis;Conhecimento em contagem de pontos de função;Elaborar manuais do sistema.Conhecimento em ferramentas de desenvolvimento (Eclipse, Ireport, Squirrel);Conhecimento em linguagens de programação (Java, Javascript, Banco de dados, Xml);Informações adicionaisTrabalho Híbrido, com alguns dias de forma presencial em Curitiba/PRRemuneração: A combinarCarga horária de prestação de serviço: 8 horas diárias, aproximadamente 168 horas/mês, de segunda à sexta.Contratação PJ (Pessoa Jurídica)Oportunidades de auxílio a obtenção à CertificaçõesTreinamentosHorário flexívelNo Dress Code",
            "careerPageId": 57035,
            "careerPageName": "Wise Group",
            "careerPageLogo": "https://attachments.gupy.io/production/companies/26272/career/57035/images/2022-05-19_16-58_logo.png",
            "type": "vacancy_type_talent_pool",
            "publishedDate": "2024-11-06T11:28:57.167Z",
            "applicationDeadline": null,
            "isRemoteWork": false,
            "city": "Curitiba",
            "state": "Paraná",
            "country": "Brasil",
            "jobUrl": "https://wises.gupy.io/job/eyJqb2JJZCI6ODA4NzIwNSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
            "badges": {
                "friendlyBadge": true
            },
            "disabilities": true,
            "workplaceType": "hybrid",
            "careerPageUrl": "https://wises.gupy.io/eyJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9"
        }
    ],
    "pagination": {
        "offset": 0,
        "limit": 10,
        "total": 24
    }
}